{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Engwithan Digsite Underground.png\n| caption_map   = \n| name          = Arena sub-level\n| type          = Ruin\n| description   = \n| exits         = \n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Engwithan Digsite\n| plants        = \n| expected_level= 3\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = yes\n| can_camp      = yes\n| zone_id       = zn_09_port_maje\n| internalname  = AR_0912_Engwithan_Digsite_Sublevel\n| guid          = b9183368-d99b-4683-b200-7759e21737d9\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nThe winding corridors and passageways beneath the ancient Engwithan combat arena have been turned by the Vailians into a large adra refinery. The passage of Eothas turned them into a deathtrap, sucking the life out of all who hid in them. Wildlife has since creeped in, making itself at home.\n\n==Points of interest==\n* This is a dungeon crawl coupled with collecting everything that isn't nailed down otherwise. The first room contains an offering bowl - with History 2 you can identify that it was intended for use by Engwithans of a high rank or achievement. You can use the [[Champion's Medallion]] with the depression to open a hidden room, tomb of Ixandros the architect. Paying homage to Ixandros pays, as you get an [[Amulet of Health (Deadfire)|Amulet of Health]] and [[Adra Ban (Deadfire)|Adra Ban]] x2.\n* Ransack everything as you move down the corridors. The area to the southeast contains a memorial chamber with statues immortalizing Engwithan warriors of old. Down the steps is  the Trial of Flame, a vault that you can open by lighting the braziers (flint and tinder, torch, or fire godlike). To deactivate the fire, you need to press the upper left, lower left, and upper right triggers (two of them can be deduced from the shields in the memorial chamber, and the third shield is upstairs in the room opposite the Adra Pillar). Your prize is a [[Gladiator Sword]].\n* The room beyond has some brine imps and plenty of gunpowder barrels (the boom is really severe and dangerous), together with some minor supplies and a hidden glaive berry bush.\n* The central room is the menagerie, with an assortment of the usual wildlife.\n* The corridor beyond forks, with the western path leading to a dead end with some loot and a pair of rusted copper constructs used by the animancers for labor and deterrence against wildlife. The northern path leads to another fork: Left leads to Oderisi's workplace. You can find a flint and tinder there as well as a [[journal page (dig site)|journal page shedding light on what happened]].\n* The right route leads to the adra pillar and Oderisi's ashen corpse in front of it, still clutching the papers tightly.\n\n==Loot==\n* [[Amulet of Health (Deadfire)|Amulet of Health]]: In Ixandros' room.\n* [[Adra Ban (Deadfire)|Adra Ban]] x2: In Ixandros’ room.\n* [[Gladiator Sword]]: In the Trial by Flame room.\n\n==Gallery==\n<gallery mode=nolines widths=200px>\nPE2_Arena_Sub-level_Adra_before.png | Before restoring the adra pillar\nPE2_Arena_Sub-level_Adra_after.png | ..and after\n</gallery>",
  "title": "Arena sub-level"
}
