{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Ashen Maw 1.png\n| caption_map   = \n| name          = Ashen Maw\n| type          = Wilderness\n| description   = \n| exits         = The Sentinel Wall\n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Magran's Teeth\n| plants        = \n| expected_level= 12\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = yes\n| can_camp      = yes\n| zone_id       = zn_10_volcano_mountain\n| internalname  = AR_1001_Volcano_Mountain_Exterior\n| guid          = ba139aa2-d09a-40b5-a739-7bdfa449bcd6\n| lsc           = \n| icon          = Icon Ashen Maw.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nThick smoke, black as death, plumes from the peak of a rumbling volcano, the largest in the chain of mountains that makes up Magran's Teeth. A serrated fissure gapes in the mountainside, deep and dark but intermittently lit by a red-hot glow. \nThe cavernous opening is too narrow for your ship to sail through.\n\nThe skiff sways tumultuously in the superheated water the closer you row to the cave's cracked opening. Lava burbles down the mountainside, scorching rivers that disappear into the dark blue sea. Inside the rockface, the sound of churning magma grows louder, and the air warms around you, beading sweat along your brow.\n\n==Points of interest==\n* Eothas has made the passage easy for you, wiping out most of the [[Rathun]] that stood in your way. Snatch Grog next to you, then head towards the entrance to the citadel.\n* The almost-dead Rathun offers a bit of explanation as to what happened. You can:\n** Get more out of him with [[Religion]] 5 and [[History]] 7, or as a Priest of Eothas class.\n** Mercy kill by administration of poison, with [[Alchemy]] 4 and the following ingredients: [[Rune Powder]], [[Sapphire (Deadfire)|Sapphire]], [[Primal Water (Deadfire)|Primal Water]], and [[Reagent]]\n** Finish him. If you have [[Cruel]] 2 or greater, you do so very messily and with repeated stabs (average Cruel disposition gained, [[Xoti]] and [[Maia]] chimes in), otherwise you finish him quickly and efficiently ([[Edér]] and [[Serafen]] react).\n\n==Loot==\n* [[Grog]]: Wandering near the landing.",
  "slug": "ashenMaw",
  "title": "Ashen Maw"
}
