{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Boa Hika Pass.png\n| image         = PE2 Boa Hika Pass Foothills.png\n| caption_map   = \n| name          = Boa Hika Pass\n| type          = Scripted interaction\n| description   = \n| exits         = \n| sub_locations = Foothills\n| merchant      = \n| innkeeper     = \n| inhabitants   = Chief Echoing-Strike;Lagufaeth mage{{!}}Lagufaeth Mage;Lagufaeth sidewinder (Deadfire){{!}}Lagufaeth Sidewinder;Baby Boar\n| main_location = Tehiwai Islands\n| plants        = \n| lsc           = \n| icon          = Icon Cliffs.png\n}}\n'''{{Pagename nd}}''' is a scripted interaction on [[Tehiwai Islands]].\n\n== Background ==\nBoa Hika Pass is a low-lying route which passes under the mountains around central Tehiwai Island. Bordered by forests, it lies between the two main bodies of water on the island, serving as a funneling point for those travelling between the two sides of the island - travelers and wildlife alike.\n\nAs with other parts of the island, lagufaeth are known to lurk in the area.\n\n== Interaction ==\n* A low rumbling sound fills the air, accompanied by the shaking of the earth which steadily increases in intensity. As you come over a crest, you find that the stampede has passed - a few boars remain, fallen, with feathered darts protruding from their fur. A single piglet remains, nudging one of the downed beasts with its snout.\n* There are a number of overlapping options here, but two main paths; either approach openly OR using a '''Stealth 5''' check to sneak closer and observe.\n** (If you approached openly, or after sneaking and picking up the boar) - Use '''Perception 13''' to identify the darts as from native lagufaeth, and that you only have a few moments before they descend on the area. This will allow you to then:\n*** Draw weapons and attack openly or use '''Stealth 7''' to get the drop on the creatures (however you'll miss out the pet if you haven't already picked it up).\n*** If you're yet to grab the boar, you can attempt to grab it and flee, putting you in combat anyway.\n*** If you have already snuck up and grabbed the boar, you can leave freely.\n** Scoop up the [[Baby Boar]] to get yourself a new pet. This leaves you with the same options, but presents you with an opportunity to leave with the squirming prize piglet in-hand. If you approached openly, this requires a Watcher-only '''Might 10''' check - however, even if you pass you will be spotted by the lagufaeth, starting combat. If you instead approached stealthily, you will be able to leave without issue.\n** (Prior to approaching, or after sneaking up) Wait and watch, a few moments pass before a group of lagufaeths emerge from the trees. You can choose to ambush and attack (putting you in sneak at the edge of the area), or as a ... You will however miss out on the [[Baby Boar]].\n** All of the other choices involving approaching the downed boars (putting the boars out of their misery, or attempting to heal the boars) will leave you vulnerable and will begin combat. Attempting either won't actually do anything.\n* If you are attacked, or are able to sneak up on the creatures, this puts you in the [[Foothills]] staging area versus [[Chief Echoing-Strike]] (a named [[Lagufaeth redfin (Deadfire)|Lagufaeth Redfin]]), a couple of [[Lagufaeth mage|Lagufaeth Mage]]s, and a [[Lagufaeth sidewinder (Deadfire)|Lagufaeth Sidewinder]]. The rabble drop the standard lagufaeth loot, but Chief Echoing-Strike will always drop a [[Fine War Hammer (Deadfire)|Fine War Hammer]], a [[Lagufaeth Stiletto]] and a [[Ring of Overseeing (Deadfire)|Ring of Overseeing]].\n* If you leave before combat, or before grabbing the baby boar, you will be able return later.\n* The recommended path is to sneak up and grab the baby boar, you can then choose to investigate then ambush the lagufaeth for some experience and loot, or leave.\n\n== Gallery ==\n<gallery mode=nolines>\n RE si foothills.png\n Bestiary boar.png\n Bestiary lagufaeth.png\n</gallery>",
  "slug": "boaHikaPass",
  "title": "Boa Hika Pass"
}
