{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Cignath Mor 1.png\n| caption_map   = Entrance\n| image         = PE2 Cignath Mor 2.png\n| caption       = Main area\n| name          = Cignath Mór\n| type          = Ruin\n| description   = \n| exits         = Pillars of Eternity II: Deadfire world map{{!}}World map\n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| monsters      = Lagufaeth sidewinder (Deadfire){{!}}Enraged sidewinder;Lagufaeth mage{{!}}Enraged lagufaeth;Lagufaeth redfin{{!}}Enraged redfin;Lagufaeth broodmother (Deadfire){{!}}Enraged broodmother;Sea troll{{!}}Enraged sea troll;Sigil of Atrophy;Kraken (Deadfire){{!}}Kraken\n| main_location = Deadfire Archipelago\n| plants        = Cave Coral;Spire Sponge\n| expected_level= 10\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_15_rauatai_port\n| internalname  = AR_1504_Underwater_Dungeon_Entrance<br/>AR_1502_Underwater_Dungeon\n| guid          = 4f4d0d8b-f3f7-4adf-9192-27d3c0b2ab93<br/>41f19f7b-d0c8-4359-bbc2-ba17111f92c5\n| lsc           = \n| icon          = Icon Cignath Mor.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\n{{Description|As you fall through the depths, the water grows dark, but the glow below you ever brighter. Schools of gigantic fish twist and swirl around you, paying you no heed.\n\nSoon enough, you can make out the vague shape of a structure resting on the sea floor. Rising from the ruins of Cignath Mór is a tall spire and what appears to be a small landing platform.}}\n\nThe facility was a suboceanic research facility of the Engwithans and you can find out a good deal about their research, especially into the creation of various sea monsters by enlarging and manipulating the creatures of the Deadfire. A luminous adra pillar stretching deep beneath the ruins was used as a power source and left online after the ascension of Engwithans.\n\n==Points of interest==\n;Entrance\nA simple hall at the top of the structure, with a few pissed-off lagufaeth. Travel down the stairs to reach the deeper levels.\n;Main level\n* Now this is where things get interesting. You begin in the east and can explore the area in a decentralized manner. There are several plaques covering the experiments that took place at the facility. a plaque covering the creation of the Winding Serpent: \n\n{{Description|The Winding Serpent was our first success. Born of the common barracuda, we subjected the creature to the machine's vital energies, and it grew to immense proportions. It has since appeared to have developed something of a group mentality, often hunting in packs.}}\n{{Description|The Barbed Ravager was the direct result of our success with the Winding Serpent. We grafted poisonous barbs onto bull sharks and subjected them to the machine's energies. The creatures tripled, then quadrupled in size, assimilating the barbs into their bodies. And so a most fearsome predator was born.}}\n{{Description|The Leviathan was a folly born of purest hubris. After our experience with the Barbed Ravager, we decided to test the limits of the machine's growth capabilities. We entrapped a pod of blue whales and subjected them to the machine for months on end. Only a few of the creatures survived, but those that did...  They could not be contained.}}\n{{Description|The Kraken is a beast like none other. By applying the manipulation techniques we refined through in our work on the Leviathan, we increased both the size and intelligence of the common octopus, and they have since proved themselves to be ferocious hunters. There was one unfortunate side effect, however - they also became quite territorial.}}\n* With Mechanics 15, you can lockpick the door leading to the adra machine and mess with the first of the machines here, otherwise you can find the [[Underwater Dungeon Key|key]] in the southwestern room. Although the Engwithans built this place to last centuries, they did not anticipate you, Watcher. With Metaphysics 6, you can identify the working of the machine and shut it down. The large adra pillar can be identified with History 10 and Metaphysics 6 to figure out the purpose of the machines and the facility.\n* The rest of the facility can be explored - and should be. Lagufaeth infest it and will randomly attack from pools and the like, but they are mostly scattered and easy to pick off.  The treasure room in the northwest with the unique spear [[Mohorā Tanga]] is accessed by solving a puzzle. The clues are the mosaics on the walls. Press the images in the following order: serpent - shark - whale - kraken.\n*Now, choices. You can:\n** Disable the Engwithan machine that makes the corals grow. This will anger [[Galawain]], who confronts you with a [[Kraken]] to fight on your way out of the structure. You can loot the unique helm [[Mask of the Grotto Deep]] and a [[Kraken's Eye]] off him. This result is preferred by the Fleet Master.\n** Leave the machine operating and disable three pylons to flood the ruins. If you attempt to disable the machine first, [[Galawain]] promises you a boon for disabling the pylons instead. Once the ruins are flooded, you dive up to your ship; the watcher must pass a [[Mechanics]] 9 or [[Athletics]] 10 check to avoid injury. If [[Galawain]] promised a boon, the watcher gains [[Status effects (Deadfire)#Permenent effects|Savage Cunning]] (+1 [[Perception]], +2 [[Survival]]). upon returning to the surface. The Fleet Master is unhappy with this result, which leads to a moderate reputation loss with the [[Royal Deadfire Company]]. The reputation loss can be recouped by passing a diplomacy check.\n\n==Enemies==\n* Note that all enemies in this area have the \"Enraged\" prefix, which grants them Galawain's Rage; the inspirations [[Status effects (Deadfire)#Inspirations|Tenacious]] (+5 Might, +2 Penetration) and [[Status effects (Deadfire)#Inspirations|Hardy]] (+5 Constitution, +2 Armor), boosting their stats slightly. When killed, they will contribute experience to the normal version of the creature in the bestiary.\n;Entrance\n* [[Wilder]]\n** [[Lagufaeth sidewinder (Deadfire)|Enraged Sidewinder]] (x2)\n** [[Lagufaeth mage|Enraged Lagufaeth]] (x2)\n* [[Beasts]]\n** [[Kraken (Deadfire)|Kraken]], should you defy [[Galawain]].\n;Main area\n* [[Wilder]]\n** [[Lagufaeth sidewinder (Deadfire)|Enraged Sidewinder]] (x3)\n** [[Lagufaeth mage|Enraged Lagufaeth]] (x6)\n** [[Lagufaeth redfin (Deadfire)|Enraged Redfin]]\n** [[Lagufaeth broodmother (Deadfire)|Enraged Broodmother]]\n** [[Sea troll|Enraged Sea Troll]] (x2)\n* [[Sigils]]\n** [[Sigil of Atrophy]]\n\n==Loot==\n* [[Mohorā Tanga]]: In the treasure room.\n*[[Mask of the Grotto Deep]]: On the kraken\n\n==Gallery==\n;Mural puzzle\n<gallery mode=nolines>\n 15 si mural 1.png\n 15 si mural 2.png\n 15 si mural 3.png\n 15 si mural 4.png\n 15 si mural 5.png\n</gallery>\n\n[[Category:Pillars of Eternity II: Deadfire dungeons]]",
  "title": "Cignath Mór"
}
