{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Deadlight Dungeon.png\n| caption_map   = \n| name          = Deadlight Dungeon\n| type          = Dungeon\n| description   = \n| exits         = Deadlight Court;Secret Dock\n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = Oromino;Cookie Maina\n| main_location = Fort Deadlight\n| plants        = \n| expected_level= 5\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_13_pirate_fort\n| internalname  = AR_1304_Pirate_Fort_Dungeon\n| guid          = c84fe64d-7c7a-4537-b8b9-2bbeab02a387\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nThe dungeons below the Fort serve as storage and jail for the Principi currently in control of the Fort.\n\n==Points of interest==\n* The dungeons are expansive, but patrolled by relatively few guards. However, if you attack any of them, they will instantly sound the horn and the entire fort will turn hostile. \n* You can find the armory and the nearby entrance to the forge section of the [[Deadlight Court]] to the southwest. There's an alternate access route, a door in the southeast that can be opened using a hidden switch on the wall.\n* To the northeast are the Court's kitchen and the gunpowder stores, guarded very closely.\n* Access to the Secret Dock is through the west door of the kitchen.\n* To the southeast is the brig. You can talk to [[Oromino]] here to learn why [[Lamond]], a captain, is working the forge instead of running his own ship. He will also ask you to find the key to release them (found in the southeastern end, down the hall from the cells). Alternatively, with Mechanics 4, you can just lockpick the cell.\n\n==Characters==\n* [[Oromino]]: A member of [[Lamond]]'s crew. He's jailed in the brig to the east.\n* [[Cookie Maina]]: Fort Deadlight's cook, in the kitchen to the north. She'll provide you with a [[Special Stew|stew]] for the quest [[Blow the Man Down]].",
  "title": "Deadlight dungeon"
}
