{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 PH Int 1.png\n| caption_map   = Level one\n| image         = PE2 PH Int 2.png\n| caption       = Level two\n| image2        = PE2 PH Int 3.png\n| caption2      = Level three\n| name          = Engwithan Waystation \n| type          = Ruin\n| description   = \n| exits         = \n| main_location = Poko Kohara ruins\n| sub_locations = The Adra Realm\n| merchant      = \n| innkeeper     = \n| inhabitants   = Olara;Falero;Dueno;Beza;Xakoras\n| expected_level= 6\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = yes\n| can_camp      = yes\n| zone_id       = zn_02_poko_kohara\n| internalname  = AR_0202_Poko_Kohara_Int_01<br/>AR_0203_Poko_Kohara_Int_02<br/>AR_0204_Poko_Kohara_Int_03\n| guid          = 6c59ed92-0840-4a40-8157-c52fc59540f3<br/>8f8bca05-2d6d-4436-99d0-c0cbd1f73b7f<br/>367d3e31-790c-4178-976f-a7e8735d209e\n| lsc           = LSC ar 0202 poko kohara int 01.png\n| icon          = \n}}\n'''Engwithan waystation''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nThis large facility located on a desert island called [[Poko Kohara]] in modern tongues was once the factory where Engwithans took [[Huana]] they lived with and sacrificed them, using their essence to create [[luminous adra]] for use in their machinery. Long sealed and defended by [[Engwithan Titan]]s, the facility has weathered the passage of time well - enough for a Huana priest to harness the power of the adra pillar for his own ends.\n\n==Points of interest==\n;Level one\n* As usual, you enter the waystation from the southwest. The antechamber is in good shape and has some VTC supplies ([[Flint and Tinder (Deadfire)|Flint and Tinder]], [[Torch]], some miscellaneous consumables). In the corridor beyond is a mural depicting the [[Huana]] and the [[Engwithan]]s together. The northern corridor leads to a heavily trapped room where the traps are quite lethal. The 11 [[Caltrops Trap]]s can each be disarmed with Mechanics 6. The mural in this room depicts both cultures gathering around a blue flame. A hidden brick under it reveals a secret room that contains a pair of unique [[Engwithan Bracers]], and a long-forgotten Huana crocodilian idol.\n* The other side contains a number of enemies, including [[Scarab beetle]]s and [[Luminous revenant]]s, among remnants of a chamber that collapsed under the weight of sand and stone from the outside. The central room contains the tip of a luminous adra pillar, which you can activate to see a small cutscene. This room leads deeper into the station, through a passageway lit with magical fire. More scarabs, and a [[Skeletal sorcerer]] wait at the bend, together with a small trapped stash near the pillar. The chamber beyond contains the tip of another luminous adra pillar, this time much larger, together with another mural depicting the Huana prostrating themselves before a magical pillar. Upon entering the room, one of your companions will say something witty. Head down the stairs to proceed to the next level.\n;Level two\n* You start in the northeast, near the base of the adra pillar that appears to be corrupted somehow. Head to the chamber nearby to find another body belonging to the VTC expedition, together with the [[Poko Kohara expedition log]] that sheds light on what happened to the expedition. There's also a mural on the wall, depicting an Engwithan sacrifice of a Huana native. With Mechanics 10, you can lockpick the door to the northwest to enter the tomb and skip to level 3, otherwise you'll need to take the long way around.\n* The pool room to the southeast is filled with [[Desert imp]]s, that come to life as you approach, as well as a single [[Greater black ooze (Deadfire)|Greater black ooze]]. The long corridor beyond this contains even more imps. The room with the burning torches across the hall breaks up the monotony by offering [[Desert spider]]s and [[Desert spiderling]]s. Destroy the stacked gunpowder barrels to reveal a secret tomb with [[Marux Amanth]], a soulbound dagger as well as a number of other goodies. The room also contains a body with an [[Old Copper Key (Poko Kohara)|Old Copper Key]].\n* The vast chamber to the southwest is beautiful, intimidating, and full of skeletons that climb up from the depths. Once you dispose of them and take in the sights, inspect the room to the southeast (mind the traps by the stairs - they can be removed with Mechanics 7). As you clear the threshold, you will be attacked by an [[Engwithan saint]] and three [[Corrupted adra animat]]s, who will come to life once you enter combat. The room seems to have been used to sacrifice Huana natives to power up the adra within the facility. The body of [[Falero]], a member of the VTC expedition lies in the center of the room.\n* There's another tomb at the end of the grand hall to the west, belonging to [[Xakoras]], another Engwithan Saint. He will awaken when you enter the room and attack, spawning revenants, skeletons, and animats. The tomb you could cut through in the beginning is opposite the corridor leading to level three, and contains more animats, as well as an [[Adra ooze]]. The trapped chest contains minor loot.\n* Finally, the door to level 3 can be accessed it's defended by a pair of corrupted animats and a sigil of nightmares. If you looted the [[Sigil of Nightmares Wardstone]] from Falero, now would be a good time to activate it (or simply destroy the sigil). The door is opened with the old copper key, looted from a body in the spider room.\n;Level three\n* The deepest level of the waystation. In the center is an electric trap that sends out bolts of electricity (giving you [[Status effects (Deadfire)#System Shock|System Shock]], -2 Perception, -3 Shock Armor Rating) unless you take out the essence batteries surrounding it. More importantly, the body of [[Beza]] is in the southwest, smashed to death by some unspoken horror. You can read her soul to get an idea of what happened, as well as collect [[Beza's pages]], a [[Ngati Idol]], and her weapon, [[Beza's Toothed Blade]]. Beyond that, a mural on the wall depicts the Huana sacrifices appearing to supply the pillar with energy. Make your way down the southeastern corridor to the pillar of corrupted adra to finalize [[The Storms of Poko Kohara]]. \n* A staircase on the northeastern side of the room exits directly to [[Poko Kohara ruins]], opening a shortcut to level three. Otherwise, interacting with the corrupted adra pillar opens a rift to [[The Adra Realm]].\n\n==Enemies==\n;Level one\n* Beasts\n** [[Scarab beetle]] (x6)\n* Vessels\n** [[Luminous revenant]] (x2)\n** [[Skeletal sorcerer]]\n;Level two\n* Primordials\n** [[Desert imp]] (x5)\n** [[Greater black ooze (Deadfire)|Greater black ooze]]\n** [[Lesser black ooze (Deadfire)|Lesser black ooze]] (x2), split from the greater ooze when killed.\n** [[Adra ooze]]\n* Beasts\n** [[Desert spider]] (x2)\n** [[Desert spiderling]] (x4)\n* Vessels\n** [[Skeletal warrior]] (x3)\n** [[Skeletal archer]] (x2)\n** [[Skeletal brigand]]\n** [[Skeletal sorcerer]]\n** [[Adra animat (Deadfire)|Adra animat]] (x2)\n** [[Corrupted adra animat]] (x6)\n** [[Engwithan saint]]\n** [[Xakoras]], an [[Engwithan saint]] with slightly boosted stats. He spawns the following enemies (unless killed):\n*** [[Luminous revenant]] (x2)\n*** [[Adra animat (Deadfire)|Adra animat]]\n*** [[Skeleton (Deadfire)|Skeleton]] (x3)\n*** [[Skeletal sorcerer]] (occasionally just stands in the corner, falls over when interacted with)\n* Misc\n** [[Sigil of Nightmares]]\n==Loot==\n* [[Engwithan Bracers]]: Secret room, in the northwest corner of level one.\n* [[Marux Amanth]] (''The Dead Soul''): In the secret room on level two, accessible by destroying the gunpowder barrels.\n* [[Scroll of Pull of Eora]], [[Scroll of Ray of Fire (Deadfire)|Scroll of Ray of Fire]]: A vase in the room with the large luminous adra pillar.\n* [[Sigil of Nightmares Wardstone]]: From [[Falero]]'s body in the southwestern room of level two.\n* [[Beza's Toothed Blade]]: Looted from the body of [[Beza]] on level three.\n\n[[Category:Pillars of Eternity II: Deadfire dungeons]]",
  "title": "Engwithan waystation"
}
