{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Gorecci Street.png\n| caption_map   = \n| name          = Gorecci Street\n| type          = District\n| description   = \n| exits         = \n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = Ilari\n| main_location = Port Maje\n| plants        = \n| expected_level= 2\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_09_port_maje\n| internalname  = AR_0916_Port_Maje_Street\n| guid          = 680a2ca7-c3da-418d-b4b0-be2db6bd4b2b\n| lsc           = \n| icon          = Port Maje Map Area Streets.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\n{{Description|As you make your way along through the side streets of Port Maje, you come upon visible traces of the storm's passing.\n\nMany of the houses here boast cracked window panes and sagging awnings, and you pass narrow streets strewn with foliage and debris.\n\nThe cobblestones beneath your feet are still slick with water and silt.\n\nBefore long you are ankle-deep in sucking mud and loose stones.\n\nThe flooding only worsens up ahead, where the water level rises to the knees. Most of Port Maje's residents have fled this region for dry land.\n\nBut the murmur of raised voices ahead, and the occasional splash, suggest that you are not entirely alone.}}\nA street in the western part of [[Port Maje]], Gorecci has been hit by the flooding in the wake of Eothas' passing.  The flooding damaged most of the buildings in the area and forced residents to flee for dry land, creating a ripe opportunity for unscrupulous scavengers and looters.\n\n==Points of interest==\n* This is a small area representing the looted sections of Port Maje. If you arrived from the north, move forward to meet a pair of looters who will immediately attack you unless you successfully sneak past them. They can be disposed of without penalty. If you arrived from the south you can walk past them without them catching up with you even if you aren't sneaking. [[Ilari]] and his gang are found in the northwestern corner.\n* Two souls which can be harvested by [[Xoti]], otherwise can be asked follow you.\n\n==Characters==\n* [[Ilari]], the local gang leader\n\n==Loot==\n* [[Protective Eothasian Charm]]: Hidden in the bucket in the well, requires [[Perception]] 13 to detect.\n\n==Gallery==\n<gallery mode=nolines widths=200px heights=200px>\n09 si port maje gorecci street.png | SI graphic\n</gallery>",
  "slug": "gorecciStreet",
  "title": "Gorecci Street"
}
