{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Hall of the Unseen.png\n| caption_map   = \n| name          = Hall of the Unseen\n| type          = Ruin\n| description   = \n| exits         = \n| sub_locations = Temple of Revelation\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| monsters      = Spectre (Deadfire){{!}}Spectre;Shade (Deadfire){{!}}Shade\n| main_location = The Black Isles\n| plants        = \n| expected_level= 12\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_26_uncharted_islands\n| internalname  = AR_2606_Maze_Of_Wael\n| guid          = a53dce70-3d0c-4c29-a535-9ad7c4a21132\n| lsc           = \n| icon          = Icon Ruins Stairs.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\n{{Description|After an arduous journey, you finally reach the center of the volcanic devastation. Before you is a broad-faced stone building rugged with age.\n\nThe eye of Wael, solitary and all-seeing, is emblazoned above the door.}}\n\n==Points of interest==\n* This is a large temple composed of four concentric rings. You enter in the north-easternmost point of the map. Your goal is to reach the central area, but the way in can be tricky. The northeastern door in the second circle can be opened when the three preceding doors are open ''and'' a character stays behind to activate the eastern plate in the northernmost outer circle.\n* Then the door to Wael's chamber can be opened by pressing the switch two doors before the entrance, then the northern one in the room before it.\n* The switch on the wall inside the central chamber opens all doors, but spawns 3 spectres and a shade. Collect [[The Eye of Wael]] from the central pedestal afterwards, though you can do this beforehand without needing to kill the spectres.\n* If you have started the quest [[Hidden Depths]] {{fs}}, there is no need to complete the puzzle or fight the spectres. Upon entering the zone, all of the doors will magically open, freeing the way to the central area. Once you reach the center, [[Llengrath]] will greet you and open the way to the [[Temple of Revelation]].\n\n==Solution==\n{{Note|This is only one of many possible solutions}}\n* The image '''in the gallery below''' outlines the steps required to open the central room. Simply activate ''only'' the switches marked, in numerical order. Once your party is at the switch for step 9, leave a character at that switch, then send the rest of the party to stand in the small area containing the two switches for step 10 and 11. Use the character you left behind to activate switch 9, thereby opening the way to the central chamber. To let the remaining party member through, activate switch 10, then 11 (though this isn't required, and it doesn't matter which order you pull these). \n\n==Loot==\n* [[The Eye of Wael]]: In the center.\n* [[Eliel]]: A pet dog, in the inner ring.\n\n==Gallery==\n<gallery>\nFile:RE si uncharted 06 wael ruin.png| SI graphic\nFile:PE2 Hall of the Unseen solution.png| Puzzle solution\n</gallery>\n\n[[Category:Pillars of Eternity II: Deadfire dungeons]]",
  "slug": "hallOfTheUnseen",
  "title": "Hall of the Unseen"
}
