{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Hasongo.png\n| caption_map   = \n| name          = Hasongo\n| type          = Town\n| description   = \n| exits         = \n| sub_locations = Storage tower;Cannon rampart;Dining hall;Kitchen;Engineering workshop;Fleet Master's Office (Hasongo){{!}}Fleet Master's Office;Lighthouse (Deadfire){{!}}Lighthouse\n| merchant      = \n| innkeeper     = \n| inhabitants   = Zuhira;Sugaan;Aimuro;Bearn;Yanass\n| main_location =\n| plants        = \n| expected_level= 8\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = yes\n| can_camp      = yes\n| zone_id       = zn_11_hasongo\n| internalname  = AR_1101_Hasongo_Ext\n| guid          = 742661d5-70cb-4e83-bb7b-5d0ea9e9a9ee\n| lsc           = \n| icon          = Icon Hasongo.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nHasongo is a strategic port of the [[Royal Deadfire Company]], being a crucial stopover point for food convoys back to [[Rauatai]]. The recent destruction wrought by Eothas has wiped it out and endangered the lifeline to the heart of the Empire. To make things worse, the heavily damaged and depopulated fort came under attack from Naga, nearly wiping out the Rauatai contingent and the Dawnstars hired by the Fleet Master to handle the fields outside the walls.\n\n==Points of interest==\n* You begin the slog through the ruins of the port in the south-eastern corner. Both [[Maia Rua]] and [[Edér]] have unique interactions when you arrive. You need to navigate the entire map in order to get through to the lighthouse, so better start early. Move off the pier and fight off the [[Coral nāga warrior]] (another comes out of the water when you approach the broken boardwalk to the west), then enter the [[storage tower]] to the northeast. Talk to [[Zuhira]] to get some intel and learn that there is still an intact bombard on the walls of the fortress.\n* Head north to the [[Cannon rampart]], fighting 3x [[Coral nāga archer]]s on the top of the wall (annoyingly behind a dozen or so barrels), and another warrior by the bombard itself. Movement abilities like [[Leap]] or [[Evasive Roll]] work well here to avoid having to deal with the barrels. Just west of the bombard you'll be able to cross over from the cannon rampart roof to the kitchen roof with [[Athletics]] 4 and a [[Rope and Grappling Hook (Deadfire)|Rope and Grappling Hook]]. This helps you avoid being spotted by a nāga warrior on the edge of the water, though you can also just sneak by.\n* In order to operate the bombard you'll need a few things:\n** An operator, either with Maia in your party, [[Mechanics]] 10, or with the [[Artillerist's Manual]]. The manual can be found in the cannon rampart, in the area just under the bombard.\n** [[Explosive Shell|Ammunition]], found in Aimuro's workshop by the northern gate (Zuhira can give you the [[Storeroom Key|key]]).\n** A way to move the swiveling mechanism, to get it pointed in the right direction. Either using someone with at least [[Might]] 18, or with [[Cooking Fat]] from the kitchen to loosen up the gears.\n* Once fired, it will make short work of all the nāga in the central area, and will clear the rubble leading to the fleet master's office.\n* The northeastern corner contains the [[kitchen]] and the piers, where you can wipe out some looters for loot. The kitchen has the ladder to the rooftop with a work crane, and the scripted interaction - the submerged corridor:\n** Going left leads to the hidden part of the rampart where you can find [[Yanass]]. Require [[Might]] 14 or a [[Prybar (Deadfire)|prybar]].\n** Going right leads to the dining hall, bypassing the group of nāga led by a [[Coral nāga shaman]] guarding the way across the water. Require an [[Athletics]] 8 check on all party members.\n* The northwestern sector has the [[dining hall]] and [[engineering workshop]]. You can ascend to the ramparts over the northern gate wall, which leads directly to the lighthouse:\n** Climbing the wall, requiring an [[Athletics]] 8 check on all party members. If any character fails, you will be unable to scale the tower, and the character with the lowest Athletics will get a [[Twisted Ankle]] (-20 Reflex).\n** Ascend using a [[Rope and Grappling Hook (Deadfire)|Rope and Grappling Hook]]. However this method will make noise, calling two more nāga warriors jumping out of the water, you can quickly climb the wall before they find you or simply kill them.\n* The central area crawls with nāga, so you might want to bypass it. \n* The southwestern part contains the [[lighthouse (Deadfire)|lighthouse]] and the [[Fleet Master's Office (Hasongo)|fleet master's office]]. A pathway connects the roof of the engineering workshop to the roof of the office, where a couple of nāga archers await. From the office itself, you can head west up some stairs to reach the lighthouse.\n* The central-southmost point of the map, by the broken boardwalk and just south of the group of nāga in the center, is empty, but a nāga shaman and warrior will jump out of the water when you approach the totem. You can get a rope and grappling hook from a chest in the corner if you're in need of one.\n\n==Characters==\n* [[Zuhira]], an RDC survivor\n* [[Sugaan]], the naga\n* [[Aimuro]], an RDC engineer\n* [[Bearn]]\n* [[Yanass]], a naga soul\n\n==Loot==\n* [[Corlagon]]: At the top of the lighthouse.\n* [[Strand of Favor]]: Carried by Sugaan.  Note:  you can pickpocket another strand of favor off of Sugaan if you do so before proceeding to restore the Adra pillar.\n* [[Exceptional Leather Armor (Deadfire)|Exceptional Leather Armor]]: On a hidden body, crushed under Eothas' first left foot print.\n* [[Currency#Bronze Hon|Bronze Hon]]s, [[Currency#Bronze Ōa|Bronze Ōa]]s, [[Currency#Old Bronze Ōa|Old Bronze Ōa]]s, [[Currency#Brass Teo|Brass Teo]]s, and [[Currency#Silver Utoki|Silver Utoki]]s,  can be looted from each of the ash-turned corpses dotted around the area.\n\n==Gallery==\n<tabber>\nBroken bridge=\n'''Crossing the broken section of wall to the north:'''\n<gallery mode=nolines>\n 11 si broken bridge default.png\n GEN SI woodBeam grapHook.png\n 11 si broken bridge rope.png\n 11 si broken bridge shimmy.png\n</gallery>\n|-|\nBombard=\n'''The brass bombard to the northeast:'''\n<gallery mode=nolines>\n 11 si cannon sea.png\n 11 si cannon fortress.png\n</gallery>\n|-|\nNorthern Gate=\n'''Scaling a wall by the northern gate outside the dining hall:'''\n<gallery>\n 11 si gate tower default.png\n 11 si gate tower grapple hook throw.png\n 11 si gate tower grapple hook attached.png\n Px2 05 si infiltration 03.png | Climbing up\n 11 si gate tower climb.png | Climbing down\n 11 si gate tower no rope climb.png | Climbing with no rope\n 07_SI_Raedrics_Hold_Bell_Tower_02.png | Failing to climb\n</gallery>\n</tabber>",
  "title": "Hasongo"
}
