{
  "raw": "{{Infobox location poe2\n| game          = lax1\n| map           = lax1 Kōhatekana Expanse.png\n| caption_map   = \n| name          = Kōhatekana Expanse\n| type          = Wilderness\n| description   = \n| exits         = \n| main_location = Kazuwari\n| sub_locations = \n| merchant      = \n| expected_level= -1\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = lax01_worldmapencounters\n| internalname  = RM_LAX01_WorldMap_Jungle_01\n| guid          = 0037971c-3b8e-4276-8bd1-80351ea938da\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{lax1}}.\n\n==Background==\nA dense forest to the southwest of Kazuwari, with a seemingly endless stretch of trees mired in milky gray fog. It is a region of the island devoted to the Seeker.\n\n==Points of interest==\n* As with the other locations, entering the Expanse triggers a scripted interaction. Once you enter the forest and reach the heart, you can inspect the trails with Survival 11, to learn that the absence of tracks indicates the trails were hardly ever traveled. The left path leads to a Seeker statue. With History 10, you can interpret it as a defacement that's essentially an insult to the Seeker's cult. \n* However, navigating the paths will eventually trigger seemingly random abductions of your party members by the spiders. Once the party is empty save for the Watcher, the trails will start leading forward, eventually down into a cave. Of course, there will be more spiders inside and you will be able to rationally search for enemies, demand friends back (passionate), or continue cautiously forward. Once you find the skulls, you will be faced with an attack by a coterie of spiders.  The dire weaver is the boss enemy, but unlike with the Slayer, to advance the quest you'll need to interact with the shimmering soul. [[Aexica]] will appear, representing the Seeker's aspect, and implore you to heal the tear at the heart of Kazuwari.\n*Once you choose a path for the first time you can avoid the random abductions by inspecting the statue after every path choice and selecting Left or right path according to the eye placement of the statue ( Follow the corresponding path of the filled eye socket)\n\n==Characters==\n* [[Aexica]], aspect of the Faces.",
  "title": "Kōhatekana Expanse"
}
