{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Maje Island.png\n| caption_map   = \n| name          = \n| type          = Island\n| description   = \n| exits         = Pillars of Eternity II: Deadfire world map{{!}}World map\n| main_location = Deadfire Archipelago\n| sub_locations = Vilario's Rest;Port Maje;Engwithan Digsite\n| merchant      = \n| internalname  = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|landmass]] in {{poe2}}.\n\n==Background==\nA large island that hosts the first [[VTC]] colony in the [[Deadfire]], split in half by a natural channel.\n\n==Locations==\nThis is the starting island in the game and as such, its difficulty is modest.\n<!--  I've used indents instead of a bulleted list to prevent wrapping back around the icon. A style-less table would accomplish the same thing without the need to use br - but would not wrap around the infobox -->\n;Major locations\n[[File:Icon Vilario's Rest.png|50px|left]]\n:::'''[[Vilario's Rest]]''': A beautiful beach to the southwest of the island. The Defiant is beached here when you first start the game. <br clear=\"left\" />\n[[File:Icon Port Maje.png|50px|left]]\n:::'''[[Port Maje]]''': The Vailian colony.<br clear=\"left\" />\n[[File:Icon Engwithan Dig Site.png|50px|left]]\n:::'''[[Engwithan Digsite]]''': A former Engwithan ruin turned luminous adra refinery.<br clear=\"left\" />\n\n;Minor locations\n[[File:Icon Caravan.png|50px|left]]\n:::'''Ilonet's Fork''': A crossroads in the western half of the island. Upon approaching it, you can sneak up ([[Stealth]] 1) and find a group of stranded pilgrims from [[Readceras]]. They are following Eothas and you can aid them for a reputation gain with the [[Children of the Dawnstars]] (or attack/ignore for the opposite). Of course, you can also help them and use Sleight of Hand to snatch their strongbox. Helping them requires 15 [[Might]] and is worth 15 silver fenning ({{cp2|90}}).\n[[File:Icon Forest Dark.png|50px|left]]\n:::'''Upoho Wharo Woods''': Blocking the passage to the old battlefield, you can inspect the marks left behind on thee tree ([[Survival]] 2/[[Perception]] 12) to figure out that a wild boar left them - and find a magical sigil. Then you can sneak forward and hide in the bushes to find a tall island aumaua surrounded by boars... The old druid can be pacified by pointing out you are hunting Eothas or protecting the lands, which will result in him giving you the [[Wise Teeth Necklace]].\n[[File:Icon Forest Dark.png|50px|left]]\n:::'''Whakura Pass''':  A necessary stop on the way to the Engwithan Digsite. The trail is thoroughly disturbed and you can use [[Perception]] and [[Survival]] to search the area. With 13 [[Perception]] you can locate a trap and disarm it with 2 [[Mechanics]]. Further, you can search for the xaurips and engage them. A Ranger can send their animal companion to distract them, while a Cipher can stoke their anger and have them attack each other over the loot they stole from the travelers killed by Eothas. If they disappear, you can take what they left behind with impunity.\n;Other\n* A burial site in the west.\n* An old battleground in the north.\n* A solitary rice farm on the peninsula to the south, offering trade in food at 50% discount. That includes rice, taar loaf, and lots of rice wine.\n* A shipwreck on the northeastern tip:\n** High chance of getting Huana color and resources.\n** Moderate chance of getting cannons.\n** Very low chance of getting [[Spyglass]].\n\n==Nearby islands==\n* A small temperate island to the west has [[Meryel the Mad]] and an abandoned village.",
  "title": "Maje Island"
}
