{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Mara-Mara Trench.png\n| image         = \n| caption_map   = \n| name          = Mara-Mara Trench\n| type          = Scripted interaction\n| description   = \n| exits         = Pillars of Eternity II: Deadfire world map{{!}}World map\n| sub_locations = \n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = The Windless Wastes\n| plants        = \n| internalname  = re_si_sea_creature_whale<br/>(Starting node: 27)\n| lsc           = \n| icon          = Icon Reef.png\n}}\n'''{{Pagename nd}}''' is a scripted interaction in {{poe2}}. It is located in the shallows to the north-west of [[Splintered Reef]], at the coordinates 30° 39' S, 66° 30' E.\n\n== Background ==\n{{Description|The choppy seas stretch towards the horizon, curls of dark blue capped with lines of foamy white.\n\n\"Captain!\" shouts [Crew member] from the rigging. \"There's something in the water to port!\"}}\n\n== Interaction ==\nThis interaction bears resemblance to [[Te Hika Fishing Pools]], though some of the checks and results are different. In in this interaction, you gain more rewards - but there is a possibility of a crew member being killed in the process.\n\nWhile in the shallows of the Mara-Mara Trench, your crew spots a large creature emerging from the water to the portside of the ship.\n* With a [[Survival]] 8 check, you or a party member can identify it as a ''Bowhead'' whale (though some crew seem to think it's a ''Wallface''). Its V-shaped spout is formed due to the presence of two blowholes, which erupt in a spray of water as it emerges.\n* You can ask your crew for their thoughts. One mentions that the bowhead whale is one of the best for hunting in the whole of the Deadfire, however some express concern in the dangers of doing such a thing, as if the creature should dive - it may take their hunting skiff with it. Another is appalled that they'd consider killing one of [[Ondra]]'s harbingers and squander such a blessing.\n* If the Watcher is a [[Cipher]], you can reach out to the beast's mind. The creature's mind isn't as blank as you'd expect from a fish, not as advanced as a wilder - but more intelligent than a horse or a cow.\n\nUltimately you have two choices here, to let the creature pass in peace, or hunt the creature for its meat. \n* Let the creature pass: Your crew members resume their duties, and you sail onwards. The beast keeps pace with the skip for several hours, singing a song of the sea - it's tune resonating with the planks of ''The Defiant''. One of your crew throws bits of [[Hardtack]] to the beast, though another mentions that they don't eat hardtack. If [[Edér]] is in the party, you gain positive disposition with him (Animal Kindness). You also gain 10 Morale, and the crew earns 210 experience and 2 Sailor Experience.\n* Take up spears and prepare for a hunt: Your crew lower a skiff from the ship and grab their harpoons. If [[Edér]] or [[Maia Rua|Maia]] are in the party, you gain negative disposition with them (Animal Cruelty).\n** One of your crew leaps from the skiff and drives a harpoon into the beast's flesh, it thrashes and slaps the crew member from its back and into the water, injuring them in the process (-2 Morale, crew member injured). With a line from the harpoon attached, it drags the skiff in a wide circle around the ship.\n** With a Watcher-only party-assisted [[Insight]] 4 or [[Survival]] 5 check, you can identify the danger that they would be in if the whale should dive. This knowledge gives you the option whether to continue or abort the hunt (which will also show the required skill to successfully pass). If you don't pass the Insight/Suvival check, your crew will continue as normal and you will not be able to foresee and circumvent the dangers.\n** Continuing, this requires a Deckhand 5 check in order to succeed.\n*** Passing the check - Over the next 18 hours, your crew eventually wears the beast's strength enough for them to be able to put it out of its misery with a few swift swings of a hatchet (though another crew member is injured in the process). The beast's corpse is heaved onto the ship and stripped of its meat and oils. Your crew gains 10 Morale, 50x [[Mohorā Meat]], 210 experience and 2 Sailor experience.\n*** Failing the check - The whale dives beneath the waves, dragging the skiff and its crew with it. After a few seconds, the crew bob back to the surface, sputtering and swearing - though one of your crew does not, and is killed.\n** If you fail to hunt the beast (either by backing off, or having it drag the skiff below) - You lose 5 morale, and your crew gains 189 experience and 2 Sailor experience.\n\n==Trivia==\n* This interaction only appears if you have at least two sailors crewed to your ship, and you are at least level 2.\n* Two other variations of this interaction exist in other parts of the Deadfire - including [[Te Hīka Fishing Pools]].\n\n== Gallery ==\n;Scripted interaction graphics\n<gallery mode=\"nolines\">\nFile:RE si sea monster shadow.png\nFile:RE si whaling.png\nFile:Re si victory.png\n</gallery>",
  "slug": "maraMaraTrench",
  "title": "Mara-Mara Trench"
}
