{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Moi Gweath.png\n| image         = \n| caption_map   = \n| name          = Mói Gweath\n| type          = \n| description   = \n| exits         = Grand Promenade\n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Ukaizo\n| plants        = \n| expected_level= 16\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = yes\n| can_camp      = no\n| zone_id       = zn_12_ukaizo\n| internalname  = AR_1203_Ukaizo_Finale\n| guid          = 7ce6ad52-e95c-4a27-b8b5-0450384bcd67\n| lsc           = \n| icon          = Ukaizo Map Machine.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nYou descend into the ancient winding streets of Ukaizo. Battered by storms for thousands of years, the ruins bear the marks of their role as the lone witnesses of the gods' great secret at the center of the city.\nThe houses and boulevards are pierced by great spears of luminous adra. There are no ashen bodies, no birds, no sign or sound of any life.\nBut with every step, the rhythmic pounding in the distance draws nearer. Soon, you can feel the vibration traveling up your spine.\n\nAs you approach the center of the city, the weathered architecture gives way to more luminous adra piercing the ruins, eventually overtaking them entirely.\nCresting the top of a fallen tower, you finally get a clear view of Eothas. He stands, legs astride, next to a great stone monument ringed with eleven cavernous alcoves. All but three hold a gargantuan skeleton, bones scrubbed clean by the city's storms.\n\nAn immense Engwithan machine floats above the monument, suspended by invisible energy emanating from a well of light beneath it. Great brass rings spin around a core of metal and adra at the machine's center.\nPeriodically, Eothas' massive arms swing back. The movement alone is enough to draw great gusts of wind toward him. When they come down on the machine, the impacts are accompanied by eruptions of electricity, fire, and smoke. The hundreds of luminous adra pillars across Ukaizo sympathetically dim in a rippling wave that spreads out from the machine.\n\nThe only safe route to the god is a steep ascent along a monstrous pillar of luminous adra. Intertwined with fragments of Ukaizo's ruins that it has carried through the centuries, the pillar bends in a long arc, towering above the machine. The pillar levels out near Eothas' head, a silent observer to the destruction of the machine it has grown beside over thousands of years.\nYou weave your way along a treacherous rain-slicked path up the pillar's skyward side. As you arrive at the top, you catch Eothas' attention. Fist pulled back, he pauses to observe you. With the same gentleness he showed at Ashen Maw, he lowers his arm and turns toward you.\n\n==Points of interest==\n* The confrontation with Eothas is much like you'd expect a confrontation with a god to go down - based in words. Trying to fight him only ensures your timely death and destruction. What you say, however, determines the [[Pillars of Eternity II: Deadfire endings|endings]] - and what shall happen to the world.",
  "title": "Mói Gweath"
}
