{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Neketaka Island.png\n| caption_map   = \n| name          = \n| type          = Island\n| description   = \n| exits         = \n| main_location = Pillars of Eternity II: Deadfire world map{{!}}World map\n| sub_locations = Neketaka;Pāhowane\n| merchant      = \n| internalname  = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|landmass]] in {{poe2}}.\n\n==Background==\nThe largest of the subtropical islands in the Deadfire Archipelago, Neketaka Island is home to the eponymous [[Neketaka]], the single largest Huana settlement in the archipelago and the longest continuously-inhabited area of the culture. The bulk of its denizens are concentrated in the mountain city, which occupies its slopes all the way to the top.\n\nTo the west of Neketaka, rolling verdant plains stretch towards the mountains. Spiked plants with bright flowers punctuate the emerald green tall grass. The occasional tree dots the landscape, broad foliage casting shade like a parasol.\n\n==Locations==\n* [[File:Icon Neketaka.png|50px|left]] '''[[Neketaka]]''': The capital of the Archipelago and home to all the major factions vying for control of its natural resources.\n;Minor\n* [[File:Icon Huana Shrine.png|50px|left]] '''[[Teo Ramunga]]''': A small Huana shrine to the northwest. Locals frequently make a pilgrimage here to pray to Ondra, and to clean and maintain the shrine.<br clear=\"left\" />\n* [[file:Icon Camp.png|50px|left]] '''[[Nomu the Marauder]]''': A combat encounter with a rogue warband. You can wipe them out for [[Chameleon's Touch]].<br clear=\"left\" />\n* [[file:Icon Burial Mound.png|50px|left]] '''Weba o Tangaloa''': A burial site where the Huana cremate their dead. A ritual mound for burying dead rangas is also located here.<br clear=\"left\" />\n* [[file:Icon Forest Bright.png|50px|left]] '''[[Maukotu's Canopy]]''': A ruined camp deep in the jungle with two corpses. Lurkers have destroyed the camp, and have killed it's occupants.<br clear=\"left\" />\n* [[file:Icon Cliffs.png|50px|left]] '''[[Raoa o Hāra]]''': In the plains northwest of Neketaka, a group of Xaurips battle grubs for sport. You can get a [[Ivory Wurm Figurine (Deadfire)|Ivory Wurm Figurine]] here. <br clear=\"left\" />\n* [[file:Icon Mine.png|50px|left]] '''[[Pāhowane]]''': A large, derelict temple to Ngati, overrun by Xaurips.<br clear=\"left\" />",
  "slug": "neketakaIsland",
  "title": "Neketaka Island"
}
