{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Old City Overlook.png\n| caption_map   = Old City Overlook\n| image         = PE2 Old City Ruins.png\n| caption       = Old City Ruins\n| image2        = PE2 Old City.png\n| caption2      = Old City\n| name          = Old City\n| type          = District\n| description   = \n| main_location = Neketaka\n| sub_locations =\n| exits         = The Gullet;Undercroft\n| merchant      = \n| innkeeper     = \n| inhabitants   = Botaro;Degnos;Lone Survivor\n| monsters      = <!-- Beasts -->Cave grub;Giant cave grub;<!-- Spirits -->Shadow (Deadfire){{!}}Shadow;Phantom (Deadfire){{!}}Phantom;Wraith (Deadfire);Greater earth blight (Deadfire){{!}}Greater earth blight{{!}}Wraith;<!-- Vessels-->Gul (Deadfire){{!}}Gul;Dargul (Deadfire){{!}}Dargul;Rotghast;Rotghast ravager;Pestilent rotghast;<!-- Wilder-->Skuldrak (Deadfire){{!}}Skuldrak;Skuldrak screecher (Deadfire){{!}}Skuldrak screecher;\n| plants        = \n| expected_level= 6\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_06_slums_district\n| internalname  = AR_0610_Slums_Old_01 (Overlook)<br/>AR_0611_Slums_Old_02 (Ruins)<br/>AR_0612_Slums_Old_03\n| guid          = 5b3dd829-a21d-4158-a9af-5d2a1e564b34<br/>bd87900e-a73e-4e98-8814-7ba94f63f1a0<br/>61c1e971-f3eb-4be6-93e8-060ca001b158\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nBeneath [[the Gullet]] lies a vast cavern littered with the remains of an ancient city. Referred to simply as the 'Old City' by the denizens of Neketaka, this sunken metropolis is notable for two reasons - the Old City's architecture is markedly different in style, form, and apparent use from the architecture of modern Neketaka, and there is no readily available explanation for the Old City's destruction that has not already been considered and discounted by those inclined to study it. Moreover, the Huana's tastes show a clear preference for designs that mimic the rhythm and shapes of the natural world. The Old City shows none of these things. Indeed, what remains was constructed primarily of stone cut in austere blocks, and the buildings are arranged in a manner not dissimilar from those prevalent in the Engwithan ruins that dot the landscape.\n\nRegardless of its origins, the Old City is filled with undead vessels and other monstrosities. Although it's also filled to the brim with ancient history, the Huana mostly use it for executing criminals, rather than exploration.\n\n==Points of interest==\n;Overlook\n* The Old City Overlook can be accessed via the lift in [[The Gullet]], leading to the northeastern corner.<br />'''Warning - ''' The lift disappears after half a day, the only way back will be via the [[Undercroft]].\n* The Overlook connects to the Old City to the northwest, and the Old City Ruins to the southwest.\n** The entrance to the Old City proper is in the northwest. There's a nest of grubs and skuldraks roaming the area. Wipe them out, then find the stairs winding down the cliffside, leading to the southeastern-most point of the Old City proper. This interaction requires a Watcher-only check [[Perception]] 15, or a full party check [[Dexterity]] 12 to make your way down without injury. Note that the way up requires a different check ([[Athletics]] 3).\n** The entrance to the Old City Ruins is in the southwest, protected by grubs and their nests.\n* The northeastern area is crawling with guls and other undead, making for excellent target practice. This area is relatively light, but makes up for it with lots and lots of decaying corpses that give your party the [[Sickened (Deadfire)|Sickened]] affliction. [[Botaro]]'s body can be found roughly in the center this area.\n* There's a scripted interaction in the center, at the temple ruins. \n** With [[Perception]] 13, you can hear a muffled melody below the waters.\n** With [[Survival]] 6, you'll notice the suspicious bones clustered around the water's edge.\n** This scripted interaction requires a character with at least [[Constitution]] 16 to retrieve the [[Cornett of Depths]] unharmed - otherwise the character will become [[Status effects (Deadfire)#Fatigue|Fatigued]].\n** After obtaining the conch, you'll be attacked by a bunch of skeletons, though the loot they leave behind is good.\n* In the southeast is a passageway filled with Sigils of Nightmare and various specters. Fight through them to find the [[Lone Survivor]].\n\n;Ruins\n* This area can be accessed from either the [[Undercroft]] or the Old City Overlook, which will put you at the southwest and southeast corner respectively. The layout is the same otherwise. The southeastern half is dominated by cave grubs, which make trudging through a little annoying. The other sector, entered through the Chamber of the Waves from the Undercroft, is a little more open, holds the ruins of the city and the Temple of Ondra, and has a lot of rotghasts and darguls. Wonderful.\n* Entering via the Undercroft requires that you place either the [[Cornett of Waves]] or [[Cornett of Depths]] in the statues hand, opening the way to the rest of the ruins.\n* The exit to the Old City proper is in the northern part of the map. Be sure to check out the northeastern corner for the talking sword - [[Modwyr]] and other loot.\n\n;The Old City\n* The final part of the Old City stretching beneath Neketaka and as ruined as the rest. The derelict Temple of Ondra you're looking for is in the northwest, but the main entrance is blocked so you enter through the side entrance in the north. Be wary of the mad harvesters and corpse eaters on the way.\n** To access the temple proper, you'll need either the [[Cornett of Waves]] retrieved from [[Takano's estate]], or the [[Cornett of Depths]] from the Old City Overlook.\n** Inside is a [[Giant cave grub|massive grub]] that can be a potent challenge for a lower level party (anywhere below ten is suicide), but you can always sneak past it. If you killed the grub, find [[Cog of Cohh]] hidden nearby.\n** The mural for [[The Cornett's Call]] is at the back of the temple.\n** To access the hidden room, you need to use '''both''' conches on the mural at the side. You'll find [[Cadhu Scalth (Deadfire)‎|Cadhu Scalth]] (trapped and locked, difficulty 7), [[Wahai Pōraga]], and some [[Ruby (Deadfire)|Rubies]] inside.\n* Outside the ruins it's mostly a fight through various undead. Inspect the shore in the northeast corner to find [[Min's Fortune]], [[Corroded Bronze Horn Figurine]], and a [[hastily scrawled note]]. Reading the note reveals that [[Rotghast]]s will attack you if you take the [[Corroded Bronze Horn Figurine]], everything else is safe. After the fight, loot [[Mewnan's Broad Belt]] from the [[Reeking-Horror]].\n* The southeastern part is a hideout for a few blights, with minor loot spread throughout. There's an exit to the cliff steps right in the corner. You ascend the cliffs, but need [[Athletics]] 3 to cross them perfectly safely. This leads you directly to the Overlook near the skuldrak nest to the northwest.\n\n==Characters==\n* [[Botaro]], after starting [[All Aboard]] and witnessing him being lowered to the Old City, his soul can be interacted with to reveal his last moments.\n* [[Degnos]], after the quest [[Sealed Fate]], if you reveal Degnos' betrayal to [[Avetta]] he can be found dead in the Overlook, just southwest of the temple ruins map marker.\n* [[Lone Survivor]], hiding from monsters in a passage immediately south of the lift. You can lead him out of the ruins (see the character page for more info).\n\n==Enemies==\n;Overlook\n* Beasts\n** [[Cave grub]] (x2)\n** [[Cave grubling]] (x3)\n* Spirits\n** [[Shadow (Deadfire)|Shadow]] (x2)\n** [[Phantom (Deadfire)|Phantom]]\n** [[Wraith (Deadfire)|Wraith]]\n* Vessels\n** [[Gul (Deadfire)|Gul]] (x2)\n** [[Dargul (Deadfire)|Dargul]]\n* Wilder\n** [[Skuldrak (Deadfire)|Skuldrak]]\n** [[Skuldrak screecher (Deadfire)|Skuldrak screecher]]\n\n;Ruins\n* Beasts\n** [[Cave grub]] (x2)\n** [[Cave grubling]] (x1)\n** [[Cave bat (Deadfire)|Cave bat]] (x3)\n* Spirits\n** [[Greater earth blight (Deadfire)|Greater earth blight]]\n* Vessels\n** [[Gul (Deadfire)|Gul]]\n** [[Pestilent rotghast]] (x2)\n** [[Rotghast]]\n* Wilder\n** [[Skuldrak (Deadfire)|Skuldrak]] (x2)\n** [[Skuldrak screecher (Deadfire)|Skuldrak screecher]]\n\n==Loot==\n;Ruins\n* [[Modwyr]]: In the northeastern part, inside the hideout.\n* In an urn in the northeastern hideout, a drug at random.\n* In a hidden rubble pile in the northwest-most corner of the map, a potion at random.\n;Old City\n* [[Wahai Pōraga]] and [[Cadhu Scalth (Deadfire)|Cadhu Scalth]]: Inside the secret chamber.\n* [[Min's Fortune]] and [[Mewnan's Broad Belt]]: Overlooking the northern pond, on the skeleton.\n* [[Cog of Cohh]]: Hidden in a rubble pile in the Old Temple of Ondra ([[Giant cave grub]] lair).\n\n==Gallery==\n<tabber>\nInteraction 1=\n'''Being lowered into the Old City:'''\n<gallery mode=nolines>\n 06 SI Old City Lift 02.png\n 06 SI Old City Lift Down.png\n</gallery>\n|-|\nInteraction 2=\n'''Traversing the cliffside:'''\n<gallery mode=nolines>\n 06 SI Old City Cliff 01.png\n 06 SI Old City Cliff Stairs Broken.png\n 06 SI Old City Cliff 02 Easy01.png\n 06 SI Old City Cliff 02 Easy02.png\n 06 SI Old City Cliff 02 Hard.png\n 06 SI Old City Cliff 02 Hard02.png\n</gallery>\n|-|\nInteraction 3=\n'''Tunnel between Ruins and Overlook:'''\n<gallery mode=nolines>\n 06 SI Old City Tunnel Down.png\n 06 SI Old City Tunnel Up.png\n</gallery>\n|-|\n</tabber>",
  "slug": "oldCity",
  "title": "Old City"
}
