{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Ondras Spire.png\n| image         = PE2 Ondras Spire Post-Storm.png\n| caption_map   = \n| name          = Ondra's Spire\n| type          = \n| description   = \n| exits         = Grand Promenade\n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Ukaizo\n| plants        = \n| expected_level= 16\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = yes\n| can_camp      = yes\n| zone_id       = zn_12_ukaizo\n| internalname  = AR_1202_Ukaizo_Machine\n| guid          = e4bd7c78-401b-473b-8438-884f783ec1d8\n| lsc           = \n| icon          = Ukaizo Map Tower.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nThough the device atop the tower spins in wild, blurring revolutions, the air around it is still and calm. You stand in the eye of the storm which has cordoned off Ondra's Mortar from the rest of Eora for thousands of years. An accumulation of very ancient soul energy is anchored to this point, commanding your attention.\nYou see an antiquated control panel, its levers engaged in positions of activation. The control panel has weathered the millennia better than the rest of the city. A layer of dust covers its elegant glass tubes and engraved copper levers, which appear both intact and fully functional. \n\n==Points of interest==\n* This is where you shut off the great storms of Ondra's Mortar. If you brought Tekehu along and have discussed the topic of Ngati's covenant with him, he will have a special interaction by giving you a glimpse into the past, when the covenant was first made.\n\n{{quote|Dūmu the Eldest, Tapua the Wise, and Tokima the Recaller. Step forward and be recognized.\" A feminine voice echoes from across millennia. \"You are the stewards of my covenant. For so long as your people guard the isles, the adra, and themselves, then a measure of my power is theirs to command...\"}}\n* Disable the machine and end the storms, opening the way down to Eothas and the Wheel. Before you can confront him, however, you will have to return to the Grand Promenade and face off against representatives from the strongest rival faction (see [[The Coming Storm]]).",
  "title": "Ondra's Spire"
}
