{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Outcast Respite.png\n| caption_map   = \n| name          = Outcast's Respite\n| type          = Wilderness\n| description   = \n| exits         = \n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = Bipara;Tama Watua\n| main_location = Rikuhu's Maw\n| plants        = \n| expected_level= 18\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_26_uncharted_islands\n| internalname  = AR_2612_Witch_Cave\n| guid          = 27334a2b-fa4d-43d2-bb84-08cb54716b72\n| lsc           = \n| icon          = Icon Mountain 1 Cave Left.png\n}}\n'''{{Pagename nd}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\n{{Description|Deep in the bog you find a cave entrance obscured by vines. The bog's characteristic rot wafts from the cave, but so, too, does a strangely alchemical smell.\n\nAs you brush aside the vines and step inside the cave, you hear the faint sound of laughter coming from further in.}}\nThis remote cave is used as shelter by one [[Bipara]], a bog witch.\n\n==Points of interest==\n* A small location, with an entrance corridor and the main hut occupied by the witches. You can drink from the purple pond for a temporary boon (Alchemic Wits/Guile/Brawn). Bipara drops the [[Cauldron Shard]].\n* As you enter, a bunch of Bog oozes will emerge. It's best to hang back until they appear, and then fight them around the entrance so you don't draw the attention of the other enemies.\n* Examining the purple pool (named the Disgard Pool on the map), you surmise that is is made up of several distinct liquids. Drinking from the pool will give you one of three [[#Alchemic pool buffs/debuffs|boons]], but also has the chance of giving you an injury. You are able to drink as many times as you please.\n** Getting all 3 is risky as the pool can also give you Major Injuries which can lead to the player character dying.\n** Getting the same bonus or affliction twice will usually replace the previous instance, instead of doubling up. There is a chance of it giving a major injury, instead.\n** Be cautious saving while under any effects from the pool, as at the moment this can lead to some rather unfortunate side effects and loss of gear.\n* Careful about starting combat in the witches hideout, as the door and the wooden walkway to it is a choke point, making it difficult to get party members through (although you can use this to your advantage). Luring the enemies out towards the entrance is probably a better idea.\n* [[Tama Watua]] is locked in the back. You can free him with the [[Witches' Key]], dropped by [[Bipara]]. After being freed, he takes up residence. \n** Finding the [[Encoded notes]] before freeing [[Tama Watua]] allows you to and ask for a reward and get the [[Deciphered notes]] (or you can decipher them yourself). It allows to brew in the purple cauldron a potion (depending on the ingredients you have) giving you a permanent +1 to one attribute of your choice. See [[Deciphered notes]] for more information.\n\n== Alchemic pool buffs/debuffs ==\nThe following is a list of possible bonuses and injuries that can be given to you at random by drinking from the pool in this area. These effects last until the next rest.\n{| class=\"wikitable\"\n| width=\"60%\" | Dialogue\n| Bonus\n| Effects\n|-\n| {{Description|A strange warmth suffuses your limbs. You suddenly feel like you could knock out a dragon with a single punch.}}\n| [[Status effects (Deadfire)#Misc bonuses|Alchemic Brawn]]\n| +2 to [[Might]] and [[Constitution]]\n|-\n| {{Description|A crackle of electricity runs down your spine. You suddenly feel like you could best a panther in a race through the jungle.}}\n| [[Status effects (Deadfire)#Misc bonuses|Alchemic Guile]]\n| +2 to [[Dexterity]] and [[Perception]]\n|-\n| {{Description|You're briefly blinded by a bright flash of light. You're suddenly certain you could calculate the movement of the stars without so much as an abacus to aid you.}}\n| [[Status effects (Deadfire)#Misc bonuses|Alchemic Wits]]\n| +2 to [[Intellect]] and [[Resolve]]\n|-\n| {{Description|Your stomach heaves, and you immediately throw up.}}\n| -\n| No effect\n|-\n| {{Description|Your tongue freezes and your teeth chatter. The liquid sits in your stomach like a block of ice.}}\n| [[Status effects (Deadfire)#Injury|Frostbite]]\n| -3 [[Fortitude]], -3 Freeze Armor Rating\n|-\n| {{Description|Static electricity stands your hair on end. A painful current crackles down your spine.}}\n| [[Status effects (Deadfire)#Injury|System Shock]]\n| -2 [[Perception]], -3 Shock Armor Rating\n|-\n| {{Description|The liquid flares with heat on your tongue and burns your throat going down.}}\n| [[Status effects (Deadfire)#Injury|Serious Burn]]\n| -2 [[Dexterity]], -3 Burn Armor Rating\n|}\n\n==Characters==\n* [[Bipara]]\n* [[Tama Watua]], locked in the cage. \n\n==Loot==\n* [[Cauldron Shard]], dropped by [[Bipara]].\n* [[Bipara's Grimoire]], also dropped by [[Bipara]], needed for [[The Lost Grimoires]].\n* [[Encoded notes]], on the table.\n\n==Enemies==\n;Vessel\n* [[Bog ooze]] (x2)\n* [[Lesser bog ooze]] (x3)\n;Beasts\n* [[Bog bat (Deadfire)|Bog bat]] (x2)\n;Kith\n* [[Bog Witch]] (x3)\n;Sigils\n* [[Sigil of Pain]]\n\n==Gallery==\n<gallery mode=\"nolines\">\n RE si uncharted 12 witch cave entrance.png\n</gallery>",
  "title": "Outcast's Respite"
}
