{
  "raw": "{{Infobox location poe2\n| game          = lax3\n| map           = LAX3 Quarantined Section.png\n| caption_map   = \n| name          = Quarantined Section\n| type          = Temple\n| description   = \n| exits         = The Restricted Section;The Central Stacks\n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = The Black Isles\n| plants        = \n| expected_level= 18\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = ZN_LAX03_03_College\n| internalname  = AR_LAX03_0303_Archive_02\n| guid          = 1c113785-1b08-407c-9bf8-27820cbfb295\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{lax3}}.\n\n==Background==\nA section of the grand library devoted to [[Wael]] and maintained by the [[Hand Occult]], currently experiencing a slight problem related to an infestation of dank spores.\n\n==Points of interest==\n* The section is relatively straightforward. The eastern wing contains a chamber with Maura's tentacles reminding you that you're hot on their trail, with a number of artifacts recovered from historical locations across [[Eora]], including a rifle from the Evon Dewr bridge and materials from Durgan's Battery. It also contains a trapped chest with an unique wand (which also spawns two enchanted suits of armor) and a special armor standing near the corpse of the mage. The armor bears an Amulet of Animation that can be identified with Arcana 15/Wizard class/Trickster subclass and then effaced with Arcana 20, which allows for breaking the enchantment and collecting the [[Crimson Panoply]] and matching [[Crimson Plate Helm]] without fighting the armor first.\n* The northeastern chamber contains infested librarians and more spores. \n* The pattern continues throughout the rest of the area, except for the northwestern chamber, with a [[giant luminous spore]] that's apparently the fruit of the first Llengrath's research. The exit to the central area of the library is to the southeast, but requires finding a key first. The key is dropped by the giant spore.\n* A special area is accessed through the exit to the west, which leads to an isolated chamber in the [[Restricted Section]], with [[Notnok]].\n\n==Loot==\n* [[The Weyc's Wand]]: Trapped chest in the northeastern chamber.\n* [[Crimson Panoply]] and matching [[Crimson Plate Helm]]: On the statue in the eastern hall.\n*[[Amanita|Curious Sporeling]]: By the giant spore.\n* [[Maura's Infested Grimoire]], spore-encrusted key: Dropped by the giant spore.\n*[[Kraken's Eye]]: Looted from the world globe on the southwest room. Requires a perception check.\n\n;Quest items\n* [[The Annals of Llengrath, Volume II of V]]: Northeastern chamber, with the many spores and librarians.\n* [[The Annals of Llengrath, Volume III of V]]: Southwestern chamber, with the many spores and librarians.\n* [[The Annals of Llengrath, Volume IV of V]]: Northeastern chamber, opposite the one with the giant luminescent spore.\n*[[The Annals of Llengrath, Volume V of V]]: Northwestern chamber, behind the giant spore.",
  "slug": "quarantinedSection",
  "title": "Quarantined Section"
}
