{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Raoa o Hara.png\n| image         = PE2 Raoa o Hara Plains.png\n| caption_map   = \n| name          = Raoa o H훮ra\n| type          = Scripted interaction\n| description   = \n| exits         = \n| sub_locations = Plains\n| merchant      = \n| innkeeper     = \n| inhabitants   = Xaurip plaguestriker;Xaurip grubmaster;Xaurip wildgard;Xaurip high priest (Deadfire){{!}}Xaurip high priest\n| main_location = Neketaka Island\n| plants        = \n| internalname  = \n| lsc           = \n| icon          = Icon Cliffs.png\n}}\n'''{{Pagename nd}}''' is a scripted interaction on the northwestern coast of [[Neketaka Island]]. It is located at the coordinates 16째 56' S, 45째 6' E.\n\n== Background ==\n{{Description|To the west of Neketaka, rolling verdant plains stretch towards the mountains. Spiked plants with bright flowers punctuate the emerald green tall grass. The occasional tree dots the landscape, broad foliage casting shade like a parasol.}}\n\n== Interaction ==\nAt the top of a hill, you see a group of reptilian [[Xaurips]] gathered in the valley below. Using a [[Spyglass]], you can see what they're up to from a distance. You can either approach openly, or sneak closer with a Stealth 8 check on all members of the party (failing this check will cause them to spot you). You see that the group of 10 or so, led by a Xaurip shaman, are pitting grubs against each other for sport, poking at them and egging them on with their long sticks.\n* If you sneak up to the Xaurips, you can have a few more options:\n** Approach openly.\n** Ambush and attack. This puts you in sneak at the edge of the staging area, out of combat. \n** '''Charm Beast''' ability (requires Druid, note that the Watershaper sub-class e.g. [[Tekehu]] can't learn this ability). <sup>''Needs testing''</sup>\n** '''Stealth 10''' - Sneak past the area, ending the interaction\n* Approaching the creatures openly, or being spotted by them, you will have the following options:\n** '''Diplomacy 13''' - Reassure the creatures that you mean no harm.\n** '''Slight of Hand 9''' - Perform a coin trick to gain the interest of the creatures.\n** '''Ranger + Diplomacy 10''' - Ask the Xaurip's if your companion can join in on their game:\n*** Go easy on the grubs, the fight will go on and your spiritual connection to your companion will cause [[Status effects (Deadfire)#System Shock|System Shock]] (-2 Perception, -3 Shock Armor Rating).\n*** Attacking the grub aggressively will end the fight quickly, with no negative effects.\n** Failing any of the above checks will eliminate that option and give you another chance. If you run out of options, you'll be forced to either attack or leave.\n** '''Intimidate 13''' - Brandish your weapons and yell at the Xaurips, sending them scattering. This will net you the gear they discard in panic: [[Ivory Wurm Figurine (Deadfire)|Ivory Wurm Figurine]], [[Superb Xaurip Staff]], [[Medium Shield (Round) (Deadfire)|Medium Shield (Round)]], [[Razorgill Dust]] and [[Rune Powder]]. If you fail, this will start combat. Since you snuck up to them, you start combat on the left side of the area\n** '''Athletics 11''' - Flee, only available if you are initially spotted instead of approaching them. The check is done on all members of the party, though a Ranger's companion seems to cause this check to always fail. \n** Leave, ending the interaction. This is only available if you openly approach the group.\n* After you indulge the Xaurips, the shaman will step forward, pointing towards the horizon and then pointing to the pouch hanging from its waist. With Insight 10, you can tell that they're offering you something to go away. The shaman will take a small dragon figurine (an [[Ivory Wurm Figurine (Deadfire)|Ivory Wurm Figurine]]) from it's pouch, setting it before you and ending the interaction.\n* If you attack the Xaurips (which you can do at any time) - you'll be put in combat in the [[plains]] staging area. Here you'll fight the enemies below.\n\n==Enemies==\n;Wilder\n* [[Xaurip plaguestriker]] (x2)\n* [[Xaurip grubmaster]] (x2) hilariously also their grub companions\n* [[Xaurip wildgard]]\n* [[Xaurip high priest (Deadfire)|Xaurip high priest]]\n;Beasts\n* [[Cave grub|Grub companion]] (x2). A named cave grub with slightly boosted stats (59 Deflection, 66 Fortitude, 71 Reflex, 54 Will)\n\n== Gallery ==\n'''Scripted interaction graphics:'''\n<gallery mode=nolines>\n RE si plains.png\n Bestiary_xauripA.png\n</gallery>",
  "slug": "raoaOHara",
  "title": "Raoa o H훮ra"
}
