{
  "raw": "{{Infobox location poe2\n| game          = lax3\n| map           = LAX3 Restricted Section.png\n| caption_map   = \n| name          = \n| type          = Temple\n| description   = \n| exits         = The Quarantined Section;The Central Stacks\n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = The Black Isles\n| plants        = \n| expected_level= 18\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = ZN_LAX03_03_College\n| internalname  = AR_LAX03_0302_Archive_01\n| guid          = da3fc754-de2c-4094-9bd9-ce1c8ee9ad1d\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{lax3}}.\n\n==Background==\nPerched at the top of the temple dedicated to [[Wael]], the [[The Oratory of Wael|Oratory]].\n\nYou're not supposed to be here.\n\n==Points of interest==\nThe western section contains Notnok's cave.\n* This section is accessible through the western exit of the Quarantined Section and contains [[Notnok]], another jumped-up imp. There's no way around it, only through it.\n\nTo open the door leading to the northern staircase to the Central Stacks, collect the four volumes of The History of Eora, and place them on the pedestals, from left to right, in this order:\n* [[The History of Eora, Volume VII: The Three Body Agreement]]\n** ''\"The two took land and soldiers from the one, and they both gave everything in return.\"''\n* [[The History of Eora, Volume X: The Man Who Would Be Skaen]]\n** ''\"A hero of the people fell and rose a servant of the crown.\"''\n* [[The History of Eora, Volume IX: The Birth of Engwith]]\n** ''\"They looked upon the world as it was and were unsatisfied, so they remade it as they thought it should be.\"''\n* [[The History of Eora, Volume V: The Great Orlan Empire]]\n** ''\"They built an empire founded on compassion and were crushed for their audacity.\"''\n\nThen activate the device in the middle.\n* There's a Librarian standing just in front of the activation device. You can try drawing him away from it by tossing [[Sparkcrackers]] at the edge of his perception radius. If you're spottet, he'll sound the alarm, summon four extra enemies (one for each lectern) and attack.\n* A high stealth level is needed in order to get this entire thing done without attacking or being attacked by the Librarians.\n\n==Loot==\n\n* [[Warden Contract]]: The furthest room to the southeast. Second bookshelf up and to the right of the door. Needed for a peaceful interaction with Sissak in the [[Spun Terrace]].\n* [[Recipe - Invigorating Nightmares]]: Give to [[Drowsy Puke]] in the [[Temple of Revelation]] to unlock a new rest option at his \"inn\".\n\nNotnok's lair\n* [[Burden]]: On the shelves behind Notnok.\n* [[The Alchemy of Imp Spray]]: Stack of books to the left of Notnok.",
  "slug": "restrictedSection",
  "title": "Restricted Section"
}
