{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 School of Fish.png\n| image         = \n| caption_map   = \n| name          = School of Fish\n| type          = Scripted interaction\n| description   = \n| exits         = \n| sub_locations = \n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Rikuhu's Maw\n| plants        = \n| internalname  = \n| lsc           = \n| icon          = Icon Reef.png\n}}\n'''{{Pagename nd}}''' is a scripted interaction in {{poe2}}. It is located in [[Rikuhu's Maw]], due north of [[Crookspur Island]].\n\n== Background ==\n{{Description|The waters of the Deadfire are as flat and translucent as a sheet of stained glass, and a steady wind guides The Defiant along. The scent of a well-spiced stew rises from belowdecks.\n\nIrrena and Oswald are perched on the gunwale, legs and fishing poles dangling over the water.}}\n\n== Interaction ==\n* Suddenly one of your crew spots a large dark shape under the water, moving rapidly towards the ship.\n* With Survival 8, try to identify it. You recognize it as a barbed ravager, a gargantuan shark known for ramming ships - and sinking them. With [[Serafen]] this check only requires Survival 6. With [[Tekēhu]], this check only requires Survival 4. Both provide some unique dialogue. Failing the check, you will be unable to identify it, though there is no benefit to doing so.\n** You can cast defensive wards on the ship with a Veil or Protection keyword ability ([[Xoti]], [[Fassina]] has these by default). This unfortunately doesn't do anything, and will fail the check.\n** Ready the cannons to fire. Requires 2 Ammunition and a Cannoneer 8 check to hit the creature. Lose 2 Ammunition.\n** Otherwise you can command your crew to steer away, and flee. This requires a Deckhand 10 check (crew checks are the summed ranks of the crew in that slot).\n** If you fail, the beast rams the ship and one of your crew is thrown into the mast and giving them an injury. If you succeed, the encounter is over.\n* The next check will always succeed if you pick the same choice, otherwise if you pick a different choice it will always fail (with the exception of the Explosives check).\n** Bring the ship about to fire the cannons. Requires 2 Ammunition. The cannons fire at the creature, and after a moment a mangled carcass surfaces.\n** Using an Explosives 9 check (and with any explosive in your inventory), you can throw a grenade at the creature. Succeeding, the beast is blown to smithereens, bits of brain and muscle rain down upon the deck.\n** If you identified the creature, and in the previous check failed to fire the cannons you can choose to sacrifice a crew member as bait and flee (Cruel). This results in -15 Morale, but always succeeds.\n** Using a Wind-keyword ability ([[Tekehu]]), fill the sails with summoned wind to escape. This always succeeds.\n** Keep on course. The ship picks up speed and the beast falls behind. This ends the encounter.\n** Failing any of the above checks, a crew member is thrown into the water. You then can repeat the above checks, or save the man overboard (otherwise they are killed). These checks always succeed.\n* Once the encounter is over, you gain 360 experience and 2-4 sailor experience (depending on failures).\n** If you killed the beast with a grenade you gain 10 Morale\n** If you killed the beast with the cannons you gain 7 Morale.\n** If you attempted to fire the cannons, and then fled you gain 2 Morale.\n** If you fled in all checks, you gain no Morale.\n\n==Behind the scenes==\n* The game files show an alternate possibility of actually being sunk by the beast, although there seems to be no way to actually fail the interaction (might be possible if you have no ammo). These may be available in other encounters, or in other difficulties.\n\n{| class=\"wikitable\" style=\"margin-left:20px\"\n|-\n|{{Description|A sound like thunder rends the air, and the deck comes apart beneath your feet. For an impossibly long moment the world spins around you, and then you plunge into the water.\n\nYou hang in the water, stunned, pieces of lumber and steel sinking around you. You reorient yourself towards the surface and swim.}}\n|-\n|{{Description|The ravager appears before you like an apparition. It is impossibly fast - its mouth impossibly large and filled with an impossible number of teeth.\n\nThey're the last things you ever see.}}\n|}\n== Gallery ==\n;Scripted interaction graphics\n<gallery mode=nolines>\n RE si open water.png\n RE si sea monster shadow.png\n RE si sea monster.png\n RE si cannons firing.png\n PX2 04 SI iceFloe 03.png\n Re si victory.png\n</gallery>",
  "title": "School of Fish"
}
