{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Splintered Reef.png\n| caption_map   = \n| name          = Splintered Reef\n| type          = Town\n| description   = \n| exits         = \n| sub_locations = Boathouse;The Pickled Eel;Sea-Lashed Crypt;Glowing Outcrop\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| monsters      = Dargul marksman;Dargul swashbuckler;Grave hound\n| main_location =\n| plants        = \n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_20_ship_graveyard\n| internalname  = CITY_Splintered_Reef<br/>AR_2001_Ship_Graveyard_Exterior\n| guid          = 98b527a1-5e52-4add-af82-acce89381dd3\n| lsc           = \n| icon          = Icon Splintered Reef.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nThis odd, long-abandoned region on the fringes of the Archipelago is shrouded in a thick fog and inhabited by the undead. Two hundred years ago, this keep was claimed by the Darcozzi Paladin, [[Lucia Rivan]]. Ever since it has been turned into a warped version of a peaceful town, where the undead \"live\" under the illusion they are living, breathing people, lashed to the will of one [[Menzzago]].\n\n==Locations==\nNote that you will encounter darguls and a fampyr when getting off the boat, so tread with caution. This places you in the [[Crossroads]] staging area.\n;[[Boathouse]]: This is an ancient ship converted into a workroom.\n;[[The Pickled Eel]]:A derelict inn.\n;[[Sea-Lashed Crypt]]: The bowels of the island and the power it holds.\n;[[Glowing Outcrop]]: The seat of power for [[Menzzago]].\n\n==Interaction==\nAfter first leaving the boat upon travelling to any location, you will encounter darguls and a fampyr after a brief scripted interaction...\n\n{{Description|A series of flimsy docks connects scattered stretches of dry land. On all sides you are flanked by the hulks of splintered, wrecked ships.\n\nA thick fog sits upon the water, obscuring the path in all directions. The only sounds you hear are the lapping of water, and your own footsteps upon the narrow, rotting planks.}}\n\n* In order to avoid combat, every party member needs to pass a [[Stealth]] 12 check, then hide within the shadow of a wrecked ship, then continue to hide.\n* Otherwise If you whistle for the dog, stand your ground, or seize the advantage and attack - you will be placed in combat (with no advantage). Two stumbling and swaying figures emerge from the fog. A third robed figure, a fampyr wizard, casts a controlling incantation on the darguls, and you enter combat with: [[Dargul swashbuckler]] x2, a [[Dargul Marksman]], and a [[Fampyr (Deadfire)|Fampyr]].\n\nAfter this encounter, you may travel freely within the reef.\n\n==Gallery==\n;Scripted interaction graphics\n<gallery mode=nolines>\n 20_si_town_exploration_01.png\n 20 si town exploration 02.png\n 20 si town exploration 03.png\n 20 si town exploration 04.png\n</gallery>",
  "slug": "splinteredReef",
  "title": "Splintered Reef"
}
