{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2_Storm_Fort_Deadlight_NE.png\n| image         = \n| caption_map   = \n| name          = Storm\n| type          = \n| description   = \n| exits         = \n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Deadfire Archipelago\n| plants        = \n| internalname  = \n| lsc           = \n| icon          = \n}}\n''{{PAGENAME}}'' is a scripted interaction in {{poe2}}.\n\n== Background ==\n{{Description|The clouds sweep over you, dominating the sky and hemming the sea beneath a roiling gray dome. The rain drums against the deck.\n\nSweat beads on Beodul's brow as the storm looms ever closer.\n\"We can't outrun this one, captain!\"}}\n\nA large storm threatens to sink the Defiant, but quick thinking and persistence will see the Watcher through it.\n\n== Locations ==\nThere are multiple storms located throughout the Deadfire, which can appear at a number locations. The storms move around in a seemingly random path.\n* In the area northeast of [[Fort Deadlight]] and due west of [[Karatapu Channel]].\n* Moves around the area south-southeast of [[Wakara Reef]], and east of [[Maje Island]]. \n\n== Interaction ==\n'''Preparations'''\n* Venturing into the large storm clouds, your crew looks to you for orders. Preparing for the oncoming storm will reduce the likelyhood of things going wrong.\n* Assigning crew duties:\n** With a Cook of at least proficiency 1, you can tell them to divvy out the last of the cooked meals to gain +3 Morale, and then to put out any open fires. This will prevent fires from occurring in the hold.\n** If you have a [[Rope and Grappling Hook (Deadfire)|Rope and Grappling Hook]] in your stash, and a helmsman with proficiency 1 or higher, you can tell them to strap themselves to the wheel as to prevent them from going overboard.\n* Assigning deckhand duties requires deckhands with a combined proficiency of 2 or more. You can either command them to secure the cargo belowdecks preventing the risk of injury, reef the sails to improve the ships handling, or bring the rainwater barrels up from the hold for x20 Water.\n* Your companions can provide some help here too, Serafen can lend a hand for +5 Morale, and Xoti can recite a prayer for +10 Morale.\n'''The storm'''\n* Continuing into the storm, a number of events will occur seemingly at random, some depending on your actions from the previous events, and influenced by the choices you made in perparation. Throughout the interaction, 1 to 4 of the following events will occur:\n** '''Rain continues''': Occurs at random.\n*** [[#Nautical Terms|Lie ahull]]. Moves your crew belowdecks with no checks and no loss in morale.\n*** Hold course. Requires Helmsman Check 2 to succeed, but results in -3 Morale either way due to the crew being forced to endure the storm. This will have a chance of weakening the hull and masts.\n*** [[#Nautical Terms|Heave to]] (essentially parking the ship) and move your crew belowdecks. Only available with Helmsman proficiency 1 or higher. This always ends the interaction.\n*** [[#Nautical Terms|Fly bare poles]]. Moves your crew belowdecks and command your captain to continue. Requires Helmsman Check 2 to succeed, resulting in +2 Sailor Experience for your Helmsman or Deckhand. If failed, and your cargo is not secure, your crew will be thrown around with the cargo, resulting in an injury to one of your crew members - but gaining 2 Sailor Experience for one of your crew (for some reason). Otherwise if your cargo is secure, this results in +2 Sailor Experience for your Helmsman. Whether the cargo is secured or not seems to be completely random unless you specifically did so during preparation. If the check fails, this has a chance of weakening the hull, leading it to begin taking on water.\n** '''Crew seasick''': Occurs at random, but seems to occur less often after passing checks.\n*** Open the gun ports so the crew can see the horizon (-4 Morale).\n*** Ask your surgeon to make use of whatever medicine you have on board (-5 Medicine).\n*** If your crew are belowdecks, you can also get them up on deck to give them some fresh air (-2 Morale).\n*** Employ psychic abilities with a Cipher in your party (always succeeds).\n** '''Fire belowdecks''': Occurs at random, but seems to occur less often after passing checks. Does not occur if you instructed your cook to put out fires in the hold.\n*** Pump the bilges and use the water to fight the fire. Requires Deckhand Check 6 to succeed, otherwise a crew member is killed and you lose 6 Morale. Failing to pump the bilges has a high chance of repeating this event - a very easy way to get 2 or 3 crew members killed in one fell swoop.\n*** Cast a Water keyword ability to put out the fire (Tekehu has 3 possible abilities by default). Always succeeds.\n** '''Defiant taking on water''': Occurs if the hull has been weakened.\n*** Pump the water out. Always succeeds, but results in -5 Morale.\n*** Lose weight and throw things overboard. Results in -5 Morale, -3 Repair, -5 Medicine and -6 Ammunition.\n*** Fix the leaks (requires Deckhand Check 5). If failed, causes injury to deckhand and -2 Morale for working with injury. This is not always available, depending on the severity of the failure of the helmsman movement.\n*** Freeze Ability: If you or a companion has a Freeze keyword ability ([[Tekehu]] has two such abilities by default), you can freeze the encroaching water. Always succeeds.\n** '''Mast breaks''': This will only occur if you have put the masts at risk by attempting to hold course. Leaving the pieces of mast hanging will risk it damaging the hull in the wind and waves.\n*** Leave the loose mast hanging against the portside to avoid getting caught in the rigging. This will weaken your hull in the context of the interaction.\n*** Cut the mast free before it damages the hull. Not always available, and requires Deckhand 4 Check to succeed. If you fail, there is a chance that one of your crew members will be knocked overboard\n** '''Man overboard''': A wave strikes the ship across the deck, sweeping a crew member - usually the helmsman - overboard. Very rare, and seems to occur after failing to cut the mast free in the above event. Does not occur if you instructed your helmsman to strap themselves to the wheel earlier. ''Needs more testing''.\n*** Using a [[Rope and Grappling Hook (Deadfire)|Rope and Grappling Hook]], instruct a crew member to mount a rescue. Requires Deckhand Check 3 to succeed, resulting in +2 Sailor Experience for the deckhand performing the rescue, and +1 for the assisting deckhand. If failed...\n*** Pray to Ondra for the lost crew member. Results in -4 Morale and the loss of one of your crew.\n*** With Xoti in your party, you can ask her to guide the crew member's soul to Gaun.\n*** If you or a companion has the ability [[Maura's Writhing Tentacles]]...\n* Passing through the storm, your crew will breathe a heavy, haggered sigh of relief - gaining you +3 Morale, some experience depending on your actions, and 1 Sailor Experience for each of your crew.\n\n== Gallery ==\n<gallery>\n 00 si prologue ship in storm.png | <center>Scripted interaction graphic</center>\n</gallery>\n\n== Glossary ==\n'''While instructing the deckhands...'''\n\n:'''\"Secure the Cargo\"''': The crew lash down everything that can be tied to something. This decreases the likelihood of crew injury and hull damage in rough seas.\n\n:'''\"Reef the Sails\"''': The crew strike some sails, while folding others to reduce surface area, This dramatically improves a ships handling in heavy winds.\n\n:'''\"Bring the Rain Barrels Up\"''': The crew lash barrels to the rails to catch drinkable rain water. They can only tend to these barrels when they're on deck, however, and must seal them before going below.\n\n'''While instructing your helmsman...'''\n\n:'''\"Lying Ahull\"''': The most passive tactic against a storm. The crew strikes the sails and goes belowdecks before securing all of the hatches. Protects the crew and the mast, but leaves the ship drifting at the mercy of the sea. The ship may roll in particularly rough seas. <ref>[https://en.wikipedia.org/wiki/Lying_ahull Lying ahull]</ref>\n\n:'''\"Holding Course\"''': The crew remains at stations and attempt to sail as normal.\n\n:'''\"Heaving-To\"''': The sails and rudder are lashed into place, set to balance one another out, and the crew goes belowdecks. This protects the crew and helps the ship make good time, but puts the mast and sails at risk.<ref>[https://en.wikipedia.org/wiki/Heaving_to Heaving to]</ref>\n\n:'''\"Flying Bare Poles\"''': The sails are struck and the crew goes belowdecks, save for the helmsman, who remains at the wheel. The ship relies on the wind against the masts for propulsion, often achieving great speed. This protects the crew and sails, but can be dangerous to the hull and risks the helmsman.\n\n{{-}}\n{{references}}",
  "title": "Storm"
}
