{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Temple of Tangaloa.png\n| caption_map   = \n| name          = Temple of Tangaloa Ruins\n| type          = Ruin\n| description   = \n| exits         = \n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = Captain Angfor;Giordu Red-Handed\n| main_location = Tangaloa Island\n| plants        = \n| expected_level= 7\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_26_uncharted_islands\n| internalname  = AR_2602_Cannibal_Ruin\n| guid          = 28442cb9-dc70-4f2f-9839-9d89e974e707\n| lsc           = \n| icon          = Icon Ruins Stairs.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nAn ancient temple complex, the ruins were recently taken over by a group of cannibals. Their new interior styling includes drawings in blood that  depict violent images of decapitations, dismemberings, hangings, and sundry other terrors. This is the doing of the crew of ''Imposter's Lament'', an Aedyran ship, which crashed on its shores. With no relief coming, the crew turned to cannibalism, consuming each other and spawning a terrifying cult of maneaters shielded by spirits of their dead.\n\n==Points of interest==\n* This area is filled with blood splattered all over the walls and floor - as well as naval supplies. The first two rooms contain minor loot, with more located in the room beyond. Check the makeshift table for [[Angfor's journal]] and step behind the divider to meet [[Captain Angfor]] and his merry band of crazed sailors with an ogre for support. After wiping them out, scavenge the area.  Free the dwarf [[Giordu Red-Handed]] tied to the stake to get a free sailor for your ship.  He's... well, he's a cook.  Not sure I want to know what's in his recipe book.\n\n==Characters==\n* [[Captain Angfor]], captain of the ''Impostor's Lament'', which sank in the waters around the temple. The captain and his crew were forced to eat each other to survive.\n* [[Giordu Red-Handed]], recruitable crew member.",
  "slug": "templeOfTangaloaRuins",
  "title": "Temple of Tangaloa ruins"
}
