{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Teo Ramunga.png\n| image         = PE2 Teo Ramunga Plains.png\n| caption_map   = \n| name          = Teo Ramunga\n| type          = Scripted interaction\n| description   = \n| exits         = \n| sub_locations = Plains\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Neketaka Island\n| plants        = \n| internalname  = \n| lsc           = \n| icon          = Icon Huana Shrine.png\n}}\n'''{{Pagename nd}}''' is a scripted interaction on [[Neketaka Island]], heading north inland of [[Neketaka]]. It is located at the coordinates 16° 4' S, 45° 50' E.\n\n== Background ==\nTeo Ramunga is a small Huana shrine in the plains to the north-west of the Neketake Island. It contains a weathered statue of Ngati, the Huana portrayal of Ondra. Locals, including those from [[Neketaka]], often make a pilgrimage to the shrine.\n\n== Interaction ==\n* Off the path you'll notice a small shrine containing a weathered statue. You can use Survival 7 to look around, though this just confirms that no one is around.\n\n* With Religion 8, you can approach and identify the statue as that of [[Ngati]], the Huana rendition of [[Ondra]]. It is the shape of a nude woman with the head of a monstrous fish. Along the base of the shrine is an inscription: ''\"The surf smooths stones, but also crushes them into sand.\"'' If the check fails, you admire the craftsmanship - but cannot determine who the shrine is dedicated to.\n\n* At this point, you can either choose to kneel and pray at the shrine (given you passed the above check), or desecrate the shrine. Depending on the time of day, you may be able to do either without issues.\n* Kneeling before the shrine to pray, a group of Huana's approach and begin to yell at you. You can tell that they often have to drive away bandits and looters from the shrine, so they're naturally very apprehensive towards foreigners lurking about. With at least Good reputation with the Huana, one of them recognizes you as someone who is trustworthy - though the others don't all agree.\n** You can use Diplomacy 8, telling them that you've only come to pay respects to goddess for the safe travels of your ship.\n** Ask a companion to speak to them, requiring a unique check for each individual companion. Choosing yourself will give the same options. See [[#Companion dialogue|below]] for a list of responses for each companion, and their checks required.\n** If your companion fails to convince the crowd, you will get a second chance between these options. However, you'll only be able to use the companion you selected.\n** Sing an Ondrite Dirge. Hidden Religion 8 check.\n** Threaten them to introduce them to their gods (self-check Intimidate 8). The group backs off, allowing you to use the shrine. If this fails, they will attack you.\n* Desecrating the shrine will give you nothing, and you'll be unable to return to it. If you have Xoti, you'll lose 3 reputation with her (Anti-Religion). During the day, the crowd will approach and will immediately attack you. This puts you in the staging area [[Plains]].\n* Successfully making peace with the Huana will allow you to pray, as they join you. This will give you the buff [[Status effects (Deadfire)#Ngati's Blessing|Ngati's Blessing]] (+2 Constitution).\n*As a [[cipher]], you can also elect to meditate rather than pray at the shrine after identifying it. This does not appear to accomplish anything, however.\n* This is one of the few scripted interaction locations you can return to. Returning here after successfully passing the interaction will allow you to pray as many times as you wish.\n\n===Companion dialogue===\n{| class=\"wikitable sortable\"\n! Companion\n! Quote\n! style=\"width: 13%\"|Check\n|-\n|[[Aloth]]\n|{{Description|Aloth raises his hands in a placating gesture. \"Come now, do the gods not desire the worship of all? We mean no harm. All we ask is that you allow us to pay our respects here\"}}\n|Diplomacy 7\n|-\n|[[Eder]]\n|{{Description|\"They got different names, but our gods are the same as yours. And I don't know a one that says we got any choice in who gets to pray to 'em.\"}}\n|Religion 5\n|-\n|[[Maia]]\n|{{Description|\"If the captain wants to pray to your dumb fish, the captain gets to pray to your dumb fish.\" Maia advances a step. Ishiza follow suit and spreads his wings open.}}\n|Intimidate 8\n|-\n|[[Pallegina]]\n|{{Description|\"Go! Clear out!\" Pallegina takes a brisk step forward. \"There's no point in getting hurt over your stupid shrine.\"}}\n|Intimidate 8\n|-\n|[[Serafen]]\n|{{Description|\"Look, my good lads and lasses. We of the sea be having more respect for Ngati than just about anyone, aye? We don't be wanting her nursing an anger on us any more than you do. So what do you say?\" Serafen steps towards the Huana, arms open wide and summons up his most gracious grin.}}\n|Bluff 5\n|-\n|[[Tekēhu]]\n|{{Description|\"Do the words of Ngati's chosen still carry value in these troubled times? I say the captain means no harm.\" Tekēhu folds his arms and scrutinizes each of the Huana in turn.}}\n|Always succeeds\n|-\n|[[Xoti]]\n|{{Description|\"My ancestors may have not been from the Deadfire, but I was raised on these islands same as you. And I'll not be kept from worshipping the gods.\"}}\n|Religion 7\n|-\n|[[Fassina]]\n|rowspan=\"3\"|{{Description|[Sidekick] nods and looks to the Huana. \"Look, friends. We're only looking to say a few prayers, and then we'll leave. No harm done. Promise.\"}}\n|rowspan=\"3\"|Diplomacy 7\n|-\n|[[Konstanten]]\n|-\n|[[Mirke]]\n|-\n|[[Rekke]]\n|\n|\n|-\n|[[Vatnir]]\n|\n|\n|-\n|[[Ydwin]]\n|{{Description|\"We seek only to pay the gods their rightful homage. If you are the true believers you comport yourselves as, then you would not wish to prevent Ngati from receiving her prayers.\" Ydwin raises a pale eyebrow at you.}}\n|Diplomacy 7\n|}\n\n== Gallery ==\n<gallery mode=\"nolines\">\nFile:RE si shrine plains.png| Scripted interaction graphic\nFile:PE2 Plains Teo Ramunga.png| Staging area\n</gallery>",
  "title": "Teo Ramunga"
}
