{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Black Isles.png\n| caption_map   = \n| name          = {{PAGENAME}}\n| type          = Archipelago\n| description   = \n| exits         = Pillars of Eternity II: Deadfire world map{{!}}World map\n| main_location =\n| sub_locations = Hall of the Unseen;The Halls Obscured\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| plants        = \n| expected_level= \n| grants_xp     = yes\n| override_xp   = 900\n| is_crit_path  = \n| can_camp      = \n| zone_id       = \n| internalname  = \n| guid          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|landmass]] in {{poe2}}.\n\n==Background==\nA mass of foreboding, volcanic islands in the south-east of the archipelago, the Black Isles are the home of the Black Isle Bastards, a group of nobles of questionable provenance who swore off their houses and inheritances, instead banding together under the leadership of Captain [[Fyrgist]] of [[The Heaving Harlot]]. Mooring point is located at 31° 41'S, 57° 10'E.\n\n==Locations==\n* [[File:Icon Ruins Stairs.png|50px|left]] '''[[Hall of the Unseen]]''': A foreboding dungeon in the active volcano in the heart of the Isles.<br clear=\"left\"/>\n;Points of interest \n* [[File:Icon Camp.png|50px|left]] '''[[Shadowed Vale]]''': This is a large camp amidst the volcanic, ashen lands. You can approach the camp openly and negotiate to join them with Diplomacy 7. You can ask them about the unusual geography with Metaphysics 7, Religion 9/Priest class, or Survival 5. If you try to inspect the hooded man, you may find a hairless head with no eyes, or you may find that it is has killed one of your crew members and taken their form. Either way, you will suddenly appear back on the world map, with the camp nowhere to be seen.<br clear=\"left\"/>\n\n==Trivia==\n* The small icon to the right of the Hall of the Unseen (with a purple light emanating from it) only appears if {{tfs}} is installed.\n*Occasionally, purple tendrils will appear on the island which can be looted for an assortment of items such as Kith Meat, Aged Shark Meat and Reptilian Eye",
  "slug": "theBlackIsles",
  "title": "The Black Isles"
}
