{
  "raw": "{{Infobox location poe2\n| game          = lax3\n| map           = LAX3 The Enclosures.png\n| caption_map   = \n| name          = The Enclosures\n| type          = Dungeon\n| description   = \n| exits         = Hall of Reconfiguration;Spun Terrace\n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Temple of Revelation\n| plants        = \n| expected_level= 18\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_lax03_02_menagerie\n| internalname  = AR_LAX03_0203_Collections_Upper\n| guid          = 8527760d-2761-4b88-abc1-d9d290685faa\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{lax3}}.\n\n==Background==\nThe Collections, much like the Archives wing, is dedicated to redacting entities from [[Eora]] and storing them for later re-use. This particular sections seems to hold creatures and other beings of exceptional power.\n==Points of interest==\n* The enclosures are exactly what it says on the tin. The exit to the Temple of Revelation is to the southeast, while the three wings surround the center opening. At first entrance, music will emanate from the center, and a dwarf will attempt to unsuccessfully jump into it, only to be apparently mind-wiped. Note that vithrack crawl all over the area, so care is advised. Check the table in the center for a [[Handwritten Note]].\n* The northeastern wing contains enclosures for bog oozes and similar bog creatures in the south. This is the Arboreal Habitat P-1210, analyzing menpwgra, bog oozes and bog lurkers after ecosystem displacement. After killing, you can find a lot of rare plants and  a [[Carefully Scribed Note]] on the dead librarian. \n* There is also a hidden wall there, which leads to a scripted interaction. With Mechanics 17, you can glean that the wall can be taken down with a prybar or a hammer and chisel. Otherwise, you will need Athletics ... or an implosion charge to open it up. This will reveal a concealed chamber with what appears to be a dragon creature with a disturbingly humanoid skull, a [[Magma Dragon Gizzard Stone]] and a [[Sea Dragon Scale]] on it. Fassina will remark that the creature was ''made'' here, rather than came from the world above.\n* The northwestern section contains the spore, wizard and sailor enclosures. The spore enclosure is a funguous habitat, where subject P-0706 was subjected to fermentation studies using arcane redirection - and apparently became ''too'' successful. The sailors are K-0908, a maritime habitat with an assorted Vailian crew assembled for a mutiny project. Finally, the last enclosure contains subject K-1121, [[Bekarna]], imprisoned for prohibited revelation and hazardous inquiry.\n* The southwestern wing is divided into two halves. The western one is a glacial habitat with subjects W-0209, testing climate endurance of rimebound Rathun and snowbears. It contains the aforementioned unique Rathun and [[Auntie]], a huge, unique snow bear. The box inside the enclosure contains [[Whispers from the Depths]]. \n* The eastern parts contain two habitats, one for [[dreambeasts]] (B-8682, assertive delusion project, exhausted  subject proposal) and one for [[xaurips]] (W-0541, cognition study in obedience). The former contains [[Slender Jim]], a dreambeast pet, while the latter contains nothing at all - in fact, the xaurips will become passive and frightened when your party enters.\n* To penetrate deeper into the Collections, you need to access the vithrack lift in the northern part of the area. The key to the lift is on the table to the southwest, between the wizard/sailor and the polar enclosures. \n*Scattered throughout the area are mouths of the organ, getting near them will give your characters -50 will penalty. Destroying them will instantly remove this debuff, but also make the prisoners hostile\n\n==Characters==\n* [[Bekarna]]\n==Loot==\n* [[Whispers from the Depths]]: Ring, in the enclosure with Auntie.\n* [[Slender Jim]]: In the dreambeast enclosure.\n\n[[Category:Pillars of Eternity II: Deadfire dungeons]]",
  "title": "The Enclosures"
}
