{
  "raw": "{{Infobox location poe2\n| game          = lax1\n| map           = lax1 Tiebe o Waiapu.png\n| caption_map   = \n| name          = Tiebe o Waiapu\n| type          = Wilderness\n| description   = \n| exits         = \n| main_location = Kazuwari\n| sub_locations = \n| merchant      = \n| expected_level= -1\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = LAX01/LAX01_WorldMapEncounters\n| internalname  = RM_LAX01_WorldMap_Jungle_FootHills_01\n| guid          = e7e70830-347b-4b23-8047-4085235020dd\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{lax1}}.\n\n==Background==\nA long, arid expanse stretches before you, bordered on either side by dry, jagged cliffs. A handful of sharp-leafed trees and scraggly shrubs share the landscape, bu the miles are otherwise desolate. This is the domain of the Survivor.\n\n==Points of interest==\n* Scripted interaction, as usual. The expanse requires you to press forward, straight into the burning realm. You eventually come to a passageway where only two kith can move abreast, blocked by precarious stones (revealed with Perception 11). You can make it through by using Might, Athletics, or a magical ability (Cipher with The Thunder Rolled..., Wizard with any variant of elemental destruction, Druid with Boil their Flesh - yum - or Priest with Iconic Projection, Pillar of Holy Fire or Storm of Holy Fire). \n* Beyond the rocks you are surprised by cliffs tumbling down the rockside and can either attempt to defend the affected teammate with Athletics or let them survive it with Constitution 13. Another test will test Athletics when you almost fall off the path. Then comes a rope bridge you can circumvent by sparing 8 hours (see a pattern yet?). The next test requires a boulder to be rolled to the side and the test is automatic, then causes an injury to the character.\n* Next up is a wall of brambles that requires a fire ability to take care off and will cause an injury to the caster. Finally, as you push on, one of your companions will develop a rash and sores, requiring either Alchemy ... or magic to cure (magic is ineffective). \n* The interaction is designed to strip away your party members and will only end once they're all busy. Finally, you come to a cliff wall and will require either Constitution 14 or Athletics and Rope + Grappling Hook to scale safely. Finally, you find the artifact the Survivor is looking for, held by the largest boar you've ever seen. Interacting with the pig can be done in a variety of ways, including attacking, Intimidation 7, Diplomacy 5, or feeding it something from your pack. Feeding it requires Alchemy 6 or Survival 8 on the Watcher to poison the boar with huona mahe, or you can give it orlan's cradle by default (or pork if you're feeling Cruel). \n** If fed, the boar will be revealed to be surprisingly gentle and you can attempt to pet it, take the necklace, or kill it, abusing its trust. The boar will accept pets, which allows you to snatch the Crimson Crystal from its tusk. As usual, after collecting it you will receive an audience with a strange aumaua soul.\n\n==Characters==\n* [[Erūke]]: The aumaua soul.\n\n==Loot==\n* [[Crimson Crystal]]: Carried by the boar.",
  "slug": "tiebeOWaiapu",
  "title": "Tiebe o Waiapu"
}
