{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Ukaizo.png\n| caption_map   = \n| name          = \n| type          = City\n| description   = \n| exits         = \n| sub_locations = Ukaizo Harbor;Grand Promenade;Ondra's Spire;Mói Gweath\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location =\n| plants        = \n| internalname  = CITY_Ukaizo\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n== Background==\nUkaizo is a mythical island rumored to be somewhere in the Deadfire Archipelago. Some legends regard Ukaizo as the wellspring of Huana culture. Others tell of riches beyond measure. All agree that Ukaizo vanished after cataclysmic storms and volcanic eruptions blotted out the horizon, but it remains to be seen if these tales possess an echo of merit or simply romanticize an ancient fantasy.\n\nUnlike many myths, Ukaizo exists - but is as lost as the tales make it out to be.  It may be hard to picture, but this city was once full of life, bringing together the Huana and kith from many other cultures. Great hanging trees shadowed these boulevards. Gardens sprawled across the open rooftops. Each spring, a festival procession would wind its way from the hillside into this valley. The celebrants would pass through a steep walk among the stalls of the foreign merchants, flowers falling upon them from all sides. All people of all nations, together in a celebration of new life. Such was the power and beauty of lost Ukaizo.\n\nIt was also the heart of the [[Huana]] empire and the Deadfire, from which they protected the archipelago together with three dragons, as part of their covenant with Ngati, the god they worshiped. Decades passed in harmony, if not centuries, until the [[Engwith]]ans arrived, a people full of wisdom, ingenuity, and terrifying ambition. \nThe Engwithans were quick to endear themselves to their Huana hosts, and together these two great societies constructed machines across the archipelago with the power to sort, sequester, and destroy souls. Many thousands of Huana willingly sacrificed themselves to aid in the machines' creation, for they believed the Engwithans' project to be a noble one.\n\nThe Engwithan machine built at Ukaizo was the most precious of them all. Knowing they would need a guardian to protect it, the Engwithans entreated the three dragon servants of Ngati with an offer - the Engwithans would grant the dragons eternal life at the cost of their eternal service. The dragons thus allowed the Engwithans to tether their souls to a single beast, the Guardian of Ukaizo, and rejoiced in their new, undying form. But the Engwithans outmaneuvered the Huana and the dragons: They sacrificed their society on the altar of apotheosis, leaving their hosts dumbfounded. To protect the secret of the Engwithans' ascent to artificial godhood, the god who would become [[Ondra]]  called down a great storm upon the city of Ukaizo and the surrounding islands, which culminated in the crashing of Ionni Brathr - the moon - against the surface of [[Eora]]. Ukaizo was hidden from prying eyes for the next twenty centuries, as  the Guardian of Ukaizo became the keeper of a dead city, bound in body to forever protect a place that no longer existed.\n==Locations==\n;[[Ukaizo Harbor]]: The once grand port of Ukaizo, now destroyed. Here you confront the Guardian of Ukaizo.\n;[[Grand Promenade]]: Once the most beautiful avenue in the city, overlooking its splendor and majesty. Now it's just a dead stretch of wet stone and bronze.\n;[[Ondra's Spire]]: The heart of the storms that plague Ondra's Mortar and the site of the first covenant with Ngati.\n;[[Mói Gweath]]: The place where the reincarnation machine lies.\n\n==Characters==\n* [[Eothas]]\n* [[Guardian of Ukaizo]]",
  "title": "Ukaizo"
}
