{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Vilarios Rest.png\n| caption_map   = Beach\n| image         = PE2 Vilario Sea Cave.png\n| caption       = Sea Cave\n| name          = Vilario's Rest\n| type          = Wilderness\n| description   = \n| exits         = \n| sub_locations = #Sea cave{{!}}Sea Cave\n| merchant      = \n| innkeeper     = \n| inhabitants   = Edér;Irrena;Chitupec;Beodul;Vela\n| main_location = Maje Island\n| plants        = [[Spire Sponge]]; [[Blood Moss]]; [[Pox Cap]]; [[Cave Coral]] \n| expected_level= 1\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_09_port_maje\n| internalname  = AR_0908_Port_Maje_Beach<br/>AR_0909_Sea_Cave\n| guid          = c977673a-94d9-4669-88ba-3a44b67cf939<br/>7c713d7d-c19b-4f0a-bf77-4c26a1da4e70\n| lsc           = \n| icon          = Icon Vilario's Rest.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nThis sandy beach is the resting place of ''[[The Defiant]]'' after storms following in Eothas wake forced it to beach. You're not the first visitor, as this was also the staging area for a group of pirates - since killed by the construct they purchased and turned into undead. Sadly, their treasures have also gone the way of Rymrgand.\n\n==Points of interest==\n* You awake on the beach with [[Eder]] standing over you and shaking his head. This is the beginning of your Hunt for Eothas! However, your immediate concern is figuring out where to get your crew. First, salvage items from the surrounding corpses and barrels.\n* You can climb aboard the Defiant with a grappling hook or by using [[Athletics]]. [[Irrena]] is laying on the deck and helping her is a part of the Helping Hands quest. Otherwise, explore the beach, filled with young boars and other associated riff-raff. You can interact with wandering dead sailors, collecting souls as part of your charge as Berath's soul beacon.\n;Sea cave\n* This large cave is your first taste of dungeon crawling. It's populated with low level enemies. Points of interest include a small outpost in the southeastern corner (former occupants have turned into skeletons). The level 1 locked chest contains a [[Vailian Frock Coat]] and some money. The corpse nearby contains a [[Waterlogged Note]]. Heading up the northeastern passage will lead to a [[Rusted copper construct|Rusted Copper Construct]] mentioned by the pirates. After defeating him, clear out the adjacent rooms for a [[Ring of Minor Protection]].\n* [[Beodul]] is in the upper center, surrounded by traps. In the adjacent corridor is a trapped chest with a breastplate and some minor loot.\n* In the northwestern corner you have a small tunnel leading outside. In the scripted interaction you can swim through (sending someone with Athletics 1 through - like Eder - is a good idea). You emerge in an isolated area that allows you to exit back to the beach. The chest contains a good number of loot - and more importantly, a drowned pirate soul that gives you some background on what happened to the pirates - and reveals that this was part of [[Benweth]]'s crew. She will join you as another soul in tow for Berath.\n\n==Characters==\n* [[Edér]], fighter companion from {{poe1}}.\n* [[Irrena]], crew member. She is on the deck of the ship, having been injured.\n* [[Chitupec]], crew member. Will appear on the beach, assuming you saved him and not the crate during the Prologue. \n* [[Beodul]], crew member. He's found in the Sea Cave, surrounded by traps and in need of assistance.\n* [[Vela]], the Orlan child is present if the Watcher kept the baby during [[Sacrificial Bloodlines]] in [[Pillars of Eternity]].\n\n==Loot==\n* [[Ring of Minor Protection]]: In the cave, near the construct.\n* Caed Nua Crate: Located on the beach if the crate was saved over [[Chitupec]] during the [[Prologue]]. Contains [[Killer's Gloves]], [[Oil of Allure]], and [[Thief's Putty]].\n\n==Gallery==\n;Climbing up to the beached Defiant\n<gallery mode=nolines>\n 09 si Ship Prow EstablishingShot.png\n 09 si port maje grapple hook.png\n 09 si ship climb.png\n 09 si ship rope climb.png\n 09 si ship fall.png\n 09 si Ship Prow ClimbDown.png\n</gallery>",
  "title": "Vilario's Rest"
}
