{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Wapau Jungle Map.png\n| image         = PE2 Wapau Jungle.png\n| caption_map   = \n| name          = W훮pau Jungle\n| type          = Scripted interaction\n| description   = \n| exits         = Pillars of Eternity II: Deadfire world map{{!}}World map\n| sub_locations = Swamp\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Deadfire_Archipelago_unmarked_locations{{!}}Deadfire Archipelago\n| plants        = \n| internalname  = \n| lsc           = \n| icon          = Icon Forest Bright.png\n}}\n'''{{Pagename nd}}''' is a scripted interaction in {{poe2}}. It is located at the eastern edge of the map, near [[Subterranean temple]], which itself is north-east of [[Poko Kohara Ruins]]. Specifically, it can be found at the coordinates 20째 33' S, 65째 19' E.\n\n== Background ==\n{{Description|The fetid, sweltering jungle looms around and above you, the thick canopy capturing the heat. Sweat clings to your nostrils and drips from your chin. Nothing seems to move in all of the world save you.\n\nYour companions' complaints fell silent hours ago.\n\nSave for Serafen, who summons up a new creative objection every ten minutes or so.}}\n\n== Interaction ==\n* You and your party venture into the hot, humid jungle on the island. After hours of tireless walking, you stop at a stagnant waterway to refill your water skins when you hear movement in the wilds ahead of you.\n* A trio of kith emerge from the trees and greet you as the Watcher of Caed Nua. The central figure, a savannah folk explains that they have awaited your arrival, and have a proposition for you, given you step to the side - away from your party - to hear it.\n** You can move closer to listen (Shady). Moving closer to listen, the man lowers his voice:\n<div style=\"margin-left:20px\">\n{{Description|\"There exists a place, hidden among these wilds... an old place, watched by [[the Quiet Slave]]. For one willing to make a sacrifice...\"\n\n\"A true sacrifice,\" says the woman at his side as she nods towards your companions.\n\n\"...such devotion shall be rewarded by him in turn.\"}}\n</div>\n:* Offer a \"counter proposal\", and attack (Aggressive).\n:* Say you'll be fine right where you are. After a confirmation, this dismisses them and ends the interaction with no outcome.\n:* {{legacy|poe1}} Alternatively, if the Watcher is a [[Priest]] of Skaen, or if they distributed the souls to [[Woedica]] (in the quest [[Memories of the Ancients]] during the events of {{poe1}}) the kith will instead come to you with open arms and present you with the effigy as a \"gift for your loyalty. And for your resentment\". For any other, Skaen would have \"made demands\" (a sacrifice of the blood of a companion). Accepting the effigy doll ends the interaction.\n* At any time during the interaction with the kith you can choose to attack them instead of following along. This will place you in the [[Jungle]] staging area, versus the Skaenite cultists - an extremely easy fight at most levels. Once they're dead you can loot the [[Pathfinder's Boots]] from the Skaenite Priest.\n* If you accept the trio's proposal you'll have to choose one of your companions to accompany you.\n** With your companion in tow, a Survival 12 check will determine if you can follow their vague directions. Failing or succeeding will still get you to the destination, but the former will pass 5 hours and will give you and your companion [[Status effects (Deadfire)#Injuries|Fatigue]] (-5 [[Accuracy]], -10 All [[Defenses]], -15% Max Health).\n** The destination is a temple hidden in the depths of the wilds, heavy stones set against one another and the blank rock face of the mountain. The center of the temple is a stone altar grooved with ancient serrations and stained with long-dried blood.\n*** Sacrifice your companion (Cruel). You kill your companion, and in a rather gruesome manner reach into their chest and  \"pull from the body a doll, a figure of wooden sticks bound together, the eyes a pair of blackstones.\" This gives you the [[Effigy Doll]]. Returning to your party, they question what became of your chosen companion. Bluffing \"they didn't make it\" will result in -1 Reputation with [[Aloth]] (Shady), otherwise the other dialogue options have no adverse affects.\n*** Destroy the altar (Aggressive, Benevolent). You and your companion destroy the shrine, leaving it as a pile of broken rocks and rubble. This ends the interaction with no rewards.\n\n== Trivia ==\n* If you have no companions in your party, this location is unavailable and will disappear from the map.\n* When you have to choose which companion will accompany you, you can instead choose yourself - this will evoke a response from one of the kith, who admires your choice but asks you to choose again.\n* You cannot choose a Hired Adventurer to accompany you, the trio will simply refuse and ask you to try again.\n* This interaction bares resemblance to the [[Dyrford Ruins]] blood pool from {{poe1}}, in which you are able to sacrifice one of your party. However, unlike this, you do not get a unique permanent bonus.\n\n== Gallery ==\n;Scripted interaction graphics\n<gallery mode=nolines>\n RE si jungle.png\n GEN SI waterSkinFill.png\n RE si uncharted 12 witch cave kith swamp.png\n 00 SII skean shrine.png\n 03 si the duel sword slash.png\n</gallery>",
  "slug": "wapauJungle",
  "title": "W훮pau Jungle"
}
