{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = Against Aesthetics, or, An Examination of the Motivations of Storytellers, Poets and Other Con Artists\n| icon           = poe2 book_tome icon.png\n| description    = An excerpt from a hulking tome several inches thick penned by one Reygnfar Carnet, who warns his readers against the negative consequences of consuming fiction.\n\n\"If there exist lands beyond the churning tempest of Ondra's Mortar, none have lived to tell of them. Yet, rumors persist in sailor tales and merchant fables of a storm-lashed continent where dust and sand drift high as mountains and crawl across the land like a searing river. Horses are said to run wild there, ridden by a fire-haired people who stand ten, sometimes twenty feet high, and whose voices boom as loudly as calving glaciers across their great sand sea. The stories say they do not fight amongst themselves, but raise their voices only in greeting, so mollified are they by the careful attentions of the gods, who dote upon them above all others.\n\nWhat are we to make of such stories? They are nonsense, of course, tall tales spun to delight the simple minds of children and sailors alike. Indeed, tales such as this one and others of its ilk tell us more about ourselves than they do a mythical people on a mythical land halfway across the world. We dream of sand because we are awash in water, hemmed in on every side. We long for peaceful giants because we feel ourselves small and sow little more than discord between us. We say, wistfully, that they are beloved of the gods because we do not feel the loving touch of the gods upon our ''own'' heads, so we must then seek comfort in the knowledge that it is only because they love another of their children more that they ignore us.\"\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Book\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 320\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Beyond_Storm\n| location       = \n| guid           =68d08a9f-c618-4e91-8092-b7a29149dc6c\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "againstAestheticsOrAnExaminationOfTheMotivationsOfStorytellersPoetsAndOtherConArtists",
  "title": "Against Aesthetics, or, An Examination of the Motivations of Storytellers, Poets, and Other Con Artists"
}
