{
  "markdown": "'''Aloth Corfiser''' is an [elven](/woodElf/) [wizard](/wizard/) and one of the [companion](/companion/)s in ''[Pillars of Eternity](/pillarsOfEternity/)'' and {{poe2}}. Obsessive and dutiful,  Aloth can be found in [Gilded Vale](/gildedVale/) near the entrance to [the Black Hound Inn](/theBlackHoundInn/). If you sort out his little problem with the locals, he'll join up with you.  In the sequel, he's found at the [Engwithan dig site](/engwithanDigSite/), masquerading as Engferth, a young animancer.\n\n## Background\n\nAloth is a 62-year-old slender [Wood elf](/woodElf/) with pale skin and straight, dark brown hair. He is from the Cythwood, part of the mainland of the [Aedyr Empire](/aedyrEmpire/), and brought up in a servile family employed by Aedyran nobility.<ref name=\"strategyguide\">Pillars of Eternity Collector's Edition Guide, pg. 120</ref>\n\nAlthough surrounded by wealth and prosperity, young Aloth's home was not a particularly healthy one. His father worked hard as a steward to an erl, but it was his mother who supported their home through a [haemneg](/haemneg/) to another man. The haemneg is an Aedyran institution derived from the human-elf imperial concubinage, allowing for a married human and elf to formalize a relationship, ostensibly for the purposes of politics and administration. Hers was to a landed thayn that was a five day ride away from Cynthwood. The income was enough to support her family, but she was away from home most of the time. Aloth's father considered this to be shameful; not only was his wife the primary breadwinner of the household, but her absence led him to believe that she was involved in an affair with the thayn. The rage drove him into alcoholism and frequent outbursts directed at his wife, whenever she was around, and at Aloth in her absence.<ref name=\"twosided\">[Two-Sided](/twoSided/)</ref>\n\nAloth studied as an arcane knight at Bragganhyl academy.<ref name=\"ymirdialog\">[Ymir](/ymir/)</ref> He lost favor after trying to inform instructors about a student-run animancy experiment that would eventually kill a dozen students.<ref name=\"strategyguide\"></ref>\n\n## =Iselmyr\n\n=\nFive years into his training, his father's beatings came to a head and resulted in Aloth's Awakening. It occurred when his father learned that Aloth was struggling with magic missiles and flame shields. As he kicked his son, curled up in a fetal position on the floor of the kitchen, Aloth retreated into himself. The trauma caused Iselmyr to emerge, taking over his body and filling the parts of his soul he retreated from. Iselmyr lashed out, breaking the father's arm in three places. He never raised a hand against Aloth again.<ref name=\"twosided\"></ref>\n\nOn his mother's advice, fearing that he would become an outcast, Aloth hid Iselmyr and his awakening. In no small part due to the fact that Iselmyr was an uncouth provincial from a very long time ago (judging by her Hylspeak vernacular). She tended to surface in stressful situations and take control of his body.<ref name=\"twosided\"></ref> Worse yet, she acted without thinking, escalating even the most minute of encounters. As such, Aloth developed an almost pathological need for control in every aspect of his life. He dropped his guard in very few instances, as was the case when he avoided a romance with [Ymir](/ymir/), a fellow student from the academy that Iselmyr attempted to pursue.<ref name=\"ymirdialog\"></ref>\n\n## =Leaden Key\n\n=\nDuring his final year of training, one of Aloth's instructors introduced him to the [Leaden Key](/leadenKey/). He joined because it would provide postings far away from the Cythwood, Aloth's father, and his erl. Additionally, several of his colleagues had abandoned their studies to pursue [Animancy](/animancy/), which Aloth felt needed to be stopped. The Leaden Key seemed to offer solutions to these problems and Aloth \"sincerely believed they wanted to keep kith from the folly of their own foolish ambitions\".<ref name=\"postanimancytrial\">POE1 dialog after the animancy trials</ref>\n\nAloth's work in the Leaden Key required espionage. He arrived in the Dyrwood in 2822 AI to observe animancy and its spread in the region. His handler met with him every few months to receive his reports and issue new leads. His last assignment was to [Gilded Vale](/gildedVale/), to keep an eye on the events surrounding [Raedric VII](/raedricVii/). At that point he lost contact with his handler and the Leaden Key, whether due to reassignment, death, or sacrifice of his handler, he doesn't know. By the time he met the Watcher he was on his own for several months. He joined the Watcher seeking direction, correctly surmising that they were on the trail of the Leaden Key.<ref name=\"postanimancytrial\">POE1 dialog after the animancy trials</ref> \n\n## ={{poe1}}\n\n=\nAloth often voices his concerns over [Animancy](/animancy/). He is initially strictly opposed to its practice, viewing it as an affront to the gods.<ref name=\"strategyguide\">Pillars of Eternity Collector's Edition Guide, pg. 120</ref> But, he becomes conflicted during his travels with the Watcher.\n\nAloth doesn't initially disclose his ties to the [Leaden Key](/leadenKey/). However, the Watcher opens his eyes to their true nature and their activates related to [Waidwen's Legacy](/waidwensLegacy/). He reveals his relationship to the group after the [Animancy hearings](/animancyHearings/). At which point, the Watcher can decide to either forgive Aloth for his secrecy or banish him. This choice affects his ending. If the latter is chosen, Aloth's story unceremoniously ends; finding himself with nowhere he feels he belongs, he decides in his desperation to head to [Eir Glanfath](/eirGlanfath/), where he tracks down one of the ancient machines, ending his life by sacrificing his soul to it. Should he remain with the party, the Watcher's influence (see [Endings](/endings/)) on Aloth expresses itself in his ending slides.\n\nThe Watcher can choose to help Aloth come to terms with his awakening during his personal quest [Two-Sided](/twoSided/) and later influence his choice to either accept or suppress Iselmyr (see [Iselmyr Resolution](/iselmyrResolution/)).\n\n## =5 Year Interlude\n\n=\nThe choice he made at Sun-in-Shadow defined his life over half a decade. Aloth visited Aedyr for the first time in years, visiting either his father (if he favored authority) or his mother (if he favored autonomy) and comes to terms with their actions.\n\nIf Aloth did not suppress Iselmyr, they come to an agreement where she can partake in battle.<ref>Iselmyr says, ''\"Aye, he lets me in on the bashing, and I leave him the jawing.\"''</ref>\n\nAloth focused on his goals with the Leaden Key. His drive to help kith as strong as ever. However, after having followed someone else's lead for so long, the task proved to be more challenging than he thought. As was the case with a little village in Old Vailia, where influence from a past heretical cult had left the village with a practice of ritual bloodletting.\n\n* '''''If he decided to dismantle the Leaden Key''''', Aloth thought to end the ritual by assassinating the tyrannical priest who presided over it. So he arranged for the priest to have an 'accident'. The villagers took the death as an ill-omen and began bloodletting every single week, turning on neighbors for giving too little... villagers began to die.\n* '''''If he decided to lead the Leaden Key''''', Aloth thought to end the ritual by inserting a new ruler. He \"adjusted\" some of the deeds pertaining to the ownership of the land. However, the comtessa who inherited the land did nothing to stop the blood letting ritual. Even worse, she taxed the villagers to pay for a new plantation and conscripted half of them to defend it.\n\nHe decided to track down an ancient and remote Leaden Key sect in the [Deadfire Archipelago](/deadfireArchipelago/) so he could observe their workings and use that knowledge for his goals. For this purpose he created the persona of Engferth, a talented pupil with a tragic past, to ingratiate himself with the Vailian animancers at [Port Maje](/portMaje/). Since animancy is a subject of interest to the Leaden Key, he figured this would lead him to the sect.\n\n## ={{poe2}}\n\n=\nThe Watcher meets Aloth at the [Engwithan dig site](/engwithanDigSite/) outside Port Maje. Aloth may have earned a few new scars, but he's no worse for the wear. He asks the Watcher to help him find the ancient Leaden Key sect known only as [\"The Painted Masks\"](/thePaintedMasks/).\n\nAloth reveals he struggles with feeling responsible for the incident in Old Valia. After investigating the mysterious sect, the Watcher either convinces Aloth that he isn't responsible (allowing him to continue is work) or that he is responsible (causing him to drop his pursuits). (See [Deadfire Endings](/deadfireEndings/))\n\n## Interactions\n\n## ={{poe1}}\n\n=\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =[Two-Sided](/twoSided/)\n|quests_involved =\n|other           =\n|none            = \n}}\n\n## \n\nCompanion\n\n## \n\n* Aloth is the first companion you can recruit. However, if you don't recruit him before the [animancy hearings](/animancyHearings/) (thus starting Act 3) he will leave Gilded Vale and become unrecruitable.\n* He is first and foremost a powerful [wizard](/wizard/), making him one of your highest sources for damage. However, his focus on magical firepower has left him less than optimal for melee.\n* The Collector's Edition Guide describes him as \"obsessive, detail-ortientated, deferential, instructive, dutiful, imperturbed by violence.\"<ref name=\"strategyguide\">Pillars of Eternity Collector's Edition Guide, pg. 120</ref>\n\n## \n\nCompanion quest\n\n## \n\n* Aloth's companion quest is [Two-Sided](/twoSided/) which can be obtained by speaking to him after completing [Never Far from the Queen](/neverFarFromTheQueen/). Aloth will also open up about his involvement with the [Leaden Key](/leadenKey/) after the [Animancy hearings](/animancyHearings/).\n\n## \n\nIselmyr resolution\n\n## \n\nAlthough not a factor in Aloth's ending slides, the player can guide Aloth to either accept or suppress Iselmyr. If Iselmyr's favor is 1 or above, Aloth will accept her. If her favor is 0 or negative, Aloth will suppress her.\n\n* The first dialog that affects this choice happens after completing [Never Far from the Queen](/neverFarFromTheQueen/) when Aloth first speaks about Iselmyr.\n** \"She seems reckless.\" → -1 Favor\n** \"Sounds like you could take a few cues from her.\" → +1 Favor\n* The second dialog happens during [Two-Sided](/twoSided/) when speaking with [Bellasege](/bellasege/).\n** \"You can't let her make these decisions for you.\" → -1 Favor\n** \"I think she's trying to help you stand up for yourself.\" → +1 Favor\n* The final dialog happens just after speaking with [Sîdha and Rîhenwn](/sidhaAndRihenwn/) in [Twin Elms](/twinElms/). \n** \"I can't imagine having her in my head.\" → -1 Favor\n** \"She's not that bad\" → +1 Favor\n\n## \n\nEndings\n\n## \n\nAloth's endings change depending on which trait is higher, Autonomy or Authority. There are several conversations where the player can influence these traits:\n* During [Two-Sided](/twoSided/).\n* Speaking with Aloth after completing [Two-Sided](/twoSided/) will provide additional dialog about Iselmyr and his parents:\n** \"Not necessarily. Most people have more sense than that.\" → +1 Autonomy\n** \"That's true. People are too easily led.\" → +1 Authority\n** \"She shouldn't have abandoned you like that.\" → +1 Autonomy\n** \"I'm sure she was trying to take care of you in her own way.\" → +1 Authority\n** \"Nonsense. You accomplished that on your own, and you would have been fine without him pushing you.\" → +1 Autonomy\n** \"It's hard to see it at the time, but sometimes pressure is useful.\" → +1 Authority\n* Selecting \"As long as you don't forget who's in charge. I'm keeping a close eye on you from now on\" after the [Animancy hearings](/animancyHearings/) provides +1 Authority.\n* After speaking with [Sîdha and Rîhenwn](/sidhaAndRihenwn/) in [Twin Elms](/twinElms/):\n** \"Like it or not, she's part of you. And she could be a source of strength if you learn to work with her.\" → +1 Autonomy\n** \"Your whole life, you've been taking orders. If you can't assert your authority over her, you'll never have it anywhere else.\" → +1 Authority\n** \"That's how it's supposed to be. You search for answers elsewhere and find them in yourself.\" '''OR''' \"I've been with you the whole way. I still am.\" → +1 Autonomy\n** \"Most people need that kind of guidance. You don't.\" '''OR''' \"You haven't been on your own. I got you through Brackenbury, remember?\" → +1 Authority\n** \"I'm sure we'd find our way on our own.\" → +1 Autonomy\n** \"Let's just hope that's not the case.\" → +1 Authority\n* After speaking with [Iovara](/iovara/) in the final act:\n** \"Thaos is wrong. Most people are fundamentally decent. Knowing the truth can only make them better.\" → +1 Autonomy\n** \"It's an outrage! There's no excuse for misleading people like this.\" → +1 Autonomy\n** \"People need something to believe in...\" → +1 Authority\n\n## ={{poe2}}\n\n=\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =[The Painted Masks](/thePaintedMasks/)\n|quests_involved =\n|other           =\n|none            = \n}}\n\n## \n\nCompanion\n\n## \n\n* Aloth is found at the [Engwithan Digsite](/engwithanDigsite/), posing as Engferth among the animancers. He will rejoin you quite promptly, though before you embark on a dungeon crawl, you can listen to the glowing recommendation he received from Selona and the backstory he crafted for himself in order to ingratiate himself with the animancers.\n* If you do not recruit him at the digsite, he will be found in front of [Governor Clario's Estate](/governorClariosEstate/) in [Port Maje Harbor](/portMajeHarbor/).\n* If you do not recruit him at all, he will make his way to [Ori o Koīki](/oriOKoiki/), but will be killed by the Wahaki tribe.\n* He comes with the unique [Keybreaker Scepter](/keybreakerScepter/) or [Thaos' Headdress](/thaosHeaddress/) (depending on whether he rejected Thaos or took his place respectively) and his old [leather armor](/alothsLeatherArmorDeadfire/), which now has a blue Aedyr sash.\n\n'''Class'''\n*The class options available to Aloth are [wizard](/wizard/), [battlemage](/battlemage/) (wizard + [fighter](/fighter/)), or [spellblade](/spellblade/) (wizard + [rogue](/rogue/)).\n\n## \n\nReputation\n\n## \n\n* Aloth likes:\n** {{Topic|Autonomy}} '''Autonomy:''' Believes kith should have the freedom to determine their own futures and appreciates efforts that support this principle (if he decided to dismantle the [Leaden Key](/leadenKey/) in [Pillars of Eternity](/pillarsOfEternity/)).\n** {{Topic|Stewardship}} '''Stewardship:''' Believes in benevolent authoritarianism (mutually exclusive with Autonomy).\n** {{Topic|Dutiful}} '''Dutiful:''' Admires people who take responsibility and don't shirk the tasks presented to them.\n* Aloth dislikes: \n** {{Topic|Irresponsibility}} '''Irresponsibility:''' Finds it distasteful when others do not take their duties seriously or attempt to evade their rightful responsibilities.\n** {{Topic|Pride}} '''Pride:''' Is put off by people who proclaim their own merits in defiance of all decorum and decency.\n** {{Topic|Traditional}} '''Traditional:''' Is wary of traditionalism for its own sake and distrusts those who adhere rigidly to old habits and rituals.\n\n## \n\nRelationships\n\n## \n\n* [Xoti](/xoti/) and [Maia](/maia/)'s dutiful approaches results in a natural increased reputation for Aloth.\n* [Tekēhu](/tekehu/)'s carefree attitude and hubris greatly vex Aloth.\n* If Aloth became Grandmaster of the Leaden Key it causes some negative reputation with [Edér](/eder/).\n* The Watcher can romance Aloth if your reputation is 2 and you pass a dialogue check (give Aloth his space).\n\n## \n\nDeadfire endings\n\n## \n\nAloth's endings change depending if he feels responsible for the consequences of his actions or absolved. The endings are decided in one of two ways:\n* Choosing a specific dialog option at the end of [The Painted Masks](/thePaintedMasks/). This will outweigh his absolution or responsibility traits, unless you let Aloth decide for himself.\n* If you don't complete the quest, or don't decide for him, whichever trait is higher (given during [certain conversations](/thePaintedMasksAbsolved2FResponsibleDialogue/)) will dictate his ending.\n\n## Behind the scenes\n\n* Aloth was written by [Carrie Patel](/developers/).<ref>http://forums.obsidian.net/topic/74557-companions-who-wrote-what/#entry1622138</ref>\n* He is voiced by actor [http://en.wikipedia.org/wiki/Matthew_Mercer Matthew Mercer], who also voices [Edér](/ederTeylecg/).<ref>https://twitter.com/matthewmercer/status/581136312964489216</ref>\n* Aloth has the unique [background](/background/) \"Gentry\", which is not available to players. It provides him +2 [Lore](/lore/).\n* Before PoE 1.03, Aloth had the following Attributes: Mig: 12 Con: 10 Dex: 11 Per: 16 Int: 16 Res: 13.\n\n## Gallery\n\n<gallery>\nFile:Aloth.png|Early concept\nFile:Aloth-leather-armor.jpg|Aloth in his unique [Leather armor](/leatherArmor/).\nFile:Leather armor aloth icon.png|Icon of Aloth's unique [Leather armor](/leatherArmor/).\n</gallery>\n\n{{References}}\n\n{{Companions navbar PoE1}}\n{{Companions navbar PoE2}}\n[Category:Gilded Vale characters](/categoryGildedValeCharacters/)\n[Category:Engwithan dig site characters](/categoryEngwithanDigSiteCharacters/)",
  "raw": "{{Infobox npc\n|game         = poe1\n|game2        =poe2 \n|name       = Aloth Corfiser\n|image   = Aloth Composite.png\n|screenshot = \n|race       = Elf\n|subrace    = Wood\n|gender     = Male\n|class      = Wizard\n|faction    = Leaden Key\n|location   = [[Gilded Vale]]<hr/>[[Engwithan Digsite]]\n|attributes = Mig: 12 Con: 10 Dex: 15 Per: 12 Int: 16 Res: 13\n|skill = [[Arcana]] 3<br/>[[Explosives]] 2<hr/>[[Diplomacy]] 2<br/>[[History]] 2<br/>[[Insight]] 2<br/>[[Metaphysics]] 2\n|culture    = Aedyr Empire\n|background = Gentry\n|companion  = Permanent\n|quests     = [[Two-Sided]]<hr/>[[The Painted Masks]]\n|level      = 2\n|accuracy   = 35\n|head       = Hood\n|body       = Aloth's Leather Armor\n|weapon1    = Rod\n|neck       = \n|weapon2    = Rapier\n|weapon2_offhand = Stiletto\n|ability    = [[Arcane Veil]]<br/>[[Kalakoth's Sunless Grasp]]<br/>[[Fan of Flames]]<br/>[[Arkemyr's Dazzling Lights]]<br/>[[Minoletta's Minor Missiles]]\n}}\n'''Aloth Corfiser''' is an [[wood elf|elven]] [[wizard]] and one of the [[companion]]s in ''[[Pillars of Eternity]]'' and {{poe2}}. Obsessive and dutiful,  Aloth can be found in [[Gilded Vale]] near the entrance to [[the Black Hound Inn]]. If you sort out his little problem with the locals, he'll join up with you.  In the sequel, he's found at the [[Engwithan dig site]], masquerading as Engferth, a young animancer.\n\n==Background==\nAloth is a 62-year-old slender [[Wood elf]] with pale skin and straight, dark brown hair. He is from the Cythwood, part of the mainland of the [[Aedyr Empire]], and brought up in a servile family employed by Aedyran nobility.<ref name=\"strategyguide\">Pillars of Eternity Collector's Edition Guide, pg. 120</ref>\n\nAlthough surrounded by wealth and prosperity, young Aloth's home was not a particularly healthy one. His father worked hard as a steward to an erl, but it was his mother who supported their home through a [[haemneg]] to another man. The haemneg is an Aedyran institution derived from the human-elf imperial concubinage, allowing for a married human and elf to formalize a relationship, ostensibly for the purposes of politics and administration. Hers was to a landed thayn that was a five day ride away from Cynthwood. The income was enough to support her family, but she was away from home most of the time. Aloth's father considered this to be shameful; not only was his wife the primary breadwinner of the household, but her absence led him to believe that she was involved in an affair with the thayn. The rage drove him into alcoholism and frequent outbursts directed at his wife, whenever she was around, and at Aloth in her absence.<ref name=\"twosided\">[[Two-Sided]]</ref>\n\nAloth studied as an arcane knight at Bragganhyl academy.<ref name=\"ymirdialog\">[[Ymir]]</ref> He lost favor after trying to inform instructors about a student-run animancy experiment that would eventually kill a dozen students.<ref name=\"strategyguide\"></ref>\n\n===Iselmyr===\nFive years into his training, his father's beatings came to a head and resulted in Aloth's Awakening. It occurred when his father learned that Aloth was struggling with magic missiles and flame shields. As he kicked his son, curled up in a fetal position on the floor of the kitchen, Aloth retreated into himself. The trauma caused Iselmyr to emerge, taking over his body and filling the parts of his soul he retreated from. Iselmyr lashed out, breaking the father's arm in three places. He never raised a hand against Aloth again.<ref name=\"twosided\"></ref>\n\nOn his mother's advice, fearing that he would become an outcast, Aloth hid Iselmyr and his awakening. In no small part due to the fact that Iselmyr was an uncouth provincial from a very long time ago (judging by her Hylspeak vernacular). She tended to surface in stressful situations and take control of his body.<ref name=\"twosided\"></ref> Worse yet, she acted without thinking, escalating even the most minute of encounters. As such, Aloth developed an almost pathological need for control in every aspect of his life. He dropped his guard in very few instances, as was the case when he avoided a romance with [[Ymir]], a fellow student from the academy that Iselmyr attempted to pursue.<ref name=\"ymirdialog\"></ref>\n\n===Leaden Key===\nDuring his final year of training, one of Aloth's instructors introduced him to the [[Leaden Key]]. He joined because it would provide postings far away from the Cythwood, Aloth's father, and his erl. Additionally, several of his colleagues had abandoned their studies to pursue [[Animancy]], which Aloth felt needed to be stopped. The Leaden Key seemed to offer solutions to these problems and Aloth \"sincerely believed they wanted to keep kith from the folly of their own foolish ambitions\".<ref name=\"postanimancytrial\">POE1 dialog after the animancy trials</ref>\n\nAloth's work in the Leaden Key required espionage. He arrived in the Dyrwood in 2822 AI to observe animancy and its spread in the region. His handler met with him every few months to receive his reports and issue new leads. His last assignment was to [[Gilded Vale]], to keep an eye on the events surrounding [[Raedric VII]]. At that point he lost contact with his handler and the Leaden Key, whether due to reassignment, death, or sacrifice of his handler, he doesn't know. By the time he met the Watcher he was on his own for several months. He joined the Watcher seeking direction, correctly surmising that they were on the trail of the Leaden Key.<ref name=\"postanimancytrial\">POE1 dialog after the animancy trials</ref> \n\n==={{poe1}}===\nAloth often voices his concerns over [[Animancy]]. He is initially strictly opposed to its practice, viewing it as an affront to the gods.<ref name=\"strategyguide\">Pillars of Eternity Collector's Edition Guide, pg. 120</ref> But, he becomes conflicted during his travels with the Watcher.\n\nAloth doesn't initially disclose his ties to the [[Leaden Key]]. However, the Watcher opens his eyes to their true nature and their activates related to [[Waidwen's Legacy]]. He reveals his relationship to the group after the [[Animancy hearings]]. At which point, the Watcher can decide to either forgive Aloth for his secrecy or banish him. This choice affects his ending. If the latter is chosen, Aloth's story unceremoniously ends; finding himself with nowhere he feels he belongs, he decides in his desperation to head to [[Eir Glanfath]], where he tracks down one of the ancient machines, ending his life by sacrificing his soul to it. Should he remain with the party, the Watcher's influence (see [[#Endings|Endings]]) on Aloth expresses itself in his ending slides.\n\nThe Watcher can choose to help Aloth come to terms with his awakening during his personal quest [[Two-Sided]] and later influence his choice to either accept or suppress Iselmyr (see [[#Iselmyr Resolution|Iselmyr Resolution]]).\n\n===5 Year Interlude===\nThe choice he made at Sun-in-Shadow defined his life over half a decade. Aloth visited Aedyr for the first time in years, visiting either his father (if he favored authority) or his mother (if he favored autonomy) and comes to terms with their actions.\n\nIf Aloth did not suppress Iselmyr, they come to an agreement where she can partake in battle.<ref>Iselmyr says, ''\"Aye, he lets me in on the bashing, and I leave him the jawing.\"''</ref>\n\nAloth focused on his goals with the Leaden Key. His drive to help kith as strong as ever. However, after having followed someone else's lead for so long, the task proved to be more challenging than he thought. As was the case with a little village in Old Vailia, where influence from a past heretical cult had left the village with a practice of ritual bloodletting.\n\n* '''''If he decided to dismantle the Leaden Key''''', Aloth thought to end the ritual by assassinating the tyrannical priest who presided over it. So he arranged for the priest to have an 'accident'. The villagers took the death as an ill-omen and began bloodletting every single week, turning on neighbors for giving too little... villagers began to die.\n* '''''If he decided to lead the Leaden Key''''', Aloth thought to end the ritual by inserting a new ruler. He \"adjusted\" some of the deeds pertaining to the ownership of the land. However, the comtessa who inherited the land did nothing to stop the blood letting ritual. Even worse, she taxed the villagers to pay for a new plantation and conscripted half of them to defend it.\n\nHe decided to track down an ancient and remote Leaden Key sect in the [[Deadfire Archipelago]] so he could observe their workings and use that knowledge for his goals. For this purpose he created the persona of Engferth, a talented pupil with a tragic past, to ingratiate himself with the Vailian animancers at [[Port Maje]]. Since animancy is a subject of interest to the Leaden Key, he figured this would lead him to the sect.\n\n==={{poe2}}===\nThe Watcher meets Aloth at the [[Engwithan dig site]] outside Port Maje. Aloth may have earned a few new scars, but he's no worse for the wear. He asks the Watcher to help him find the ancient Leaden Key sect known only as [[The Painted Masks|\"The Painted Masks\"]].\n\nAloth reveals he struggles with feeling responsible for the incident in Old Valia. After investigating the mysterious sect, the Watcher either convinces Aloth that he isn't responsible (allowing him to continue is work) or that he is responsible (causing him to drop his pursuits). (See [[#Deadfire Endings|Deadfire Endings]])\n\n==Interactions==\n==={{poe1}}===\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =[[Two-Sided]]\n|quests_involved =\n|other           =\n|none            = \n}}\n====Companion====\n* Aloth is the first companion you can recruit. However, if you don't recruit him before the [[Animancy hearings|animancy hearings]] (thus starting Act 3) he will leave Gilded Vale and become unrecruitable.\n* He is first and foremost a powerful [[wizard]], making him one of your highest sources for damage. However, his focus on magical firepower has left him less than optimal for melee.\n* The Collector's Edition Guide describes him as \"obsessive, detail-ortientated, deferential, instructive, dutiful, imperturbed by violence.\"<ref name=\"strategyguide\">Pillars of Eternity Collector's Edition Guide, pg. 120</ref>\n\n====Companion quest====\n* Aloth's companion quest is [[Two-Sided]] which can be obtained by speaking to him after completing [[Never Far from the Queen]]. Aloth will also open up about his involvement with the [[Leaden Key]] after the [[Animancy hearings]].\n\n====Iselmyr resolution====\nAlthough not a factor in Aloth's ending slides, the player can guide Aloth to either accept or suppress Iselmyr. If Iselmyr's favor is 1 or above, Aloth will accept her. If her favor is 0 or negative, Aloth will suppress her.\n\n* The first dialog that affects this choice happens after completing [[Never Far from the Queen]] when Aloth first speaks about Iselmyr.\n** \"She seems reckless.\" → -1 Favor\n** \"Sounds like you could take a few cues from her.\" → +1 Favor\n* The second dialog happens during [[Two-Sided]] when speaking with [[Bellasege]].\n** \"You can't let her make these decisions for you.\" → -1 Favor\n** \"I think she's trying to help you stand up for yourself.\" → +1 Favor\n* The final dialog happens just after speaking with [[Sîdha and Rîhenwn]] in [[Twin Elms]]. \n** \"I can't imagine having her in my head.\" → -1 Favor\n** \"She's not that bad\" → +1 Favor\n\n====Endings====\nAloth's endings change depending on which trait is higher, Autonomy or Authority. There are several conversations where the player can influence these traits:\n* During [[Two-Sided]].\n* Speaking with Aloth after completing [[Two-Sided]] will provide additional dialog about Iselmyr and his parents:\n** \"Not necessarily. Most people have more sense than that.\" → +1 Autonomy\n** \"That's true. People are too easily led.\" → +1 Authority\n** \"She shouldn't have abandoned you like that.\" → +1 Autonomy\n** \"I'm sure she was trying to take care of you in her own way.\" → +1 Authority\n** \"Nonsense. You accomplished that on your own, and you would have been fine without him pushing you.\" → +1 Autonomy\n** \"It's hard to see it at the time, but sometimes pressure is useful.\" → +1 Authority\n* Selecting \"As long as you don't forget who's in charge. I'm keeping a close eye on you from now on\" after the [[Animancy hearings]] provides +1 Authority.\n* After speaking with [[Sîdha and Rîhenwn]] in [[Twin Elms]]:\n** \"Like it or not, she's part of you. And she could be a source of strength if you learn to work with her.\" → +1 Autonomy\n** \"Your whole life, you've been taking orders. If you can't assert your authority over her, you'll never have it anywhere else.\" → +1 Authority\n** \"That's how it's supposed to be. You search for answers elsewhere and find them in yourself.\" '''OR''' \"I've been with you the whole way. I still am.\" → +1 Autonomy\n** \"Most people need that kind of guidance. You don't.\" '''OR''' \"You haven't been on your own. I got you through Brackenbury, remember?\" → +1 Authority\n** \"I'm sure we'd find our way on our own.\" → +1 Autonomy\n** \"Let's just hope that's not the case.\" → +1 Authority\n* After speaking with [[Iovara]] in the final act:\n** \"Thaos is wrong. Most people are fundamentally decent. Knowing the truth can only make them better.\" → +1 Autonomy\n** \"It's an outrage! There's no excuse for misleading people like this.\" → +1 Autonomy\n** \"People need something to believe in...\" → +1 Authority\n\n==={{poe2}}===\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =[[The Painted Masks]]\n|quests_involved =\n|other           =\n|none            = \n}}\n\n====Companion====\n* Aloth is found at the [[Engwithan Digsite]], posing as Engferth among the animancers. He will rejoin you quite promptly, though before you embark on a dungeon crawl, you can listen to the glowing recommendation he received from Selona and the backstory he crafted for himself in order to ingratiate himself with the animancers.\n* If you do not recruit him at the digsite, he will be found in front of [[Governor Clario's Estate]] in [[Port Maje Harbor]].\n* If you do not recruit him at all, he will make his way to [[Ori o Koīki]], but will be killed by the Wahaki tribe.\n* He comes with the unique [[Keybreaker Scepter]] or [[Thaos' Headdress]] (depending on whether he rejected Thaos or took his place respectively) and his old [[Aloth's Leather Armor (Deadfire)|leather armor]], which now has a blue Aedyr sash.\n\n'''Class'''\n*The class options available to Aloth are [[wizard]], [[battlemage]] (wizard + [[fighter]]), or [[spellblade]] (wizard + [[rogue]]).\n\n====Reputation====\n* Aloth likes:\n** {{Topic|Autonomy}} '''Autonomy:''' Believes kith should have the freedom to determine their own futures and appreciates efforts that support this principle (if he decided to dismantle the [[Leaden Key]] in [[Pillars of Eternity]]).\n** {{Topic|Stewardship}} '''Stewardship:''' Believes in benevolent authoritarianism (mutually exclusive with Autonomy).\n** {{Topic|Dutiful}} '''Dutiful:''' Admires people who take responsibility and don't shirk the tasks presented to them.\n* Aloth dislikes: \n** {{Topic|Irresponsibility}} '''Irresponsibility:''' Finds it distasteful when others do not take their duties seriously or attempt to evade their rightful responsibilities.\n** {{Topic|Pride}} '''Pride:''' Is put off by people who proclaim their own merits in defiance of all decorum and decency.\n** {{Topic|Traditional}} '''Traditional:''' Is wary of traditionalism for its own sake and distrusts those who adhere rigidly to old habits and rituals.\n\n====Relationships====\n* [[Xoti]] and [[Maia]]'s dutiful approaches results in a natural increased reputation for Aloth.\n* [[Tekēhu]]'s carefree attitude and hubris greatly vex Aloth.\n* If Aloth became Grandmaster of the Leaden Key it causes some negative reputation with [[Edér]].\n* The Watcher can romance Aloth if your reputation is 2 and you pass a dialogue check (give Aloth his space).\n\n====Deadfire endings====\nAloth's endings change depending if he feels responsible for the consequences of his actions or absolved. The endings are decided in one of two ways:\n* Choosing a specific dialog option at the end of [[The Painted Masks]]. This will outweigh his absolution or responsibility traits, unless you let Aloth decide for himself.\n* If you don't complete the quest, or don't decide for him, whichever trait is higher (given during [[The_Painted_Masks#Absolved.2FResponsible_dialogue|certain conversations]]) will dictate his ending.\n\n==Behind the scenes==\n* Aloth was written by [[Developers|Carrie Patel]].<ref>http://forums.obsidian.net/topic/74557-companions-who-wrote-what/#entry1622138</ref>\n* He is voiced by actor [http://en.wikipedia.org/wiki/Matthew_Mercer Matthew Mercer], who also voices [[Edér Teylecg|Edér]].<ref>https://twitter.com/matthewmercer/status/581136312964489216</ref>\n* Aloth has the unique [[background]] \"Gentry\", which is not available to players. It provides him +2 [[Lore]].\n* Before PoE 1.03, Aloth had the following Attributes: Mig: 12 Con: 10 Dex: 11 Per: 16 Int: 16 Res: 13.\n\n==Gallery==\n<gallery>\nFile:Aloth.png|Early concept\nFile:Aloth-leather-armor.jpg|Aloth in his unique [[Leather armor]].\nFile:Leather armor aloth icon.png|Icon of Aloth's unique [[Leather armor]].\n</gallery>\n\n{{References}}\n\n\n{{Companions navbar PoE1}}\n{{Companions navbar PoE2}}\n[[Category:Gilded Vale characters]]\n[[Category:Engwithan dig site characters]]",
  "slug": "alothCorfiser",
  "title": "Aloth Corfiser"
}
