{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Document}} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = Ancient Tablet\n| icon           = poe2 huana_tablet icon.png\n| description    = This fragile tablet was painstakingly etched in Engwithan runes several thousand years ago.\n\n\"The festival lanterns shine with a warm, yellow glow tonight, bobbing on the light breeze from the sea. The young folk dance, feet stamping and smiles bright, a feverish joy alight in their eyes. The old folk drink and tell tales of years long past, their laughter loud enough to shake the very adra beneath our feet. And the children for whom we do this, our future - they steal sweets from the banquet tables, they wrestle and tease and fight as children ought, and my soul swells with pride.\n\nTogether we celebrate the end of our work and look forward to new beginnings, a shining horizon where we Engwithans and our Huana brethren labor as one for the glory and illumination of all kith. Tonight, Poko Kohara, our masterpiece, sits resplendent, a testament to all that our cultures have striven toward, all that we might gain.\n\nAnd yet, even if our calculations are sound and our construction sturdy - if the machine works as intended - it will be but one small step along the twisting road we must walk together. But if we can harness the power of souls, if we can control the cycle of life and death... the journey will be worth it, no matter how arduous or how long.\n\nAh, but now is not the moment for questions of philosophy. Tonight, we join hands and sing! And tomorrow- tomorrow, our work of generations begins. At last, it begins.\"\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Document\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 0\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Engwithan_Tablet\n| location       = * [[Queen's Berth]]: Sold by [[Sanza]] of [[Sanza's Map Emporium]].\n* [[Outcast's Respite]]: In the bookcase.\n| guid           =615d6a06-7b17-4950-bced-74d37ca70398\n}}\n'''{{Pagename nd}}''' is a {{lc:Document}} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "ancientTablet",
  "title": "Ancient Tablet"
}
