{
  "markdown": "'''{{PAGENAME}}''' is a [side quest](/pillarsOfEternityIiDeadfireQuestsSideQuests/) in {{poe2}}.\n\n## Synopsis\n\n \nWhile exploring Splintered Reef, I came across a tavern filled with vessels, going about their lives as if nothing were amiss. Inside I met a Dargul by the name of Copperhead. He claims there's something strange going on. Judging by the fact that no one seems to have noticed that they are rotting corpses consuming the flesh of living kith, he's probably right.\n\n## Overview\n\n# Journey to [Splintered Reef](/splinteredReef/) and talk to [Copperhead](/copperhead/) in [The Pickled Eel](/thePickledEel/).\n# Leave the tavern by killing [Zulka](/zulka/) and crew '''OR''' avoid her and sneak out.\n# Talk to Copperhead in the [Boathouse](/boathouse/).\n# Head to the [Sea-Lashed Crypt](/seaLashedCrypt/), and unlock the door to the [Glowing Outcrop](/glowingOutcrop/) by obtaining two [Vial of Fampyr Blood](/vialOfFampyrBlood/).\n# Confront [Menzzago](/menzzago/) and either\n::* Kill him and shatter the orb to break the illusion and free the townspeople from their twisted fantasy.\n::* Come to a mutual agreement by offering him luminous adra potions to sustain his need for life essence, in exchange for a promise of the aid of his fleet - should you require it. This causes the attacks on kith to stop, but the undead remain enslaved and under his control.\n\n## Walkthrough\n\n* Head to [The Pickled Eel](/thePickledEel/) and talk to [Copperhead](/copperhead/), a copper helmet-wearing dargul. He's thankful that someone has turned up to assist with the strange happenings in the reef, and will ask you to meet him at the [boathouse](/boathouse/) to discuss the situation.\n* Before he leaves, Copperhead warns you about the guls with the staves, known as \"protectors\". Just as he says that, [Zulka](/zulka/) and her gang of unfriendly dargul's enter the tavern with a pair of captive kith. You'll have to either fight through them, or sneak past in order to leave.\n** If you choose to fight, Zulka will command all of the tavern patrons to attack you - but luckily a few well-placed explosive barrels make the job easier.\n:{{Note|Note that should you kill the [Tavernkeeper](/thePickledEelTavernkeeper/), you will no longer be able to purchase the [Grave Hound Pup](/graveHoundPup/) from him, so it is recommended that you purchase it '''before''' talking to Copperhead.}}\n:* Once they are dead, the captives in the back room can be freed. You can examine the iron collar on them using [Arcana](/arcana/) 15 to determine that it possess a similar incantation to the marks on the foreheads of the undead, which makes them appear as livestock instead of captive kith. Doing this, or talking to [Copperhead](/copperhead/) in the boatshed allows you to tell them what is going on. One of the captives mentions that they were sailing under [Captain Teryc Lofell](/captainTerycLofell/) of the ''Antelope'' (a [Príncipi](/principi/) ship), and that they were took captive by the crew of [The Floating Hangman](/theFloatingHangman/). Freeing them is the objective of the quest [The Final Voyage](/theFinalVoyage/).\n:* Alternatively, sneaking by is relatively easy, none of the townsfolk are hostile and Zulka wanders back and forth, creating space for a swift and stealthy exit. She will remain at the tavern should you return during the quest, and will become hostile as soon as you enter.\n* Head to the boathouse on the other side of the reef. Copperhead will reveal that the entire town is living under some sort of illusion, generated from the keep at the heart of the island, which used to belong to [Lucia Rivan](/luciaRivan/). He wants to free the townsfolk from their twisted fantasy, and asks you to investigate.\n** You can ask him to let you look at his helmet, which is supposedly shielding him from the effects of the illusion. Copperhead is very reluctant, as removing it will put him back \"into the dream\". With [Arcana](/arcana/) 18, you confirm that the helmet has a repulsing effect on magic just by looking at it. Though if you force it from him with [Might](/might/) 15, he is reduced to a slack-jawed puppet as soon as it leaves his head. You gain [Copperhead's Helm](/copperheadsHelm/), and are able to more closely examine it. Returning the helmet will restore his consciousness, but due to a seemingly broken dialogue tree, you are unable to actually tell him about the helmet: \"I think your helmet dampens magical effects. It's shielding you from whatever spell is being cast on everyone else.\"\n** He'll also offer to create a distraction, as the guards rarely leave their posts for anything but fresh meat.\n\n## =The crypt\n\n=\n* You'll need to reach [Menzzago](/menzzago/) on the [Glowing Outcrop](/glowingOutcrop/). Head to the [Sea-Lashed Crypt](/seaLashedCrypt/) and deal with the guards. If you took Copperhead up on his offer of a distraction, most of the [Risen Armsman](/risenArmsman/) will be lured away from the exterior section of the crypt. Even so, the fight is managable as long as you don't aggro all the enemies at once. Again, you can use the explosive barrels and amphora that are dotted around to your advantage. The wooden gangplank serves as an excellent choke point to funnel incoming enemies.\n* Enter the crypt proper via the entrance to the north, then proceed through to the great doors in the center of the area which lead to the [Glowing Outcrop](/glowingOutcrop/). In order to open them you'll need to pour a [Vial of Fampyr Blood](/vialOfFampyrBlood/) into each font. These are dropped by [Runemaster Kastor](/runemasterKastor/) in the lab to the east, and [Quartermaster Harka](/quartermasterHarka/) to the northwest.\n\n## =Confronting Menzzago\n\n=\n* Once you've obtained the vials and unlocked the door to the Glowing Outcrop, Menzzago awaits on the other side. He explains that the glowing sphere of energy serves as a channeling point for the powerful spell cast upon the reef and the townsfolk, a spell which - as expected - provides a means to make them unaware of their own fate. You can kill him outright or try to negotiate a peaceful conclusion.\n* Making a deal involves offering him a supply of luminous adra potions to replace their regular meals of live kith (as a source of living essence). In return, Menzzago will become your ally, and his fleet of ships will be at your disposal. This will put a stop to the fampyr's need to consume live kith, but will not break the illusion. To start, you'll need a party-assisted [Diplomacy](/diplomacy/) or [Survival](/survival/) 8 in order to make your case (proclaiming yourself as Berath's Herald, passing the [Insight](/insight/) 8 check, or offering your services as a [Goldpact Knights](/goldpactKnights/) paladin has no effect). Next, you'll need one of the following:\n** If you have discovered Ukaizo, you can leverage your current alliance with a faction (Huana, VTC, RDC, Príncipi), to convince him that the spoils of adra there will be shared with him, much to the chagrin of the respective factions' companions. Failing to pass one of the checks below will cause him to become hostile. If you suggest you'll ally with ''him'' to take Uzaizo, this is a free pass. If you instead say you'll take Ukaizo yourself, he becomes hostile. If you attempt to persuade him that your allied faction will share, this requires one of the following:\n*** ''\"I'll talk them into it\"'', requires a party-assisted 12 [Diplomacy](/diplomacy/).\n*** ''\"They wouldn't dare refuse.\"'', requires [Resolve](/resolve/) 18.\n** You can also offer to negotiate a supply of luminous adra potions from the [Vailian Trading Company](/vailianTradingCompany/). This requires ALL of the following:\n*** Allied with the [Vailian Trading Company](/vailianTradingCompany/) for [The Coming Storm](/theComingStorm/) or have at least 3 reputation with them, and have a party-assisted 16 [Diplomacy](/diplomacy/).\n*** Restored the adra in [Hasongo](/hasongo/) OR [Poko Kohara](/pokoKohara/).\n*** Have not yet discovered [Ukaizo](/ukaizo/).\n*:He will eventually demand a token of good faith, in the form of a [Luminous Adra Potion](/luminousAdraPotion/). Giving him a sample will complete the quest, and not providing it will cause him to attack. You can also choose to poison him instead (see below). This requirement is exclusive to the VTC option, choosing either the Ukaizo option (above) or Crookspur option (below) do not require that you provide a sample of luminous adra.\n** If you have allied with [Crookspur Slavers](/crookspurSlavers/), you can say you'll demand they send regular shipments of luminous adra. This requires that you've completed [Tip of the Spear](/tipOfTheSpear/), that [Master Kua](/masterKua/) is still alive, and that Crookspur is still owned by the slavers.\n* Otherwise, you can choose to attack and break the orb in order to free the townsfolk.\n** If the you possess a [Scorching Venom](/scorchingVenom/) and [Bluff](/bluff/) 8, you can poison Menzzago instead of a giving him a Luminous Adra Potion (you can pick this option alongside the Diplomacy/Survival check above, or after picking the VTC dialogue). This will start combat, and Menzzago will begin the fight with the [Sickened](/statusEffectsDeadfireSickened/) affliction.\n** For those experiencing difficulty with the fight, since it has many difficult opponents, one can enter stealth with their party (even with low skill) and approach from the east, staying tight against the wall. When the conversation begins, the party can feasibly be directly beside Menzzago. This gives an opportunity to face him directly, divides the Fampyr's to each side of him, and avoids having to fight the Algul's that come up the south wall. As long as you keep the fight above the steps, the algul's shouldn't join the fight.\n** Once Menzzago is dead, make sure to loot his body for [Amaliorra](/amaliorra/), [Spider Silk Robe](/spiderSilkRobe/), and [Menzzago's Grimoire](/menzzagosGrimoire/). Shatter the orb in order to stop the illusion, turning the undead of Splintered Reef into mindless husks again.\n\n## =Quest completion\n\n=\n* Either way, return to Copperhead after smashing the orb, as he asked. Or bask in the glory of having made a pact with the devil. Completing the quest grants you the [achievement](/achievementsDeadfire/), \"Paradise of the Mind\".\n* If you smashed the orb:\n** Copperhead is thankful. He's able to remove the helmet without fear of losing his self-control. While he's had a long time to come to peace with what he is, Copperhead wonders what it would be like if the other townsfolk would've had the same chance. As a token of gratitude, he gives you his helmet [Copperhead's Helm](/copperheadsHelm/). You can choose to accept it or not, and ask him to join your crew.\n** Returning to the tavern, [Zulka](/zulka/) is no longer present, but the townspeople have all reverted to their prior state - and are hostile towards you like any other guls. You can also free the captives in the back room if you haven't already, as they aren't apart of the quest itself - though the dialogue is centered around information that has already been established.\n* If you made a deal with Menzzago:\n** Copperhead is frustrated that the illusion still stands, and that the \"people\" of Splintered Reef are still under control. You can try to bring him some consolation by telling him that he no longer needs to eat kith to survive, but his spirits and his hope of bringing freedom to the area are dashed.\n** You gain Menzzago's promise of the aid of his fleet, should you require it. ''This may have something to do with the outcome of certain end-game quests, but the exact effect is unclear''\n** [Zulka](/zulka/) is no longer present at The Pickled Eel, and you may come and go freely.\n*If you killed Menzzago but didn't smash the orb:\n**Copperhead is puzzled that you chose not to dispel the illusion. He reminds you that kith are still being fed to the undead, and worries about what will happen if Luca Rivan returns. He gives you a [Corroded Bronze Horn Figurine](/corrodedBronzeHornFigurine/).\n**[Zulka](/zulka/) is no longer present at The Pickled Eel, and you may come and go freely. You can opt to free the captive kith held there, if you haven't already.\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/20_SplinteredReef/20_qst_Splintered_Reef_Main.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''A Paradise of the Mind'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| While exploring <b>Splintered Reef</b>, I came across a tavern filled with vessels, going about their lives as if nothing were amiss. Inside I met a Dargul by the name of <b>Copperhead</b>. He claims there's something strange going on. Judging by the fact that no one seems to have noticed that they are rotting corpses consuming the flesh of living kith, he's probably right.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| I stumbled across a crypt nestled within a craggy outcrop at the center of <b>Splintered Reef</b>, swarming with shambling corpses. There appears to be a great number of vessels amassing in this region.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Speak with <b>Copperhead</b> in his home.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Copperhead</b> asked me to meet with him in his <b>dwelling at the outskirts of town to the west</b>. He seems to know more about the situation here in <b>Splintered Reef</b>.\n|-\n| rowspan=\"7\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Investigate the <b>crypt</b> in Splintered Reef.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| Copperhead revealed that he believes that everyone in town is under the illusion that they are living kith. Somehow the helmet he salvaged blocks the magic, which appears to emanate from the top of the <b>crypt at the center of town</b>.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| <b>Copperhead</b> has agreed to create a diversion outside the <b>crypt</b>, so I can sneak inside without alerting the undead horde who guard it.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I encountered a Fampyr who was creating vessels of some kind. After killing her, I was able to salvage some of her blood.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I encountered a Fampyr who was attaching magical seals to undead. After killing him, I was able to salvage some of his blood.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| It seems like braziers beside the door light up when Fampyr blood is placed in the reservoir beneath them.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I discovered a <b>door</b> that had no apparent lock or handle on it, but rather two reservoirs to either side with dried blood inside them.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Ascend the stairs within the <b>crypt</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| My investigation has yielded a path leading up along the rocky promontory overlooking the island. Hardly inviting, but I'm guessing that's where I'll find some answers.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Speak with <b>Copperhead</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I put an end to Menzzago's dominion over the wretched souls of Splintered Reef. I should get back to <b>Copperhead</b> and update him on the situation.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| Menzzago used a magical orb to cement his hold over the people of Splintered Reef. With him gone, it falls to me to decide what to do with it.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| I decided to destroy the <b>Orb that Menzzago</b> used to control the undead.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''24'''\n| colspan=\"2\" | '''Explore <b>Splintered Reef</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10024\n| Copperhead is dead, which means that I'll have to investigate the island and its grotesque inhabitants on my own.\n|-\n| rowspan=\"7\" style=\"vertical-align:text-top; text-align:center\" | '''25'''\n| colspan=\"2\" | '''Investigate the <b>crypt</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10025\n| Whatever power is at work on this island, this <b>crypt</b> seems to be at the center of it. Maybe I can find some clues within - if I can avoid joining the horde of rotting kith roaming the area.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I discovered a <b>door</b> that had no apparent lock or handle on it, but rather two reservoirs to either side with dried blood inside them.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I encountered a Fampyr who was creating vessels of some kind. After killing her, I was able to salvage some of her blood.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I encountered a Fampyr who was attaching magical seals to undead. After killing him, I was able to salvage some of his blood.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| It seems like braziers beside the door light up when Fampyr blood is placed in the reservoir beneath them.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| I decided to destroy the <b>Orb that Menzzago</b> used to control the undead.\n|-\n| rowspan=\"6\" style=\"vertical-align:text-top; text-align:center\" | '''26'''\n| colspan=\"2\" | '''Investigate the crypt in Splintered Reef.'''\n|-\n| style=\"vertical-align:text-top\" | 10026\n| The crypt is well-defended. Whatever is going on on this island, the crypt seems to  be at the heart of it.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| <b>Copperhead</b> has agreed to create a diversion outside the <b>crypt</b>, so I can sneak inside without alerting the undead horde who guard it.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I encountered a Fampyr who was creating vessels of some kind. After killing her, I was able to salvage some of her blood.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I encountered a Fampyr who was attaching magical seals to undead. After killing him, I was able to salvage some of his blood.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I discovered a <b>door</b> that had no apparent lock or handle on it, but rather two reservoirs to either side with dried blood inside them.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Deal with Menzzago.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| I have reached the summit of the keep. If I am to have any hand in Splintered Reef's future, I'll have to deal with its current ruler. \n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| I decided it was best that the people of Splintered Reef remain in their stupor. The spell's effects may wane in time, but until then they remain content. \n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I convinced Menzzago I made a better ally than enemy. He has agreed to lend me the aid of his fleet, should I require it.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I destroyed the orb atop the crypt in Splintered Reef, freeing its denizens from their collective illusion. Without the orb's magic, there will be no hope of Menzzago raising an army.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| I took it upon myself to put down the vessels of Splintered Reef. The mind-altering orb, at least, may still be of use to me.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30004\n| I defeated Menzzago, ruler of Splintered Reef, putting an end to whatever schemes he had in mind.\n|}",
  "raw": "{{Infobox quest poe2\n| name         = A Paradise of the Mind\n| image        = PE2 A Paradise of the Mind.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Side quest\n| quest_region = Deadfire - Southeast\n| quest_level  = 15\n| faction      = \n| locations    = Splintered Reef;The Pickled Eel;Boathouse;Sea-Lashed Crypt;Glowing Outcrop\n| main_npcs    = Copperhead;Zulka;Runemaster Kastor;Quartermaster Harka;Menzzago\n| quest_giver  = Copperhead\n| xp_amount    = 2500\n| xp_type      = Normal\n| xp_level     = 15\n| xp_weights   = 1;1;1;1;1;1;1;1\n| rewardname1  = Kill Menzzago\n| reward1      = [[Amaliorra]];[[Spider Silk Robe]];[[Copperhead's Helm]];[[Copperhead]] as crew member;\"Paradise of the Mind\" [[Achievements (Deadfire)|achievement]]\n| rewardname2  = Make a deal with Menzzago\n| reward2      = \"Paradise of the Mind\" [[Achievements (Deadfire)|achievement]];Promise of [[Menzzago]]'s aid\n| rewardname3  = \n| reward3      =  \n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         =\n| internalname = 20_qst_Splintered_Reef_Main\n| guid         = 6d0c7bf7-fe19-4a04-ba51-a6948572e2f8\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests#Side quests|side quest]] in {{poe2}}.\n\n==Synopsis== \nWhile exploring Splintered Reef, I came across a tavern filled with vessels, going about their lives as if nothing were amiss. Inside I met a Dargul by the name of Copperhead. He claims there's something strange going on. Judging by the fact that no one seems to have noticed that they are rotting corpses consuming the flesh of living kith, he's probably right.\n\n==Overview==\n# Journey to [[Splintered Reef]] and talk to [[Copperhead]] in [[The Pickled Eel]].\n# Leave the tavern by killing [[Zulka]] and crew '''OR''' avoid her and sneak out.\n# Talk to Copperhead in the [[Boathouse]].\n# Head to the [[Sea-Lashed Crypt]], and unlock the door to the [[Glowing Outcrop]] by obtaining two [[Vial of Fampyr Blood]].\n# Confront [[Menzzago]] and either\n::* Kill him and shatter the orb to break the illusion and free the townspeople from their twisted fantasy.\n::* Come to a mutual agreement by offering him luminous adra potions to sustain his need for life essence, in exchange for a promise of the aid of his fleet - should you require it. This causes the attacks on kith to stop, but the undead remain enslaved and under his control.\n\n==Walkthrough==\n* Head to [[The Pickled Eel]] and talk to [[Copperhead]], a copper helmet-wearing dargul. He's thankful that someone has turned up to assist with the strange happenings in the reef, and will ask you to meet him at the [[boathouse]] to discuss the situation.\n* Before he leaves, Copperhead warns you about the guls with the staves, known as \"protectors\". Just as he says that, [[Zulka]] and her gang of unfriendly dargul's enter the tavern with a pair of captive kith. You'll have to either fight through them, or sneak past in order to leave.\n** If you choose to fight, Zulka will command all of the tavern patrons to attack you - but luckily a few well-placed explosive barrels make the job easier.\n:{{Note|Note that should you kill the [[The Pickled Eel tavernkeeper|Tavernkeeper]], you will no longer be able to purchase the [[Grave Hound Pup]] from him, so it is recommended that you purchase it '''before''' talking to Copperhead.}}\n:* Once they are dead, the captives in the back room can be freed. You can examine the iron collar on them using [[Arcana]] 15 to determine that it possess a similar incantation to the marks on the foreheads of the undead, which makes them appear as livestock instead of captive kith. Doing this, or talking to [[Copperhead]] in the boatshed allows you to tell them what is going on. One of the captives mentions that they were sailing under [[Captain Teryc Lofell]] of the ''Antelope'' (a [[Príncipi]] ship), and that they were took captive by the crew of [[The Floating Hangman]]. Freeing them is the objective of the quest [[The Final Voyage]].\n:* Alternatively, sneaking by is relatively easy, none of the townsfolk are hostile and Zulka wanders back and forth, creating space for a swift and stealthy exit. She will remain at the tavern should you return during the quest, and will become hostile as soon as you enter.\n* Head to the boathouse on the other side of the reef. Copperhead will reveal that the entire town is living under some sort of illusion, generated from the keep at the heart of the island, which used to belong to [[Lucia Rivan]]. He wants to free the townsfolk from their twisted fantasy, and asks you to investigate.\n** You can ask him to let you look at his helmet, which is supposedly shielding him from the effects of the illusion. Copperhead is very reluctant, as removing it will put him back \"into the dream\". With [[Arcana]] 18, you confirm that the helmet has a repulsing effect on magic just by looking at it. Though if you force it from him with [[Might]] 15, he is reduced to a slack-jawed puppet as soon as it leaves his head. You gain [[Copperhead's Helm]], and are able to more closely examine it. Returning the helmet will restore his consciousness, but due to a seemingly broken dialogue tree, you are unable to actually tell him about the helmet: \"I think your helmet dampens magical effects. It's shielding you from whatever spell is being cast on everyone else.\"\n** He'll also offer to create a distraction, as the guards rarely leave their posts for anything but fresh meat.\n\n===The crypt===\n* You'll need to reach [[Menzzago]] on the [[Glowing Outcrop]]. Head to the [[Sea-Lashed Crypt]] and deal with the guards. If you took Copperhead up on his offer of a distraction, most of the [[Risen Armsman]] will be lured away from the exterior section of the crypt. Even so, the fight is managable as long as you don't aggro all the enemies at once. Again, you can use the explosive barrels and amphora that are dotted around to your advantage. The wooden gangplank serves as an excellent choke point to funnel incoming enemies.\n* Enter the crypt proper via the entrance to the north, then proceed through to the great doors in the center of the area which lead to the [[Glowing Outcrop]]. In order to open them you'll need to pour a [[Vial of Fampyr Blood]] into each font. These are dropped by [[Runemaster Kastor]] in the lab to the east, and [[Quartermaster Harka]] to the northwest.\n\n===Confronting Menzzago===\n* Once you've obtained the vials and unlocked the door to the Glowing Outcrop, Menzzago awaits on the other side. He explains that the glowing sphere of energy serves as a channeling point for the powerful spell cast upon the reef and the townsfolk, a spell which - as expected - provides a means to make them unaware of their own fate. You can kill him outright or try to negotiate a peaceful conclusion.\n* Making a deal involves offering him a supply of luminous adra potions to replace their regular meals of live kith (as a source of living essence). In return, Menzzago will become your ally, and his fleet of ships will be at your disposal. This will put a stop to the fampyr's need to consume live kith, but will not break the illusion. To start, you'll need a party-assisted [[Diplomacy]] or [[Survival]] 8 in order to make your case (proclaiming yourself as Berath's Herald, passing the [[Insight]] 8 check, or offering your services as a [[Goldpact Knights]] paladin has no effect). Next, you'll need one of the following:\n** If you have discovered Ukaizo, you can leverage your current alliance with a faction (Huana, VTC, RDC, Príncipi), to convince him that the spoils of adra there will be shared with him, much to the chagrin of the respective factions' companions. Failing to pass one of the checks below will cause him to become hostile. If you suggest you'll ally with ''him'' to take Uzaizo, this is a free pass. If you instead say you'll take Ukaizo yourself, he becomes hostile. If you attempt to persuade him that your allied faction will share, this requires one of the following:\n*** ''\"I'll talk them into it\"'', requires a party-assisted 12 [[Diplomacy]].\n*** ''\"They wouldn't dare refuse.\"'', requires [[Resolve]] 18.\n** You can also offer to negotiate a supply of luminous adra potions from the [[Vailian Trading Company]]. This requires ALL of the following:\n*** Allied with the [[Vailian Trading Company]] for [[The Coming Storm]] or have at least 3 reputation with them, and have a party-assisted 16 [[Diplomacy]].\n*** Restored the adra in [[Hasongo]] OR [[Poko Kohara]].\n*** Have not yet discovered [[Ukaizo]].\n*:He will eventually demand a token of good faith, in the form of a [[Luminous Adra Potion]]. Giving him a sample will complete the quest, and not providing it will cause him to attack. You can also choose to poison him instead (see below). This requirement is exclusive to the VTC option, choosing either the Ukaizo option (above) or Crookspur option (below) do not require that you provide a sample of luminous adra.\n** If you have allied with [[Crookspur Slavers]], you can say you'll demand they send regular shipments of luminous adra. This requires that you've completed [[Tip of the Spear]], that [[Master Kua]] is still alive, and that Crookspur is still owned by the slavers.\n* Otherwise, you can choose to attack and break the orb in order to free the townsfolk.\n** If the you possess a [[Scorching Venom]] and [[Bluff]] 8, you can poison Menzzago instead of a giving him a Luminous Adra Potion (you can pick this option alongside the Diplomacy/Survival check above, or after picking the VTC dialogue). This will start combat, and Menzzago will begin the fight with the [[Status effects (Deadfire)#Sickened|Sickened]] affliction.\n** For those experiencing difficulty with the fight, since it has many difficult opponents, one can enter stealth with their party (even with low skill) and approach from the east, staying tight against the wall. When the conversation begins, the party can feasibly be directly beside Menzzago. This gives an opportunity to face him directly, divides the Fampyr's to each side of him, and avoids having to fight the Algul's that come up the south wall. As long as you keep the fight above the steps, the algul's shouldn't join the fight.\n** Once Menzzago is dead, make sure to loot his body for [[Amaliorra]], [[Spider Silk Robe]], and [[Menzzago's Grimoire]]. Shatter the orb in order to stop the illusion, turning the undead of Splintered Reef into mindless husks again.\n\n===Quest completion===\n* Either way, return to Copperhead after smashing the orb, as he asked. Or bask in the glory of having made a pact with the devil. Completing the quest grants you the [[Achievements (Deadfire)|achievement]], \"Paradise of the Mind\".\n* If you smashed the orb:\n** Copperhead is thankful. He's able to remove the helmet without fear of losing his self-control. While he's had a long time to come to peace with what he is, Copperhead wonders what it would be like if the other townsfolk would've had the same chance. As a token of gratitude, he gives you his helmet [[Copperhead's Helm]]. You can choose to accept it or not, and ask him to join your crew.\n** Returning to the tavern, [[Zulka]] is no longer present, but the townspeople have all reverted to their prior state - and are hostile towards you like any other guls. You can also free the captives in the back room if you haven't already, as they aren't apart of the quest itself - though the dialogue is centered around information that has already been established.\n* If you made a deal with Menzzago:\n** Copperhead is frustrated that the illusion still stands, and that the \"people\" of Splintered Reef are still under control. You can try to bring him some consolation by telling him that he no longer needs to eat kith to survive, but his spirits and his hope of bringing freedom to the area are dashed.\n** You gain Menzzago's promise of the aid of his fleet, should you require it. ''This may have something to do with the outcome of certain end-game quests, but the exact effect is unclear''\n** [[Zulka]] is no longer present at The Pickled Eel, and you may come and go freely.\n*If you killed Menzzago but didn't smash the orb:\n**Copperhead is puzzled that you chose not to dispel the illusion. He reminds you that kith are still being fed to the undead, and worries about what will happen if Luca Rivan returns. He gives you a [[Corroded Bronze Horn Figurine]].\n**[[Zulka]] is no longer present at The Pickled Eel, and you may come and go freely. You can opt to free the captive kith held there, if you haven't already.\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/20_SplinteredReef/20_qst_Splintered_Reef_Main.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''A Paradise of the Mind'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| While exploring <b>Splintered Reef</b>, I came across a tavern filled with vessels, going about their lives as if nothing were amiss. Inside I met a Dargul by the name of <b>Copperhead</b>. He claims there's something strange going on. Judging by the fact that no one seems to have noticed that they are rotting corpses consuming the flesh of living kith, he's probably right.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| I stumbled across a crypt nestled within a craggy outcrop at the center of <b>Splintered Reef</b>, swarming with shambling corpses. There appears to be a great number of vessels amassing in this region.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Speak with <b>Copperhead</b> in his home.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Copperhead</b> asked me to meet with him in his <b>dwelling at the outskirts of town to the west</b>. He seems to know more about the situation here in <b>Splintered Reef</b>.\n|-\n| rowspan=\"7\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Investigate the <b>crypt</b> in Splintered Reef.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| Copperhead revealed that he believes that everyone in town is under the illusion that they are living kith. Somehow the helmet he salvaged blocks the magic, which appears to emanate from the top of the <b>crypt at the center of town</b>.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| <b>Copperhead</b> has agreed to create a diversion outside the <b>crypt</b>, so I can sneak inside without alerting the undead horde who guard it.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I encountered a Fampyr who was creating vessels of some kind. After killing her, I was able to salvage some of her blood.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I encountered a Fampyr who was attaching magical seals to undead. After killing him, I was able to salvage some of his blood.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| It seems like braziers beside the door light up when Fampyr blood is placed in the reservoir beneath them.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I discovered a <b>door</b> that had no apparent lock or handle on it, but rather two reservoirs to either side with dried blood inside them.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Ascend the stairs within the <b>crypt</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| My investigation has yielded a path leading up along the rocky promontory overlooking the island. Hardly inviting, but I'm guessing that's where I'll find some answers.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Speak with <b>Copperhead</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I put an end to Menzzago's dominion over the wretched souls of Splintered Reef. I should get back to <b>Copperhead</b> and update him on the situation.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| Menzzago used a magical orb to cement his hold over the people of Splintered Reef. With him gone, it falls to me to decide what to do with it.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| I decided to destroy the <b>Orb that Menzzago</b> used to control the undead.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''24'''\n| colspan=\"2\" | '''Explore <b>Splintered Reef</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10024\n| Copperhead is dead, which means that I'll have to investigate the island and its grotesque inhabitants on my own.\n|-\n| rowspan=\"7\" style=\"vertical-align:text-top; text-align:center\" | '''25'''\n| colspan=\"2\" | '''Investigate the <b>crypt</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10025\n| Whatever power is at work on this island, this <b>crypt</b> seems to be at the center of it. Maybe I can find some clues within - if I can avoid joining the horde of rotting kith roaming the area.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I discovered a <b>door</b> that had no apparent lock or handle on it, but rather two reservoirs to either side with dried blood inside them.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I encountered a Fampyr who was creating vessels of some kind. After killing her, I was able to salvage some of her blood.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I encountered a Fampyr who was attaching magical seals to undead. After killing him, I was able to salvage some of his blood.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| It seems like braziers beside the door light up when Fampyr blood is placed in the reservoir beneath them.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| I decided to destroy the <b>Orb that Menzzago</b> used to control the undead.\n|-\n| rowspan=\"6\" style=\"vertical-align:text-top; text-align:center\" | '''26'''\n| colspan=\"2\" | '''Investigate the crypt in Splintered Reef.'''\n|-\n| style=\"vertical-align:text-top\" | 10026\n| The crypt is well-defended. Whatever is going on on this island, the crypt seems to  be at the heart of it.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| <b>Copperhead</b> has agreed to create a diversion outside the <b>crypt</b>, so I can sneak inside without alerting the undead horde who guard it.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I encountered a Fampyr who was creating vessels of some kind. After killing her, I was able to salvage some of her blood.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I encountered a Fampyr who was attaching magical seals to undead. After killing him, I was able to salvage some of his blood.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I discovered a <b>door</b> that had no apparent lock or handle on it, but rather two reservoirs to either side with dried blood inside them.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Deal with Menzzago.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| I have reached the summit of the keep. If I am to have any hand in Splintered Reef's future, I'll have to deal with its current ruler. \n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| I decided it was best that the people of Splintered Reef remain in their stupor. The spell's effects may wane in time, but until then they remain content. \n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I convinced Menzzago I made a better ally than enemy. He has agreed to lend me the aid of his fleet, should I require it.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I destroyed the orb atop the crypt in Splintered Reef, freeing its denizens from their collective illusion. Without the orb's magic, there will be no hope of Menzzago raising an army.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| I took it upon myself to put down the vessels of Splintered Reef. The mind-altering orb, at least, may still be of use to me.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30004\n| I defeated Menzzago, ruler of Splintered Reef, putting an end to whatever schemes he had in mind.\n|}",
  "slug": "aParadiseOfTheMind",
  "title": "A Paradise of the Mind"
}
