{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = A Recent History of Queen's Berth: The Arrival of the Vailians\n| icon           = poe2 book_tome icon.png\n| description    = Excerpted from a letter by Winge Wharaki, a Huana historian, from a collection of her personal writings.\n\n\"The Vailians' arrival in Neketaka was not unexpected. Our fisherfolk had watched them lurk near the edges of our territory for months, their ships like the keen eyes of a jeweler, inspecting us, already counting the coin they'd make on a prize so fine as the Deadfire. They were not the first to watch us so - doubtless they will not be last.\n\nWe were not certain what it was they wanted, at first, aside from whatever it was we had. When Onekaza sent an envoy of Mataru to speak with the them, they made noise about desiring trade and cultural exchange. What, exactly, it was they intended to trade, or what manner of cultural exchange they thought might entice u,s wasn't immediately clear.\n\nWe were not naïve - we knew their arrival spelled change for the Deadfire as surely as we know that rain falls in the monsoon season. The trouble came in how we would manage the Vailians' influence, how we would ''contain'' it. Better they think us partners than easy marks, the thinking at the palace went at the time. We could not risk war with them, as fractured a people as we are, and have any hope of winning it, no matter the power of our watershapers.\n\nAs the leader of the Kahanga, Onekaza decided for us. She allowed the Vailians to set down roots in Queen's Berth and begin limited mining operations in the archipelago. She suggested this might ease trade and tensions between our people and theirs, but, in truth, I believe she only wanted to keep an eye on them. I sympathize with her point of view, but I cannot endorse it, because Onekaza forgot the truth of roots - that they are the silent, grasping hands of trees, and that a tree once established cannot be moved without destroying the ground around it.\n\nBut it was done. The Vailians quickly made themselves at home, and the ensuing conflict over who had rights to which islands, which adra veins, which trading routes only served to fracture the Huana further.\n\nThen the Rauataians arrived.\n\nBy that point, it was too late. The colonials were in the Deadfire to stay. Now Huana refugees flood into Neketaka from across the archipelago, complaining of lost land and dwindling resources, and the trading companies fight a quiet war against each other with our doorsteps as the front.\n\nNgati guide us in this trying time.\"\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Book\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 0\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Queens_Berth\n| location       = \n| guid           =c21a200e-83c2-4c42-8f30-871145a7b52f\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "aRecentHistoryOfQueensBerthTheArrivalOfTheVailians",
  "title": "A Recent History of Queen's Berth: The Arrival of the Vailians"
}
