{
  "markdown": "###### Major Positive reputation with the Príncipi;See [Outcomes](/outcomes/) below\n\n| rewardname2  = Aid Aeldys and free the slaves\n| reward2      = [Blackblade's Hood](/blackbladesHood/);{{cp2|2500}};Major Positive reputation with the Príncipi;See [Outcomes](/outcomes/) below\n| rewardname3  = \n| reward3      = \n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = Symbols of Death\n| conc         = Cruel Cargo;Clearing Out Crookspur;Of Like Minds;Tip of the Spear;\n| internalname = FCT_QST_Principi_Slavers\n| guid         = ca999a50-e900-4968-a695-f30c8df8599b\n}}\n'''{{PAGENAME}}''' is a [faction quest](/pillarsOfEternityIiDeadfireQuestsFactionQuests/) in {{poe2}}.\n\n## Synopsis\n\n \nCaptain Furrante has a wealthy contact who has business dealings with the slavers of [Crookspur](/crookspur/). However, recent troubles with the locals have affected their trade routes.\n\nThis contact is willing to owe Furrante a political favor for assisting the slavers. However, as slaving is a crime within the Príncipi, Furrante has asked the Watcher to discreetly smooth this problem in his stead.\n\n## Walkthrough\n\n* Furrante will ask you to travel to [Crookspur](/crookspur/) and meet [Master Kua](/masterKua/), the leader of the slavers. As you leave Dunnage, you will receive an alternate missive from Aeldys, asking you to come meet her. She, in turn, wants you to destroy the slaver operation.\n* After leaving Dunnage, you will recieve a [letter](/wineAndBloodSplatteredLetter/) from  [Captain Aeldys](/captainAeldys/) asking you to meet with her at [Fort Deadlight](/fortDeadlight/). You can inform her of Furrante's little side-gig. She knew as much, but if you also figure out that he's working with the VTC (by way of [Director Castol](/directorCastol/)), you can inform her of that and get 2500 cp. Bringing her the [Candied Nuts](/candiedNuts/) she asked for will net you Minor Positive Reputation gained with Principi sen Patrena.\n* Ultimately, this quest has two separate paths that you can take, the outcomes of which will influence the other concurrent quests. You can either choose to oblige the Crookspur slavers, and wipe out the Wahiki tribe, or you can bring a stop to their operation. Make sure to bring along [Serafen](/serafen/) for some unique dialog.\n\n## =For Crookspur\n\n=\n* This option is the goal of [Captain Furrante](/captainFurrante/)'s side of the quest, and the VTC quest [Of Like Minds](/ofLikeMinds/). It starts [Tip of the Spear](/tipOfTheSpear/).\n{{Note|Completing Tip of the Spear will cause you to fail the RDC quest [Clearing Out Crookspur](/clearingOutCrookspur/) upon returning to [Atsura](/atsura/) in the [Imperial Command](/imperialCommand/) (though not if you have killed Kua, see [notes](/notes/) below). This means you will no longer be able to ally with the [Royal Deadfire Company](/royalDeadfireCompany/) later during [The Coming Storm](/theComingStorm/)!}}\n* Head to [Crookspur](/crookspur/), to the far north-west of [Neketaka](/neketaka/).\n* Enter the fortress by speaking to the ogre at the gate, he'll think you're just another buyer here for the slave auction, and will let you straight in. The auction will be coming to a close, with the last slave, [Handsome Eliam](/handsomeEliam/) - a death godlike, up for offer. You can either bid for the slave, continue to spectate the auction, or - by passing a skill check below - question the legality of his sale. This will have you ejected from the fort, putting it on high alert (not recommended if you want to assist the slavers):\n** With Streetwise 10, you can point out their need for so much firepower if what they're doing is perfectly legal.\n** With Bluff 10, you can say that their operation is under investigation by the crowned royals of Neketaka.\n* If you don't make a scene [Auctioneer Marcca](/auctioneerMarcca/) will grant you an audience with [Master Kua](/masterKua/). Enter the fort to the north west and speak to him in his office. Kua will commend your \"refined tastes\" in purchasing their most valuable offering, and will ask that you pay what is owed. You can pay him (if you want to waste your money) or offer your services in exchange. He will discuss his prior agreement with Furrante, and ask that you eliminate the leaders of the Wahaki tribe, who have recently been commanding attacks on the slavers' ships. You can agree to take care of it, and again you have the opportunity to question the legality with Bluff 10 (with no effect). If you decline Kua's offer, he and his guards will attack you.\n* On your way out, Master Kua will remind you to pick up your slave. You can either have him join your crew as a slave, or free him. You can then offer him a job on your ship or suggest that he head to the Temple of Berath in Neketaka.\n* Otherwise this will start [Tip of the Spear](/tipOfTheSpear/), a sub-quest involving taking out the leaders of the Wahaki tribe on [Ori o Koīki](/oriOKoiki/). See the associated page for more information.\n* Once the quest is complete, return to Kua (for some experience and a pat on the back).\n* Return to [Captain Furrante](/captainFurrante/) to complete the quest, netting you the unique crossbow [Fleetbreaker](/fleetbreaker/), {{cp2|2500}}, and Major Positive reputation with the Príncipi.\n\n## =Against Crookspur\n\n=\n* This option involves taking a stand against the slavers and optionally removing them from the island. Note that after freeing the slaves, or upon putting the fort on alert, you will no longer be able to assist the slavers, as this will fail [Tip of the Spear](/tipOfTheSpear/) - see [notes](/notes/) below. This method will cause the bad outcome for Furrante's side of this quest, but the good outcome for Aeldys' side.\n\n'''Free the slaves'''<br/>\n* Freeing the slaves is the goal of [Captain Aeldys](/captainAeldys/)' side of the quest, and you are able to do so independently of wiping out Crookspur. Wiping out the slavers will not net you any more of a reward from Aeldys. However, as mentioned above, you won't be left with other options with the slavers after freeing the slaves.\n* You can talk to Aeldys' agent [Seafol](/seafol/), on the beach at Crookspur to get more information about this route. She has a skiff ready and waiting for any slaves you send out.\n* Firstly, enter the sea cave via the entrance on the beach to the east, swimming down the lighter tunnel to get to the [Sea Cave](/seaCaveCrookspur/). Here you'll have to deal with a few spiders, but nothing too difficult - you can easily sneak past too. The tunnel to the south leads to a barred gate, that you can open using either a [prybar](/prybar/), high Might, a Corrode ability, an orlan in the party to reach through the bars, or a Wizard with the spell [Form of the Helpless Beast](/formOfTheHelplessBeast/), turning one of your party members into a piglet to open the way.\n* The fort dungeons themselves are swarming with ogres and slavers, with exits to the fort exterior to the north east, and the interior to the north west.\n** The slaves that you need to free are held in a cage to the east. You can open it with Mechanics 11, or by retrieving the [Large Iron Key](/largeIronKey/) from [Taskmaster Grom](/taskmasterGrom/) to the north. Freeing these slaves is the minimum required to complete this quest. Although the slaves are concerned about the safety of their escape, you do not need to clear the spiders from the caverns, the slavers from the dungeons, or even unlock the barred gate in order for them to escape. Hilariously, they'll run the wrong way anyway, but will make it out without issue. Further along the corridor you can loot a [Blackwood Log](/blackwoodLog/).\n** The Wahaki slaves are held in the southwest side of the area, you can free them with Mechanics 12, or with the same key as above, looted form Taskmaster Grom. Freeing them isn't necessarily required for this quest, but they can be used to assault the fort.\n* Once you've freed the slaves, continue with wiping out Crookspur or return to Aeldys.\n\n'''Wiping out Crookspur'''<br/>\n* Wiping out the Crookspur slavers is the goal of the quests [Clearing Out Crookspur](/clearingOutCrookspur/), [Fruitful Alliance](/fruitfulAlliance/) and [Cruel Cargo](/cruelCargo/), so make sure to pick those up first.\n* The most straightforward method is invading the fortress under the pretense of participating in the auction (purchasing [Handsome Eliam](/handsomeEliam/) in the process) and then killing Master Kua once you're granted an audience with him. See the above for information regarding this route.\n* Alternatively you can liberate the Wahaki slaves led by [Bauha](/bauha/). Open the cage using Mechanics 12, or after you've acquired the key from Taskmaster Grom. You can continue to assault the fort with the tribesman, or convince them to escape with Intimidate 10 or Survival 8, rather than try and fight the slavers (though this just means you will have to take them out yourself).\n* If you incited a revolt with the Wahaki slaves, this will clear some of the slavers in the dungeons and the fort, making your job a bit easier. Doing so will also free the slaves for Aeldys' side of the quest if you haven't already done so. The warriors will exit out the way of the ladder to the north east, then out the front of the fort, leaving the corpses of slavers in their wake.\n\n{{Ambox|type=Cannot replicate|info=The section below needs verification. While there are dialog entries supporting it as a possible option, Master Kua will be unfazed by any evidence against him, and releasing the slaves will always result in the fort becoming hostile. This may have been removed in a patch to the quest.|border=yellow}}\n'''Alternate - Confront Kua with evidence of illegal slaving'''<br/>\n* This is the most peaceful solution to the problem of the slavers, and involves evicting Master Kua by confronting him with evidence of the illegal trafficking of Deadfire citizens.\n* Note that this cannot be accomplished after freeing either of the slaves, and putting the fort on alert. Nor can it be done after killing the Wahaki tribe leaders, as the slaves will no longer be present.\n* Firstly, head down to the dungeons by the way of the [sea cave](/seaCaveCrookspur/) (see above for more information). The slavers are keeping a group of Wahaki tribesman in the cage to the southwest. All you need to do is talk to [Bauha](/bauha/) to get the evidence you need. Do NOT free the slaves yet, but instead back out of the dungeon and make your way into the fort via the front entrance under the pretense of participating in the auction (see above).\n* Once you've been granted an audience with Master Kua, you can then confront him and suggest that he flee the island before word of his misdeeds spreads. You can do this by selecting the \"Does he know you're trading illegally\" dialogue option, then tell him that you've spoke with the Wahaki slaves locked in the dungeon. This requires Streetwise 5.\n\n###### Return to Aeldys\n\n* Once you have either freed the slaves and/or wiped out the slavers, return to [Captain Aeldys](/captainAeldys/) to complete the quest, netting you the unique hood [Blackblade's Hood](/blackbladesHood/), {{cp2|2500}}, and Major Positive reputation with the Príncipi. If you also return to Furrante, he will be displeased that you failed to uphold his business arrangement.\n\n## Notes\n\n* Note that you cannot do both sides of this quest, and will have to choose between the either siding with Furrante and the slavers and wipe out the Wahaki, or side with Aeldys and save the slaves / clear out Crookspur. There may be some crossover where the player would be able to do quests on both sides, but typically doing so will result in more bad outcomes than good.\n* Wiping out Crookspur is technically optional for Aeldys' side of the quest, but rescuing the captive slaves - be it peacefully or violently - will cause Crookspur to become hostile, eliminating any opportunity to further assist the slavers and the extended quests.\n* If you kill the Wahaki tribe leaders for the slavers, this will cause [Cruel Cargo](/cruelCargo/) to fail (if you already picked it up), and will result in a bad outcome for [Fruitful Alliance](/fruitfulAlliance/). After this you will be unable to do Aeldys' side of the quest, since the slaves will have been moved by the time you return to Crookspur. This happens immediately upon killing the Wahaki tribe leaders, regardless of what quests you have or haven't picked up.\n** Killing the slavers at this (or any) point will cause a bad outcome for Furrante's side (even if you do it after killing the Wahaki and completing [Tip of the Spear](/tipOfTheSpear/)). If you do so and return to Aeldys, she will be displeased that you failed to save the slaves, but will appreciate that their operation is no longer standing. If you do so and return to Furrante, he will be upset that you failed to uphold his business arrangement. This is the worst possible outcome for the quest.\n* If you kill the slavers for the Wahaki tribe, or free the slaves for Aeldys, this will cause [Tip of the Spear](/tipOfTheSpear/) to fail. In addition this will result in a bad outcome for Furrante's side of the quest and [Of Like Minds](/ofLikeMinds/) - though neither of which will lose you reputation, only the associated quest rewards.\n** Killing the Wahaki tribe leaders has no bearing on the outcome of this side of the quest.\n* [Clearing Out Crookspur](/clearingOutCrookspur/) will be failed if you return to Atsura after completing [Tip of the Spear](/tipOfTheSpear/), but will not fail if you have killed Master Kua. In this sense it is technically separate to the Crookspur quest chain. This way, you can wipe out the Wahaki, return to Kua to complete [Tip of the Spear](/tipOfTheSpear/), return to Furrante to complete [A Shrewd Proposition](/aShrewdProposition/), return to Castol to complete [Of Like Minds](/ofLikeMinds/), then kill Master Kua and the slavers, then return to Atsura to complete [Clearing Out Crookspur](/clearingOutCrookspur/).\n\n## Outcomes\n\nThese tables cover the two main paths \"Anti-Crookspur\" (kill the slavers + aid the Wahaki + free the slaves) and \"Pro-Crookspur\" (aid the slavers + kill the Wahaki). It does not cover potential edge cases or mixing of the two paths, since most of the time attempting to do one side of the quest will cause the other side to fail or get a bad outcome. Workarounds or alternate paths should be mentioned in the notes section above.\n\n{| class = \"wikitable\"\n! Quest\n! Faction\n! <small>Pro-Crookspur</small>\n! <small>Anti-Crookspur</small>\n! Details\n\n|-\n| Furrante outcome for [A Shrewd Proposition](/aShrewdProposition/)\n| Principi quest\n| {{yes}} || {{no}}\n| Assist the Slavers with [Tip of the Spear](/tipOfTheSpear/) and return to Furrante (Master Kua still alive)\n|-\n| [Of Like Minds](/ofLikeMinds/)\n| VTC quest\n| {{yes}} || {{no}}\n| Assist the Principi, aiding Furrante (non-critical)\n|-\n| [Tip of the Spear](/tipOfTheSpear/)\n| Pro-Crookspur sub-quest \n| {{check}} || {{cross}}\n| Wipe out the Wahaki tribe for Crookspur\n|-\n| Aeldys outcome for [A Shrewd Proposition](/aShrewdProposition/)\n| Principi quest\n| {{no}} || {{yes}}\n| Free the captive slaves and return to Aeldys\n|-\n| [Fruitful Alliance](/fruitfulAlliance/)\n| Huana quest\n| {{no}} || {{yes}}\n| Recruit the Wahaki tribe for the Huana, requires completing [Cruel Cargo](/cruelCargo/)\n|-\n| [Cruel Cargo](/cruelCargo/)\n| Pro-Wahaki sub-quest\n| {{cross}} || {{check}}\n| Wipe out Crookspur for the Wahaki tribe\n|-\n| [Clearing Out Crookspur](/clearingOutCrookspur/)\n| RDC quest\n| {{cross}} || {{check}}\n| Wipe out Crookspur, kill Master Kua\n|}\n:{{yes}} = Good outcome, {{no}} = Bad outcome, {{check}} = Complete quest, {{cross}} = Fail quest\n\n###### Rewards table\n\n{| class=\"wikitable\"\n! style=\"width:20%\" | Quest\n! style=\"width:40%\" | Wipe out the Wahaki<br/>(Assist the slavers)\n! style=\"width:40%\" | Wipe out the Crookspur slavers<br/>(Assist the Wahaki)\n\n|-\n| [A Shrewd Proposition](/aShrewdProposition/)\n| style=\"background-color:#00FF0020\" |\n* [Fleetbreaker](/fleetbreaker/) (from [Furrante](/captainFurrante/))\n* {{cp2|2500}}\n* Major Positive reputation with the [Príncipi](/principi/)\n| style=\"background-color:#00FF0020\" |\n* [Blackblade's Hood](/blackbladesHood/) (from [Aeldys](/captainAeldys/))\n* {{cp2|2500}}\n* Major Positive reputation with the [Príncipi](/principi/)\n\n|-\n| [Of Like Minds](/ofLikeMinds/)\n| style=\"background-color:#00FF0020\" |\n* Moderate Positive reputation with the VTC\n| style=\"background-color:#FF000020\" |\n* Minor Positive reputation with the VTC\n\n|-\n| [Tip of the Spear](/tipOfTheSpear/)\n| style=\"background-color:#00FF0020\" |\n* [Kahua Hozi](/kahuaHozi/) (looted from [Ruāsare](/ruasare/))\n| style=\"background-color:#FF000020\" |\n* Quest fail\n\n|-\n| [Fruitful Alliance](/fruitfulAlliance/)\n| style=\"background-color:#FF000020\" |\n* {{cp2|2000}}\n* Moderate Negative reputation with the [Huana](/huana/)\n| style=\"background-color:#00FF0020\" |\n* {{cp2|2500}}\n* Major Positive reputation with the [Huana](/huana/)\n\n|-\n| [Cruel Cargo](/cruelCargo/)\n| style=\"background-color:#FF000020\" |\n* Quest fail\n| style=\"background-color:#00FF0020\" |\n* Wahaki's allegiance to the queen\n\n|-\n| [Clearing Out Crookspur](/clearingOutCrookspur/)\n| style=\"background-color:#FF000020\" |\n* Quest fail\n* Major Negative reputation with the [RDC](/royalDeadfireCompany/)\n* Cannot side with the [Royal Deadfire Company](/royalDeadfireCompany/) during [The Coming Storm](/theComingStorm/) / [The Final Maneuver](/theFinalManeuver/).\n| style=\"background-color:#00FF0020\" |\n* {{cp2|1200}}\n* Major Positive reputation with the [RDC](/royalDeadfireCompany/)\n|}\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/XX_Principi_Faction_Questline/FCT_QST_Principi_Slavers.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''A Shrewd Proposition'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Captain Furrante</b> has a wealthy contact who has business dealings with the slavers of <b>Crookspur</b>. However, recent troubles with the locals have affected their trade routes.\n\nThis contact is willing to owe Furrante a political favor for assisting the slavers. However, as slaving is a crime within the Príncipi, Furrante has asked me to discretely smooth this problem in his stead.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| <b>Captain Furrante</b> was hired by <b>Director Castol</b> to take care of the problem facing Castol's business interests at <b>Crookspur</b>. When I spoke with Furrante at <b>Dunnage</b>, he offered me the job in exchange for further reward from the Príncipi.\n|-\n| rowspan=\"9\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Deal with the slavers of <b>Crookspur</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| I've docked at Crookspur's slaver port to begin assessing its situation. Something tells me that this place holds more than it shows.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| Master Kua's ships are being assaulted by the <b>Wahaki</b>, which is beginning to affect his business. He has asked me to travel to <b>Ori o Koīki</b> and kill the tribe's <b>leaders</b>.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| Auctioneer Marcca has allowed me to enter the fort at <b>Crookspur</b> to meet with the <b>master</b>.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| The <b>ogre taskmaster</b> in the <b>dungeon</b> of Crookspur holds the keys to the slaves' cells.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| I've found a group of <b>Wahaki slaves</b> in the dungeon under <b>Crookspur's</b> fort. They seem eager to revolt against the slavers.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| It looks like there's a way in and out of the <b>slaver fort</b> in its <b>lowest levels</b>, an <b>underwater tunnel</b> into the sea.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| According to <b>Seafol</b>, the slavers of <b>Crookspur</b> are breaking the law by trading natives of the Deadfire.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| A spy of <b>Aeldys'</b>, <b>Seafol</b>, wants me to disrupt the slaver operations at <b>Crookspur</b> by any means necessary.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''15'''\n| colspan=\"2\" | '''Speak with <b>Captain Aeldys</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10015\n| I've dealt a blow to the Crookspur slave operation, as <b>Aeldys</b> asked. It's time to meet her at <b>Fort Deadlight</b> to deliver the news.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| Headmaster Kua won't pose a threat to the people of the Deadfire anymore but his <b>captives</b> remain locked in <b>Crookspur's dungeons</b>.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| The slave cells of Crookspur are empty. It appears that the captives have already been sold - or worse.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''21'''\n| colspan=\"2\" | '''Return to <b>Captain Furrante</b> in <b>Dunnage</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10021\n| <b>Furrante</b> will want to know that I've solved the slavers' problems at Crookspur. Their business can resume shortly which will please his influential contact.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''22'''\n| colspan=\"2\" | '''Sail to the slaver port in <b>Crookspur</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10022\n| Furrante has asked me to travel to <b>Crookspur</b> and speak with <b>Master Kua</b>, the leader of a group of slavers that operate in the island.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| <b>Aeldys</b> has a contact in the island of <b>Crookspur</b>.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| <b>Aeldys</b> has sent a letter asking me to meet her at <b>Fort Deadlight</b>.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''23'''\n| colspan=\"2\" | '''Speak with <b>Captain Aeldys</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10023\n| I dealt with the slavers at Crookspur, against the interests of Furrante. Perhaps <b>Aeldys</b> will take pleasure in this reversal. I should see her at <b>Fort Deadlight</b>.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| Headmaster Kua won't pose a threat to the people of the Deadfire anymore but his <b>captives</b> remain locked in <b>Crookspur's dungeons</b>.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| The slave cells of Crookspur are empty. It appears that the captives have already been sold - or worse.\n\n|-\n! colspan=\"3\" | Unused strings\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''-'''\n| style=\"vertical-align:text-top\" | 20000\n| I convinced the <b>Wahaki slaves</b> to flee <b>Crookspur</b>.\n|-\n| style=\"vertical-align:text-top\" | 40002\n| A Príncipi spy has informed me that <b>Crookspur</b> may be trafficking illegal slaves. Her captain would greatly reward me for freeing them.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30000\n| You killed someone critical to this quest.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30001\n| I freed the slaves being held on the island, and turned over the slavers' ship to them. \n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I freed the slaves being held on the island, and turned over the slavers' ship to them. I convinced them to seek out Captain Aeldys at Fort Deadlight to join the Príncipi.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| I helped the slavers with their Wahaki problem. As their business is free to resume schedule, Captain Furrante will be pleased.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30004\n| I helped the slavers with their Wahaki problem. As their business is free to resume schedule, Director Castol will be pleased.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30005\n| I helped the slavers with their Wahaki problem, and was handsomely compensated by Master Kua.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30006\n| I disrupted the slaver operation at Crookspur by dealing with their leader, Master Kua.\n|}",
  "raw": "{{Infobox quest poe2\n| name         = A Shrewd Proposition\n| image        = PE2 Crookspur.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Faction quest\n| quest_region = Deadfire - Northwest\n| quest_level  = 12\n| faction      = Príncipi sen Patrena\n| locations    = Dunnage;Fort Deadlight;Crookspur;Ori o Koīki\n| main_npcs    = Captain Furrante;Captain Aeldys;Seafol;Auctioneer Marcca;Handsome Eliam;Master Kua;Taskmaster Grom;Bauha\n| companion    = Serafen\n| quest_giver  = Captain Furrante\n| xp_amount    = 2500\n| xp_type      = Normal\n| xp_level     = 12\n| xp_weights   = 1;1;1;1;1\n| rewardname1  = Aid Furrante and the slavers (wipe out the Wahaki tribe)\n| reward1      = [[Fleetbreaker]];{{cp2|2500}};Major Positive reputation with the Príncipi;See [[#Outcomes|Outcomes]] below\n| rewardname2  = Aid Aeldys and free the slaves\n| reward2      = [[Blackblade's Hood]];{{cp2|2500}};Major Positive reputation with the Príncipi;See [[#Outcomes|Outcomes]] below\n| rewardname3  = \n| reward3      = \n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = Symbols of Death\n| conc         = Cruel Cargo;Clearing Out Crookspur;Of Like Minds;Tip of the Spear;\n| internalname = FCT_QST_Principi_Slavers\n| guid         = ca999a50-e900-4968-a695-f30c8df8599b\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests#Faction quests|faction quest]] in {{poe2}}.\n\n==Synopsis== \nCaptain Furrante has a wealthy contact who has business dealings with the slavers of [[Crookspur]]. However, recent troubles with the locals have affected their trade routes.\n\nThis contact is willing to owe Furrante a political favor for assisting the slavers. However, as slaving is a crime within the Príncipi, Furrante has asked the Watcher to discreetly smooth this problem in his stead.\n\n==Walkthrough==\n* Furrante will ask you to travel to [[Crookspur]] and meet [[Master Kua]], the leader of the slavers. As you leave Dunnage, you will receive an alternate missive from Aeldys, asking you to come meet her. She, in turn, wants you to destroy the slaver operation.\n* After leaving Dunnage, you will recieve a [[Wine-and-Blood-Splattered Letter|letter]] from  [[Captain Aeldys]] asking you to meet with her at [[Fort Deadlight]]. You can inform her of Furrante's little side-gig. She knew as much, but if you also figure out that he's working with the VTC (by way of [[Director Castol]]), you can inform her of that and get 2500 cp. Bringing her the [[Candied Nuts]] she asked for will net you Minor Positive Reputation gained with Principi sen Patrena.\n* Ultimately, this quest has two separate paths that you can take, the outcomes of which will influence the other concurrent quests. You can either choose to oblige the Crookspur slavers, and wipe out the Wahiki tribe, or you can bring a stop to their operation. Make sure to bring along [[Serafen]] for some unique dialog.\n\n===For Crookspur===\n* This option is the goal of [[Captain Furrante]]'s side of the quest, and the VTC quest [[Of Like Minds]]. It starts [[Tip of the Spear]].\n{{Note|Completing Tip of the Spear will cause you to fail the RDC quest [[Clearing Out Crookspur]] upon returning to [[Atsura]] in the [[Imperial Command]] (though not if you have killed Kua, see [[#Notes|notes]] below). This means you will no longer be able to ally with the [[Royal Deadfire Company]] later during [[The Coming Storm]]!}}\n* Head to [[Crookspur]], to the far north-west of [[Neketaka]].\n* Enter the fortress by speaking to the ogre at the gate, he'll think you're just another buyer here for the slave auction, and will let you straight in. The auction will be coming to a close, with the last slave, [[Handsome Eliam]] - a death godlike, up for offer. You can either bid for the slave, continue to spectate the auction, or - by passing a skill check below - question the legality of his sale. This will have you ejected from the fort, putting it on high alert (not recommended if you want to assist the slavers):\n** With Streetwise 10, you can point out their need for so much firepower if what they're doing is perfectly legal.\n** With Bluff 10, you can say that their operation is under investigation by the crowned royals of Neketaka.\n* If you don't make a scene [[Auctioneer Marcca]] will grant you an audience with [[Master Kua]]. Enter the fort to the north west and speak to him in his office. Kua will commend your \"refined tastes\" in purchasing their most valuable offering, and will ask that you pay what is owed. You can pay him (if you want to waste your money) or offer your services in exchange. He will discuss his prior agreement with Furrante, and ask that you eliminate the leaders of the Wahaki tribe, who have recently been commanding attacks on the slavers' ships. You can agree to take care of it, and again you have the opportunity to question the legality with Bluff 10 (with no effect). If you decline Kua's offer, he and his guards will attack you.\n* On your way out, Master Kua will remind you to pick up your slave. You can either have him join your crew as a slave, or free him. You can then offer him a job on your ship or suggest that he head to the Temple of Berath in Neketaka.\n* Otherwise this will start [[Tip of the Spear]], a sub-quest involving taking out the leaders of the Wahaki tribe on [[Ori o Koīki]]. See the associated page for more information.\n* Once the quest is complete, return to Kua (for some experience and a pat on the back).\n* Return to [[Captain Furrante]] to complete the quest, netting you the unique crossbow [[Fleetbreaker]], {{cp2|2500}}, and Major Positive reputation with the Príncipi.\n\n===Against Crookspur===\n* This option involves taking a stand against the slavers and optionally removing them from the island. Note that after freeing the slaves, or upon putting the fort on alert, you will no longer be able to assist the slavers, as this will fail [[Tip of the Spear]] - see [[#notes|notes]] below. This method will cause the bad outcome for Furrante's side of this quest, but the good outcome for Aeldys' side.\n\n'''Free the slaves'''<br/>\n* Freeing the slaves is the goal of [[Captain Aeldys]]' side of the quest, and you are able to do so independently of wiping out Crookspur. Wiping out the slavers will not net you any more of a reward from Aeldys. However, as mentioned above, you won't be left with other options with the slavers after freeing the slaves.\n* You can talk to Aeldys' agent [[Seafol]], on the beach at Crookspur to get more information about this route. She has a skiff ready and waiting for any slaves you send out.\n* Firstly, enter the sea cave via the entrance on the beach to the east, swimming down the lighter tunnel to get to the [[Sea Cave (Crookspur)|Sea Cave]]. Here you'll have to deal with a few spiders, but nothing too difficult - you can easily sneak past too. The tunnel to the south leads to a barred gate, that you can open using either a [[prybar]], high Might, a Corrode ability, an orlan in the party to reach through the bars, or a Wizard with the spell [[Form of the Helpless Beast]], turning one of your party members into a piglet to open the way.\n* The fort dungeons themselves are swarming with ogres and slavers, with exits to the fort exterior to the north east, and the interior to the north west.\n** The slaves that you need to free are held in a cage to the east. You can open it with Mechanics 11, or by retrieving the [[Large Iron Key]] from [[Taskmaster Grom]] to the north. Freeing these slaves is the minimum required to complete this quest. Although the slaves are concerned about the safety of their escape, you do not need to clear the spiders from the caverns, the slavers from the dungeons, or even unlock the barred gate in order for them to escape. Hilariously, they'll run the wrong way anyway, but will make it out without issue. Further along the corridor you can loot a [[Blackwood Log]].\n** The Wahaki slaves are held in the southwest side of the area, you can free them with Mechanics 12, or with the same key as above, looted form Taskmaster Grom. Freeing them isn't necessarily required for this quest, but they can be used to assault the fort.\n* Once you've freed the slaves, continue with wiping out Crookspur or return to Aeldys.\n\n'''Wiping out Crookspur'''<br/>\n* Wiping out the Crookspur slavers is the goal of the quests [[Clearing Out Crookspur]], [[Fruitful Alliance]] and [[Cruel Cargo]], so make sure to pick those up first.\n* The most straightforward method is invading the fortress under the pretense of participating in the auction (purchasing [[Handsome Eliam]] in the process) and then killing Master Kua once you're granted an audience with him. See the above for information regarding this route.\n* Alternatively you can liberate the Wahaki slaves led by [[Bauha]]. Open the cage using Mechanics 12, or after you've acquired the key from Taskmaster Grom. You can continue to assault the fort with the tribesman, or convince them to escape with Intimidate 10 or Survival 8, rather than try and fight the slavers (though this just means you will have to take them out yourself).\n* If you incited a revolt with the Wahaki slaves, this will clear some of the slavers in the dungeons and the fort, making your job a bit easier. Doing so will also free the slaves for Aeldys' side of the quest if you haven't already done so. The warriors will exit out the way of the ladder to the north east, then out the front of the fort, leaving the corpses of slavers in their wake.\n\n\n{{Ambox|type=Cannot replicate|info=The section below needs verification. While there are dialog entries supporting it as a possible option, Master Kua will be unfazed by any evidence against him, and releasing the slaves will always result in the fort becoming hostile. This may have been removed in a patch to the quest.|border=yellow}}\n'''Alternate - Confront Kua with evidence of illegal slaving'''<br/>\n* This is the most peaceful solution to the problem of the slavers, and involves evicting Master Kua by confronting him with evidence of the illegal trafficking of Deadfire citizens.\n* Note that this cannot be accomplished after freeing either of the slaves, and putting the fort on alert. Nor can it be done after killing the Wahaki tribe leaders, as the slaves will no longer be present.\n* Firstly, head down to the dungeons by the way of the [[Sea Cave (Crookspur)|sea cave]] (see above for more information). The slavers are keeping a group of Wahaki tribesman in the cage to the southwest. All you need to do is talk to [[Bauha]] to get the evidence you need. Do NOT free the slaves yet, but instead back out of the dungeon and make your way into the fort via the front entrance under the pretense of participating in the auction (see above).\n* Once you've been granted an audience with Master Kua, you can then confront him and suggest that he flee the island before word of his misdeeds spreads. You can do this by selecting the \"Does he know you're trading illegally\" dialogue option, then tell him that you've spoke with the Wahaki slaves locked in the dungeon. This requires Streetwise 5.\n\n;Return to Aeldys\n* Once you have either freed the slaves and/or wiped out the slavers, return to [[Captain Aeldys]] to complete the quest, netting you the unique hood [[Blackblade's Hood]], {{cp2|2500}}, and Major Positive reputation with the Príncipi. If you also return to Furrante, he will be displeased that you failed to uphold his business arrangement.\n\n==Notes==\n* Note that you cannot do both sides of this quest, and will have to choose between the either siding with Furrante and the slavers and wipe out the Wahaki, or side with Aeldys and save the slaves / clear out Crookspur. There may be some crossover where the player would be able to do quests on both sides, but typically doing so will result in more bad outcomes than good.\n* Wiping out Crookspur is technically optional for Aeldys' side of the quest, but rescuing the captive slaves - be it peacefully or violently - will cause Crookspur to become hostile, eliminating any opportunity to further assist the slavers and the extended quests.\n* If you kill the Wahaki tribe leaders for the slavers, this will cause [[Cruel Cargo]] to fail (if you already picked it up), and will result in a bad outcome for [[Fruitful Alliance]]. After this you will be unable to do Aeldys' side of the quest, since the slaves will have been moved by the time you return to Crookspur. This happens immediately upon killing the Wahaki tribe leaders, regardless of what quests you have or haven't picked up.\n** Killing the slavers at this (or any) point will cause a bad outcome for Furrante's side (even if you do it after killing the Wahaki and completing [[Tip of the Spear]]). If you do so and return to Aeldys, she will be displeased that you failed to save the slaves, but will appreciate that their operation is no longer standing. If you do so and return to Furrante, he will be upset that you failed to uphold his business arrangement. This is the worst possible outcome for the quest.\n* If you kill the slavers for the Wahaki tribe, or free the slaves for Aeldys, this will cause [[Tip of the Spear]] to fail. In addition this will result in a bad outcome for Furrante's side of the quest and [[Of Like Minds]] - though neither of which will lose you reputation, only the associated quest rewards.\n** Killing the Wahaki tribe leaders has no bearing on the outcome of this side of the quest.\n* [[Clearing Out Crookspur]] will be failed if you return to Atsura after completing [[Tip of the Spear]], but will not fail if you have killed Master Kua. In this sense it is technically separate to the Crookspur quest chain. This way, you can wipe out the Wahaki, return to Kua to complete [[Tip of the Spear]], return to Furrante to complete [[A Shrewd Proposition]], return to Castol to complete [[Of Like Minds]], then kill Master Kua and the slavers, then return to Atsura to complete [[Clearing Out Crookspur]].\n\n==Outcomes==\nThese tables cover the two main paths \"Anti-Crookspur\" (kill the slavers + aid the Wahaki + free the slaves) and \"Pro-Crookspur\" (aid the slavers + kill the Wahaki). It does not cover potential edge cases or mixing of the two paths, since most of the time attempting to do one side of the quest will cause the other side to fail or get a bad outcome. Workarounds or alternate paths should be mentioned in the notes section above.\n\n{| class = \"wikitable\"\n! Quest\n! Faction\n! <small>Pro-Crookspur</small>\n! <small>Anti-Crookspur</small>\n! Details\n\n|-\n| Furrante outcome for [[A Shrewd Proposition]]\n| Principi quest\n| {{yes}} || {{no}}\n| Assist the Slavers with [[Tip of the Spear]] and return to Furrante (Master Kua still alive)\n|-\n| [[Of Like Minds]]\n| VTC quest\n| {{yes}} || {{no}}\n| Assist the Principi, aiding Furrante (non-critical)\n|-\n| [[Tip of the Spear]]\n| Pro-Crookspur sub-quest \n| {{check}} || {{cross}}\n| Wipe out the Wahaki tribe for Crookspur\n|-\n| Aeldys outcome for [[A Shrewd Proposition]]\n| Principi quest\n| {{no}} || {{yes}}\n| Free the captive slaves and return to Aeldys\n|-\n| [[Fruitful Alliance]]\n| Huana quest\n| {{no}} || {{yes}}\n| Recruit the Wahaki tribe for the Huana, requires completing [[Cruel Cargo]]\n|-\n| [[Cruel Cargo]]\n| Pro-Wahaki sub-quest\n| {{cross}} || {{check}}\n| Wipe out Crookspur for the Wahaki tribe\n|-\n| [[Clearing Out Crookspur]]\n| RDC quest\n| {{cross}} || {{check}}\n| Wipe out Crookspur, kill Master Kua\n|}\n:{{yes}} = Good outcome, {{no}} = Bad outcome, {{check}} = Complete quest, {{cross}} = Fail quest\n\n;Rewards table\n{| class=\"wikitable\"\n! style=\"width:20%\" | Quest\n! style=\"width:40%\" | Wipe out the Wahaki<br/>(Assist the slavers)\n! style=\"width:40%\" | Wipe out the Crookspur slavers<br/>(Assist the Wahaki)\n\n|-\n| [[A Shrewd Proposition]]\n| style=\"background-color:#00FF0020\" |\n* [[Fleetbreaker]] (from [[Captain Furrante|Furrante]])\n* {{cp2|2500}}\n* Major Positive reputation with the [[Príncipi]]\n| style=\"background-color:#00FF0020\" |\n* [[Blackblade's Hood]] (from [[Captain Aeldys|Aeldys]])\n* {{cp2|2500}}\n* Major Positive reputation with the [[Príncipi]]\n\n|-\n| [[Of Like Minds]]\n| style=\"background-color:#00FF0020\" |\n* Moderate Positive reputation with the VTC\n| style=\"background-color:#FF000020\" |\n* Minor Positive reputation with the VTC\n\n|-\n| [[Tip of the Spear]]\n| style=\"background-color:#00FF0020\" |\n* [[Kahua Hozi]] (looted from [[Ruāsare]])\n| style=\"background-color:#FF000020\" |\n* Quest fail\n\n|-\n| [[Fruitful Alliance]]\n| style=\"background-color:#FF000020\" |\n* {{cp2|2000}}\n* Moderate Negative reputation with the [[Huana]]\n| style=\"background-color:#00FF0020\" |\n* {{cp2|2500}}\n* Major Positive reputation with the [[Huana]]\n\n|-\n| [[Cruel Cargo]]\n| style=\"background-color:#FF000020\" |\n* Quest fail\n| style=\"background-color:#00FF0020\" |\n* Wahaki's allegiance to the queen\n\n|-\n| [[Clearing Out Crookspur]]\n| style=\"background-color:#FF000020\" |\n* Quest fail\n* Major Negative reputation with the [[Royal Deadfire Company|RDC]]\n* Cannot side with the [[Royal Deadfire Company]] during [[The Coming Storm]] / [[The Final Maneuver]].\n| style=\"background-color:#00FF0020\" |\n* {{cp2|1200}}\n* Major Positive reputation with the [[Royal Deadfire Company|RDC]]\n|}\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/XX_Principi_Faction_Questline/FCT_QST_Principi_Slavers.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''A Shrewd Proposition'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Captain Furrante</b> has a wealthy contact who has business dealings with the slavers of <b>Crookspur</b>. However, recent troubles with the locals have affected their trade routes.\n\nThis contact is willing to owe Furrante a political favor for assisting the slavers. However, as slaving is a crime within the Príncipi, Furrante has asked me to discretely smooth this problem in his stead.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| <b>Captain Furrante</b> was hired by <b>Director Castol</b> to take care of the problem facing Castol's business interests at <b>Crookspur</b>. When I spoke with Furrante at <b>Dunnage</b>, he offered me the job in exchange for further reward from the Príncipi.\n|-\n| rowspan=\"9\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Deal with the slavers of <b>Crookspur</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| I've docked at Crookspur's slaver port to begin assessing its situation. Something tells me that this place holds more than it shows.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| Master Kua's ships are being assaulted by the <b>Wahaki</b>, which is beginning to affect his business. He has asked me to travel to <b>Ori o Koīki</b> and kill the tribe's <b>leaders</b>.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| Auctioneer Marcca has allowed me to enter the fort at <b>Crookspur</b> to meet with the <b>master</b>.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| The <b>ogre taskmaster</b> in the <b>dungeon</b> of Crookspur holds the keys to the slaves' cells.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| I've found a group of <b>Wahaki slaves</b> in the dungeon under <b>Crookspur's</b> fort. They seem eager to revolt against the slavers.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| It looks like there's a way in and out of the <b>slaver fort</b> in its <b>lowest levels</b>, an <b>underwater tunnel</b> into the sea.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| According to <b>Seafol</b>, the slavers of <b>Crookspur</b> are breaking the law by trading natives of the Deadfire.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| A spy of <b>Aeldys'</b>, <b>Seafol</b>, wants me to disrupt the slaver operations at <b>Crookspur</b> by any means necessary.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''15'''\n| colspan=\"2\" | '''Speak with <b>Captain Aeldys</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10015\n| I've dealt a blow to the Crookspur slave operation, as <b>Aeldys</b> asked. It's time to meet her at <b>Fort Deadlight</b> to deliver the news.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| Headmaster Kua won't pose a threat to the people of the Deadfire anymore but his <b>captives</b> remain locked in <b>Crookspur's dungeons</b>.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| The slave cells of Crookspur are empty. It appears that the captives have already been sold - or worse.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''21'''\n| colspan=\"2\" | '''Return to <b>Captain Furrante</b> in <b>Dunnage</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10021\n| <b>Furrante</b> will want to know that I've solved the slavers' problems at Crookspur. Their business can resume shortly which will please his influential contact.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''22'''\n| colspan=\"2\" | '''Sail to the slaver port in <b>Crookspur</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10022\n| Furrante has asked me to travel to <b>Crookspur</b> and speak with <b>Master Kua</b>, the leader of a group of slavers that operate in the island.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| <b>Aeldys</b> has a contact in the island of <b>Crookspur</b>.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| <b>Aeldys</b> has sent a letter asking me to meet her at <b>Fort Deadlight</b>.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''23'''\n| colspan=\"2\" | '''Speak with <b>Captain Aeldys</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10023\n| I dealt with the slavers at Crookspur, against the interests of Furrante. Perhaps <b>Aeldys</b> will take pleasure in this reversal. I should see her at <b>Fort Deadlight</b>.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| Headmaster Kua won't pose a threat to the people of the Deadfire anymore but his <b>captives</b> remain locked in <b>Crookspur's dungeons</b>.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| The slave cells of Crookspur are empty. It appears that the captives have already been sold - or worse.\n\n|-\n! colspan=\"3\" | Unused strings\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''-'''\n| style=\"vertical-align:text-top\" | 20000\n| I convinced the <b>Wahaki slaves</b> to flee <b>Crookspur</b>.\n|-\n| style=\"vertical-align:text-top\" | 40002\n| A Príncipi spy has informed me that <b>Crookspur</b> may be trafficking illegal slaves. Her captain would greatly reward me for freeing them.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30000\n| You killed someone critical to this quest.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30001\n| I freed the slaves being held on the island, and turned over the slavers' ship to them. \n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I freed the slaves being held on the island, and turned over the slavers' ship to them. I convinced them to seek out Captain Aeldys at Fort Deadlight to join the Príncipi.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| I helped the slavers with their Wahaki problem. As their business is free to resume schedule, Captain Furrante will be pleased.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30004\n| I helped the slavers with their Wahaki problem. As their business is free to resume schedule, Director Castol will be pleased.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30005\n| I helped the slavers with their Wahaki problem, and was handsomely compensated by Master Kua.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30006\n| I disrupted the slaver operation at Crookspur by dealing with their leader, Master Kua.\n|}",
  "slug": "aShrewdProposition",
  "title": "A Shrewd Proposition"
}
