{
  "markdown": "'''{{Pagename nd}}''' is a [letter](/letter/) in {{poe2}}.\n\n## Description\n\n{{Description|{{#var:description}}}}\n\n## Acquisition\n\n{{#arraymap:{{#var:location}}|;|x|x|\\n}}\n\n## Usage\n\n* Can be returned to either [Ranga Ruānu](/rangaRuanu/), [Nairi](/nairi/), or [Vektor](/vektor/) as a follow-up to the quest [The Storms of Poko Kohara](/theStormsOfPokoKohara/) (and for a reward).\n\n## Trivia\n\n* These pages were ripped from the [Poko Kohara Expedition Log](/pokoKoharaExpeditionLog/).\n* When looted from Beza, the description of the item is: ''They look like they were ripped from a book or journal. They're brown and warped with spilled drink and scrawled with a few brief entries.''",
  "raw": "{{Infobox item poe2\n| name           = Beza's Pages\n| icon           = expedition_report_p2_icon.png\n| description    = These pages have been torn out of a larger book. They are stained brown and stiff with some dark, fragrant liquid. The entries begin thus:\n\n\"I wanted so badly to find Poko Kohara, and now we are stuck here. No one dares to leave while the titan roams outside, so we must hope we can find another exit somewhere in the ruins. Olara must have triggered it - it did not move until she began prying open the door, and before we knew it, it had Gian. The others do not say it, but I know they blame me for failing to save him.\"\n\nSmudges of dirt from the author's hand streak the page around the next entry.\n\n\"Olara is gone, too. We move more slowly now, wary of traps and monsters. I detest this creeping about, and Dueno's stomping nearly makes it all pointless. But Falero has almost lost his nerve, and I do not think he can take another nasty surprise.\"\n\nThe next entry is filled with big, crooked letters that loop and swoop like a child's.\n\n\"The other sleep. We decided against candles or campfires, so I write in the glow of the adra. It is good, because I hear something moving in the dark, even if the others do not.\n\nFalero insisted that we move slowly so he could study the murals and the patterns in the floor. He thinks to save us from mishaps like the ones that befell Gian and Olara, but none of that will help if the creatures here catch us. Dueno hides a limp, but the way he looks at Falero and me makes me think he is hiding something else, too.\n\nThey grow more and more paranoid with every hour in this place. When they awaken, we will press forward so that we may be done with it.\n\nIn the meantime, I will keep the pages with my own observations. I cannot trust the others with them.\"\n\nThe next entry is hastily scribbled.\n\n\"Falero lost the logbook and accuses me of sabotage. Sabotage!\n\nHe is so busy sketching these murals that he forgets why we are here. But I saw the adra and I understood - this place is sick. We are here to cure it.\n\nBut Falero says the Huana were here long ago - that the murals prove as much. I think one aumaua looks much like another, but he gave me an idea.\n\nRight now, we spend blood and treasure searching for luminous adra. Our task would be much easier if we could make regular adra luminous by enriching it with live souls. \n\nAs I look at the equipment the Engwithans built here - so like the machines our animancers construct - I wonder if they once did this very thing.\n\nAnd we have the villagers of Tikawara, so eager to help!\n\nWhen we return to Neketaka, I will present my idea to Lueva Alvari. I do not think Director Castol has the stomach for it. Nor my companions, I fear.\"\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Letter\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = no\n| value          = 0\n| range          = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = The Storms of Poko Kohara\n| rel_items      = Poko Kohara Expedition Log\n| rel_abilities  = \n| rel_talents    = \n| internalname   = ITEM_QUEST_Beza_Pages\n| guid           = 82796327-a0ec-4ae3-9599-38ef1f6cdbd9\n| location       = * [[Engwithan Waystation Level Three]]: Looted from [[Beza]]'s body in the southwestern corner.\n}}\n'''{{Pagename nd}}''' is a [[letter]] in {{poe2}}.\n\n==Description==\n{{Description|{{#var:description}}}}\n\n==Acquisition==\n{{#arraymap:{{#var:location}}|;|x|x|\\n}}\n\n==Usage==\n* Can be returned to either [[Ranga Ruānu]], [[Nairi]], or [[Vektor]] as a follow-up to the quest [[The Storms of Poko Kohara]] (and for a reward).\n\n==Trivia==\n* These pages were ripped from the [[Poko Kohara Expedition Log]].\n* When looted from Beza, the description of the item is: ''They look like they were ripped from a book or journal. They're brown and warped with spilled drink and scrawled with a few brief entries.''",
  "slug": "bezasPages",
  "title": "Beza's Pages"
}
