{
  "markdown": "or Major Positive reputation with the Príncipi;5 × [Black Pearl](/blackPearl/)s;[Cloak of Protection](/cloakOfProtectionDeadfire/)\n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         =\n| next         = Symbols of Death\n| internalname = FCT_QST_Principi_Deadlight\n| guid         = b62bd415-5f2d-49e8-9261-6ca74b0b440a\n}}\n'''{{PAGENAME}}''' is a [faction quest](/pillarsOfEternityIiDeadfireQuestsFactionQuests/) in {{poe2}}.\n\n## Synopsis\n\nFurrante, leader of the [Príncipi sen Patrena](/principiSenPatrena/), has revealed the identity of the pirate that attacked the Watcher at sea - a captain named [Benweth](/benweth/) who has taken refuge at [Fort Deadlight](/fortDeadlight/). The Watcher could seek vengeance by seeing Benweth fall.\n\n## Overview\n\n<!-- ol/li instead of # to allow mixed bullet points and numbered list -->\n<ol>\n<li>Get into [Fort Deadlight](/fortDeadlight/), either with [Príncipi colors](/principiColors/), or by climbing the fort wall under the cover of night (requires a [Spyglass](/spyglass/)).</li>\n<li>Make your way past security into the fort proper, either through the forge or the eastern ramparts.\n<li>Confront [Benweth](/benweth/) directly or lure him out of hiding.\n* Help [Lamond](/lamond/) in the forge steal Benweth's ship to create a distraction.\n* Start a party in the court with the help of [Mirke](/mirke/) - Benweth will come down to show off his harpsichord skills. You can also sabotage the harpsichord in order to kill Benweth.</li>\n<li>Kill Benweth or peacefully negotiate his leaving Fort Deadlight.</li>\n</ol>\n\n## Walkthrough\n\n* Sail to [Fort Deadlight](/fortDeadlight/).\n\n## =Get into the fort\n\n=\nIn order to get into the fort, you'll need to either:\n* '''Fly Príncipi colors as you sail in.'''\n** This is the standard method.\n** You need [Príncipi colors](/principiColors/) which can be obtained by completing [The Cornett's Call](/theCornettsCall/), stealing it from [Captain Mad Morena](/captainMadMorena/)'s quarters, or by attacking Príncipi ships.\n** Your starting point is the gate on the east side of the courtyard.\n* '''Attempt to sneak past.'''\n** You need a [Spyglass](/spyglass/) to accomplish this.\n** You'll lose some time waiting for nighttime.\n** You'll lose all rest bonus.\n** Your starting point is under a cliff on the southwestern side of the fort. Upon climbing (requires [Athletics](/athletics/) 3 or [Rope and Grappling Hook](/ropeAndGrapplingHookDeadfire/)), you enter the armory in the dungeon.  [Rope and Grappling Hook](/ropeAndGrapplingHookDeadfire/) takes higher [Athletics](/athletics/) than just climbing without it.\n** You have early access to the forge.\n* '''Assault the fort directly.'''\n** This option needs not any special tool but is actually the hardest option, your ship will be under fire while you approach and will most likely sink.\n** Even if you succeed, the entire fort will be hostile upon entry. Your only option will be killing everything in sight.\n\n## =Get past the security\n\n=\nBenweth is at the highest point of the fort.\nHowever, the fort is riddled with guards in many areas. In order to access each area, you'll need to either sneak around, divert their attention, or simply kill them all. The bloodshed path, however, will trigger an alarm, turning the entire fort hostile, including your prospective sidekick - [Mirke](/mirke/).\n\nThe security is only in effect during this quest, it's unnecessary to get pass all of them as long as you find Benweth.\n\n* '''Gain access to the forge.'''<br />The door to the forge is guarded by [Ungwith the Craghearted](/ungwithTheCraghearted/).\n** Distract Ungwith by challenging [Ruddy Feyr](/ruddyFeyr/) to a drinking contest.\n** Detour through the dungeon. The stairs to the forge is at the western part of the dungeon. To get to the stairs:\n*** Unlock the door of the storage room (difficulty 5) near the center of the area. If you gained access to the forge through other means, you can get a key for this door from [Lamond](/lamond/).\n*** Go through the southern passage and find the hidden switch to open the secret door to the armory.\n\n* '''Gain access to the upper ramparts.'''<br />The stairs to the eastern ramparts are guarded by [Unlucky Ancret](/unluckyAncret/).\n** Distract [Ancret](/unluckyAncret/) by dropping the cargo from the crane.\n*** Throw a dagger at the rope. Requires [Sleight of Hand](/sleightOfHand/) 2, and a [Poor](/poorDaggerDeadfire/), [Normal](/daggerDeadfire/), [Fine](/fineDeadfire/), [Superb](/superbDaggerDeadfire/), or [Legendary](/legendaryDaggerDeadfire/) dagger.\n*** Shoot an arrow from your equipped [hunting bow](/huntingBowsDeadfire/), or [war bow](/warBowsDeadfire/). Requires [Sleight of Hand](/sleightOfHand/) 3.\n*** Cast [Mind Blades](/mindBladesDeadfire/), [Burst of Summer Flame](/burstOfSummerFlameDeadfire/), or [Necrotic Lance](/necroticLanceDeadfire/) on the rope.\n*** Cast a bolt from your equipped [wand](/wandsDeadfire/), [rod](/rodsDeadfire/), or [scepter](/sceptersDeadfire/).\n*** Or get a companion to step in and help out (same checks)\n** Tell [Ancret](/unluckyAncret/) that [Snake Eyes Condwen](/snakeEyesCondwen/) is cheating. You can get this information by talking to [Mirke](/mirke/), [Syri the Siren](/syriTheSiren/) or by pickpocketing [Peculiar Dice](/peculiarDice/) from Condwen.\n*** You can lie to Ancret and say that Condwen was boasting.\n*** Say that you heard he cheats (after talking to Mirke).\n*** Say you found the weighted dice (only after inspecting the dice in your stash).\n*** If you spoke to Condwen about her debt beforehand (only after learning of it from Mirke and stealing the dice), say that Condwen says she can't roll a 7 to save her life.\n** Get the pirates playing near Condwen to chase him off by stealing the [Peculiar Dice](/peculiarDice/), inspecting them in your stash, then confronting him.\n\n* '''Gain access to the inner area.'''<br />This area includes the kitchen, the [secret dock](/secretDock/) and [Deadlight donjon](/deadlightDonjon/).\n** Go through the secret door in the forge. You can find the secret door by helping out [Lamond](/lamond/), or finding it yourself.\n** Get a party started by stealing [God-Killer's Rum](/godKillersRum/) for [Mirke](/mirke/).\n** Sneak your way through the upper ramparts. This is quite difficult.\n\n## =Find a means to reach Benweth\n\n=\nThere are 3 main ways to reach Benweth as described below.\n\n###### Lure Benweth to the western ramparts\n\n[Lamond](/lamond/), a captain working in the forge, has a plan to steal Benweth's ship, the ''Drake''. This can be used as a distraction to bring Benweth out of hiding, and out onto the ramparts where he can be confronted.\n* Go to the forge, Lamond will talk to you the moment you enter. He will ask you to free his men from the brig in exchange for showing you a secret passage to Benweth. Note that the secret passage can be found even without his help.\n* Head to the dungeon and free Lamond's men. They're locked behind bars (difficulty 5). The key can be found on a table north-east of the cell, or pickpocketed from the guard patrolling in front of it. The area is heavily guarded so make sure to sneak around in stealth mode.\n* Once they've been freed, return to Lamond. He'll show you the secret passage as promised, then suggest a plan to lure Benweth out by stealing his ship moored in the [Secret Dock](/secretDock/) underneath Fort Deadlight. In order to carry out the plan, he'll ask you to clear out the guards in the dock.\n* Go to the [secret dock](/secretDock/) via the kitchen and kill all the guards there. The guards there will attack you on sight, but they won't trigger an alarm.\n* The stairs on the other side of the secret dock lead to the western ramparts, it also has a door that leads back to Lamond on the way.\n* Head up stairs to the western ramparts and chime the bell three times (to indicate a ship leaving port). Benweth will come stomping out of his quarters unaccompanied, swearing hell at the leaving ship. You may then approach him freely.\n\n###### Lure Benweth to the court\n\nIn Deadlight's Court, both [Mirke](/mirke/) and Serafen's old flame, [Syri the Siren](/syriTheSiren/), mention that Benweth is quite the musician with the harpsichord. Mirke says that Benweth has been known to play the harpsichord at the court during wild parties - thinking that some of Aeldys' special rum is just what the pirates need to get the party started.\n* Go to the eastern ramparts and steal the shipment of [God-Killer's Rum](/godKillersRum/). The rum is in a locked chest (difficulty 2) just a little left from the crane.\n* Return to Mirke and give her the rum. She will then ask you to get a specially spiced [stew](/specialStew/) in order to kick up the party's intensity.\n* Head to the kitchen on the northern side of the dungeons. When you get to the dungeon, you'll see a bunch of guards slipping out of their post to join the party. On their way, they unlock the doors and leave them open, so you can go to the kitchen unimpeded. Talk to the chef, [Cookie Maina](/cookieMaina/), to get the stew. She'll give it to you without any problem.\n* Before going back to Mirke, you may want to inspect the harpsichord and rig a bomb there.\n* Return to Mirke and give her the stew. This will lure Benweth down, who will join the party, and begin to show off his skills on the harpsichord\n** If you had rigged the harpsichord, the bomb will explode mid-song, killing Benweth. Easy peasy.\n** If you hadn't rigged the harpsichord, you can now approach Benweth.\n*** Benweth, surrounded by excited pirates, is ready for a fight. With [Intimidate](/intimidate/) 4 or [Diplomacy](/diplomacy/) 4, you can clear out a few pirates from the room and start the negotiation as described below, otherwise, a fight will be unavoidable.\n*** You may also want to recruit [Mirke](/mirke/) before starting a fight.\n*** '''Fun fact:''' Now that Benweth's partying, you can still lure him to the western ramparts as mentioned above as long as you don't talk to him. However, the opposite doesn't hold true, if his ship has been stolen, he won't be in any mood to join the party.\n\n###### Head directly to the command room\n\n* Gain access to [Deadlight donjon](/deadlightDonjon/) through any means.\n* The command room where Benweth resides is locked (difficulty 5). If you have the key, you can enter directly. If not, slightly to the right of the command room, there is also a hidden switch to open a secret door (Lamond will tell you of this passage should you choose to help him out).\n* This is the best route if you want to end without any bloodshed.\n\n## =Confront Benweth\n\n=\n* Now that you've come face-to-face with Benweth, you can either kill him or negotiate with him peacefully. \n*First he will ask you if he knows you. The clever option provides a Major Positive reputation with Principi\n* To negotiate, you'll need either:\n** [Intimidate](/intimidate/) 6 - ''Lower quest reward''\n** [Streetwise](/streetwise/) 5\n** [Diplomacy](/diplomacy/) 7 - ''Higher quest reward''\n:Benweth will promise not to hassle you further, and the fort will be free to explore/loot unimpeded. You can also murder him afterwards if you want his armor\n* After completing the quest, most of the guards will either ignore you or disappear when changing area. If you lured Benweth out and killed him '''in a fight''', his gang in the command room will remain hostile. You can also now attack the guards without triggering the alarm.\n\n## =Conclusion\n\n=\n* If you head to [Dunnage](/dunnage/) and the [Balefire Beacon](/balefireBeacon/), [Furrante](/captainFurrante/) will congratulate you, especially if you managed to solve the problem without bloodshed or by intimidating Benweth. He'll give you a [Cloak of Protection](/cloakOfProtectionDeadfire/) as a reward.\n* About two days after completing the quest, if you haven't gone to see Furrante yet, you'll get a [letter](/letterOfFinePenmanship/) from him after departing any port.\n* Similarly, more than a day later you'll get a [letter](/wineAndGunpowderScentedLetter/) from [Aeldys](/captainAeldys/).\n\n## Cut content\n\nA few cut interactions exist that once provided alternate routes to completing the quest:\n* [Unlucky Ancret](/unluckyAncret/) could be crushed by the hanging cargo while she stands under it, providing another way to give you clear and permanent access to the ramparts.\n* The [Deadlight Horn](/deadlightHorn/) could be used to call Benweth to arms, one way to lure him down to the court. [Sceydwin](/sceydwin/) would have taught you how to use the horn, however this dialogue was cut. Journal addendums that reference the horn still exist, and can be triggered while speaking with her.\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/XX_Principi_Faction_Questline/FCT_QST_Principi_Deadlight.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''Blow the Man Down'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Furrante</b>, leader of the <b>Príncipi sen Patrena</b>, has revealed the identity and location of the pirate that attacked me at sea - a captain named <b>Benweth</b> who has taken refuge at the pirate haven of <b>Fort Deadlight</b>. He suggested that I could seek my vengeance in Fort Deadlight, and that we have a mutual interest in seeing Benweth fall.\n|-\n| rowspan=\"5\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Sail to <b>Fort Deadlight</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Benweth</b> has returned to <b>Fort Deadlight</b>. This entrenched fortress occupies a small island in the <b>southwestern region of the Deadfire</b>. All manner of pirate crews call Deadlight their home. Getting to Benweth, either through force or subterfuge, won't be easy.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| The master of <b>Fort Deadlight</b> is <b>Aeldys</b>, leader of a large Príncipi subfaction. In her absence, <b>Benweth</b> runs the fortress, though most of its denizens are loyal specifically to Aeldys rather than him.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| <b>Furrante</b> discourages a direct attack against the fort. Its walls, cannons and pirates pose great danger. Instead, he suggests infiltrating unseen or posing as a Príncipi crew.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| If I were to fly a <b>Príncipi banner</b. during my approach to <b>Deadlight</b> then I could dock in its port pretending to be a pirate.\n|-\n| rowspan=\"8\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Locate <b>Benweth</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| I've arrived at <b>Deadlight</b>. <b>Benweth</b> is somewhere in the fort. Once I uncover his location, I can worry about how to reach him.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I've invaded <b>Fort Deadlight</b> by aggressive force. The pirates in the area are sure to openly oppose me.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| I've docked in <b>Fort Deadlight's</b> port, guised as a fellow pirate. If the others discovered my ruse, it could lead to trouble.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| I've approached <b>Fort Deadlight</b> by skiff under the cover of night. The pirates in the fortress have no reason to suspect me on sight, unless I'm caught where I shouldn't be.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| The fort's <b>ramparts</b> and <b>dungeons</b> are currently barred to anyone but <b>Benweth's own shipmates</b>.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| <b>Benweth's guards</b> use a horn to alert the fort to the presence of danger.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| I've learned how to call off Deadlight's alarm by using a guard's horn, though it's not likely to work a second time.\n|-\n| rowspan=\"8\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Find a means to reach <b>Benweth</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| <b>Benweth</b> has taken residence in the higher floors of the fort, behind locked doors and loyal pirate guards. The direct route to him appears well-defended, but perhaps there are less obvious ways to get around these obstacles.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| It may be possible to draw <b>Benweth</b> out of Deadlight's well-defended <b>captain's quarters</b> by luring him with a raucous party at the fort's mess hall, the <b>Court</b>.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| <b>Mirke</b> thinks that some of <b>Aeldys' special rum</b> is just what the pirates need to throw a party at <b>Deadlight's Court</b>. A shipment of this prized liquor is now being loaded by crane on the <b>eastern ramparts of the fort</b>.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| <b>Lamond</b> has promised to unlock a door to the fort's higher floors if I will free his crew from the brig in <b>Deadlight's dungeons</b>.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| <b>Lamond's crew</b> is imprisoned in the brig, found in the <b>southeastern part of the dungeons</b>. The keys to the cells should be by the jailer's post or on her person.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I've acquired <b>Aeldys' private stock of rum</b>. <b>Mirke</b> will be happy to get her hands on it.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I've freed <b>Lamond's crew</b> from the <b>brig</b>.\n|-\n| rowspan=\"10\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Confront <b>Benweth</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| I've found a way into the restricted areas that lead to <b>Deadlight's captain's quarters</b> where <b>Benweth</b> currently resides. While a direct approach is now possible, I can consider other options to deal with him.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| <b>Benweth</b> has been known to play the <b>harpsichord</b> at <b>Deadlight's Court</b> during wild parties. \n|-\n| style=\"vertical-align:text-top\" | 20014\n| <b>Mirke</b> needs some <b>special stew</b> from the <b>cook</b> to kick up the party's intensity at <b>Deadlight's Court</b>.\n|-\n| style=\"vertical-align:text-top\" | 20017\n| Getting to the <b>cook</b> in the <b>northern side of the dungeons</b> requires passing its powder store rooms - and <b>Benweth's guards</b>.\n|-\n| style=\"vertical-align:text-top\" | 20018\n| <b>Lamond</b> has a plan to flush <b>Benweth</b> out of his inner quarters and into the open, away from his guards.\n|-\n| style=\"vertical-align:text-top\" | 20015\n| <b>Lamond</b> will be ready to steal the Drake after I dispose of <b>Benweth's crew</b> in the private <b>docks under Deadlight's dungeons</b>.\n|-\n| style=\"vertical-align:text-top\" | 20016\n| Once the <b>docks</b> are cleared, I'm to ring the bell atop the <b>western ramparts</b> to let <b>Lamond</b> know it's time to steal </b>Benweth's ship</b>.\n|-\n| style=\"vertical-align:text-top\" | 20021\n| I've acquired the <b>special stew</b> that <b>Mirke</b> needs.\n|-\n| style=\"vertical-align:text-top\" | 20022\n| I've cleared the private docks. As soon as I sound the ship departure signal from the <b>ramparts</b>, <b>Lamond</b> will sail away with <b>Benweth's ship</b>, the Drake.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| I've made an impression on the pirates of the Deadfire by defeating Benweth. Captain Furrante, who resides in the island of Dunnage, will be pleased to learn of the meddlesome pirate's demise.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I've made an impression on the pirates of the Deadfire by exacting vengeance upon Benweth, even if I spared his life in the end. Captain Furrante, who resides in the island of Dunnage, will be pleased to learn of my success.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30002\n| Someone critical to this quest has died.\n|}",
  "raw": "{{Infobox quest poe2\n| name         = Blow the Man Down\n| image        = PE2 Fort Deadlight.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Faction quest\n| quest_region = Deadfire - Southwest\n| quest_level  = 8\n| faction      = Príncipi sen Patrena\n| locations    = Fort Deadlight\n| main_npcs    = Captain Furrante;Benweth;Lamond;Mirke\n| companion    = Serafen\n| quest_giver  = Captain Furrante\n| xp_amount    = 1000\n| xp_type      = Normal\n| xp_level     = 5\n| xp_weights   = 1;1;1;1\n| rewardname1  = Kill Benweth\n| reward1      = [[Miscreant's Leathers]];5 × [[Black Pearl]]s;[[Cloak of Protection (Deadfire)|Cloak of Protection]]\n| rewardname2  = Spare Benweth ([[Streetwise]] or [[Intimidate]])\n| reward2      = 5 × [[Black Pearl]]s;[[Cloak of Protection (Deadfire)|Cloak of Protection]]\n| rewardname3  = Make a deal with Benweth ([[Diplomacy]])\n| reward3      = {{cp2|1000}} or Major Positive reputation with the Príncipi;5 × [[Black Pearl]]s;[[Cloak of Protection (Deadfire)|Cloak of Protection]]\n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         =\n| next         = Symbols of Death\n| internalname = FCT_QST_Principi_Deadlight\n| guid         = b62bd415-5f2d-49e8-9261-6ca74b0b440a\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests#Faction quests|faction quest]] in {{poe2}}.\n\n==Synopsis==\nFurrante, leader of the [[Príncipi sen Patrena]], has revealed the identity of the pirate that attacked the Watcher at sea - a captain named [[Benweth]] who has taken refuge at [[Fort Deadlight]]. The Watcher could seek vengeance by seeing Benweth fall.\n\n==Overview==\n<!-- ol/li instead of # to allow mixed bullet points and numbered list -->\n<ol>\n<li>Get into [[Fort Deadlight]], either with [[Príncipi colors]], or by climbing the fort wall under the cover of night (requires a [[Spyglass]]).</li>\n<li>Make your way past security into the fort proper, either through the forge or the eastern ramparts.\n<li>Confront [[Benweth]] directly or lure him out of hiding.\n* Help [[Lamond]] in the forge steal Benweth's ship to create a distraction.\n* Start a party in the court with the help of [[Mirke]] - Benweth will come down to show off his harpsichord skills. You can also sabotage the harpsichord in order to kill Benweth.</li>\n<li>Kill Benweth or peacefully negotiate his leaving Fort Deadlight.</li>\n</ol>\n\n==Walkthrough==\n* Sail to [[Fort Deadlight]].\n\n===Get into the fort===\nIn order to get into the fort, you'll need to either:\n* '''Fly Príncipi colors as you sail in.'''\n** This is the standard method.\n** You need [[Príncipi colors]] which can be obtained by completing [[The Cornett's Call]], stealing it from [[Captain Mad Morena]]'s quarters, or by attacking Príncipi ships.\n** Your starting point is the gate on the east side of the courtyard.\n* '''Attempt to sneak past.'''\n** You need a [[Spyglass]] to accomplish this.\n** You'll lose some time waiting for nighttime.\n** You'll lose all rest bonus.\n** Your starting point is under a cliff on the southwestern side of the fort. Upon climbing (requires [[Athletics]] 3 or [[Rope and Grappling Hook (Deadfire)|Rope and Grappling Hook]]), you enter the armory in the dungeon.  [[Rope and Grappling Hook (Deadfire)|Rope and Grappling Hook]] takes higher [[Athletics]] than just climbing without it.\n** You have early access to the forge.\n* '''Assault the fort directly.'''\n** This option needs not any special tool but is actually the hardest option, your ship will be under fire while you approach and will most likely sink.\n** Even if you succeed, the entire fort will be hostile upon entry. Your only option will be killing everything in sight.\n\n===Get past the security===\nBenweth is at the highest point of the fort.\nHowever, the fort is riddled with guards in many areas. In order to access each area, you'll need to either sneak around, divert their attention, or simply kill them all. The bloodshed path, however, will trigger an alarm, turning the entire fort hostile, including your prospective sidekick - [[Mirke]].\n\nThe security is only in effect during this quest, it's unnecessary to get pass all of them as long as you find Benweth.\n\n* '''Gain access to the forge.'''<br />The door to the forge is guarded by [[Ungwith the Craghearted]].\n** Distract Ungwith by challenging [[Ruddy Feyr]] to a drinking contest.\n** Detour through the dungeon. The stairs to the forge is at the western part of the dungeon. To get to the stairs:\n*** Unlock the door of the storage room (difficulty 5) near the center of the area. If you gained access to the forge through other means, you can get a key for this door from [[Lamond]].\n*** Go through the southern passage and find the hidden switch to open the secret door to the armory.\n\n* '''Gain access to the upper ramparts.'''<br />The stairs to the eastern ramparts are guarded by [[Unlucky Ancret]].\n** Distract [[Unlucky Ancret|Ancret]] by dropping the cargo from the crane.\n*** Throw a dagger at the rope. Requires [[Sleight of Hand]] 2, and a [[Poor Dagger (Deadfire)|Poor]], [[Dagger (Deadfire)|Normal]], [[Fine (Deadfire)|Fine]], [[Superb Dagger (Deadfire)|Superb]], or [[Legendary Dagger (Deadfire)|Legendary]] dagger.\n*** Shoot an arrow from your equipped [[Hunting bows (Deadfire)|hunting bow]], or [[War bows (Deadfire)|war bow]]. Requires [[Sleight of Hand]] 3.\n*** Cast [[Mind Blades (Deadfire)|Mind Blades]], [[Burst of Summer Flame (Deadfire)|Burst of Summer Flame]], or [[Necrotic Lance (Deadfire)|Necrotic Lance]] on the rope.\n*** Cast a bolt from your equipped [[Wands (Deadfire)|wand]], [[Rods (Deadfire)|rod]], or [[Scepters (Deadfire)|scepter]].\n*** Or get a companion to step in and help out (same checks)\n** Tell [[Unlucky Ancret|Ancret]] that [[Snake Eyes Condwen]] is cheating. You can get this information by talking to [[Mirke]], [[Syri the Siren]] or by pickpocketing [[Peculiar Dice]] from Condwen.\n*** You can lie to Ancret and say that Condwen was boasting.\n*** Say that you heard he cheats (after talking to Mirke).\n*** Say you found the weighted dice (only after inspecting the dice in your stash).\n*** If you spoke to Condwen about her debt beforehand (only after learning of it from Mirke and stealing the dice), say that Condwen says she can't roll a 7 to save her life.\n** Get the pirates playing near Condwen to chase him off by stealing the [[Peculiar Dice]], inspecting them in your stash, then confronting him.\n\n* '''Gain access to the inner area.'''<br />This area includes the kitchen, the [[secret dock]] and [[Deadlight donjon]].\n** Go through the secret door in the forge. You can find the secret door by helping out [[Lamond]], or finding it yourself.\n** Get a party started by stealing [[God-Killer's Rum]] for [[Mirke]].\n** Sneak your way through the upper ramparts. This is quite difficult.\n\n===Find a means to reach Benweth===\nThere are 3 main ways to reach Benweth as described below.\n\n;Lure Benweth to the western ramparts\n[[Lamond]], a captain working in the forge, has a plan to steal Benweth's ship, the ''Drake''. This can be used as a distraction to bring Benweth out of hiding, and out onto the ramparts where he can be confronted.\n* Go to the forge, Lamond will talk to you the moment you enter. He will ask you to free his men from the brig in exchange for showing you a secret passage to Benweth. Note that the secret passage can be found even without his help.\n* Head to the dungeon and free Lamond's men. They're locked behind bars (difficulty 5). The key can be found on a table north-east of the cell, or pickpocketed from the guard patrolling in front of it. The area is heavily guarded so make sure to sneak around in stealth mode.\n* Once they've been freed, return to Lamond. He'll show you the secret passage as promised, then suggest a plan to lure Benweth out by stealing his ship moored in the [[Secret Dock]] underneath Fort Deadlight. In order to carry out the plan, he'll ask you to clear out the guards in the dock.\n* Go to the [[secret dock]] via the kitchen and kill all the guards there. The guards there will attack you on sight, but they won't trigger an alarm.\n* The stairs on the other side of the secret dock lead to the western ramparts, it also has a door that leads back to Lamond on the way.\n* Head up stairs to the western ramparts and chime the bell three times (to indicate a ship leaving port). Benweth will come stomping out of his quarters unaccompanied, swearing hell at the leaving ship. You may then approach him freely.\n\n;Lure Benweth to the court\nIn Deadlight's Court, both [[Mirke]] and Serafen's old flame, [[Syri the Siren]], mention that Benweth is quite the musician with the harpsichord. Mirke says that Benweth has been known to play the harpsichord at the court during wild parties - thinking that some of Aeldys' special rum is just what the pirates need to get the party started.\n* Go to the eastern ramparts and steal the shipment of [[God-Killer's Rum]]. The rum is in a locked chest (difficulty 2) just a little left from the crane.\n* Return to Mirke and give her the rum. She will then ask you to get a specially spiced [[Special Stew|stew]] in order to kick up the party's intensity.\n* Head to the kitchen on the northern side of the dungeons. When you get to the dungeon, you'll see a bunch of guards slipping out of their post to join the party. On their way, they unlock the doors and leave them open, so you can go to the kitchen unimpeded. Talk to the chef, [[Cookie Maina]], to get the stew. She'll give it to you without any problem.\n* Before going back to Mirke, you may want to inspect the harpsichord and rig a bomb there.\n* Return to Mirke and give her the stew. This will lure Benweth down, who will join the party, and begin to show off his skills on the harpsichord\n** If you had rigged the harpsichord, the bomb will explode mid-song, killing Benweth. Easy peasy.\n** If you hadn't rigged the harpsichord, you can now approach Benweth.\n*** Benweth, surrounded by excited pirates, is ready for a fight. With [[Intimidate]] 4 or [[Diplomacy]] 4, you can clear out a few pirates from the room and start the negotiation as described below, otherwise, a fight will be unavoidable.\n*** You may also want to recruit [[Mirke]] before starting a fight.\n*** '''Fun fact:''' Now that Benweth's partying, you can still lure him to the western ramparts as mentioned above as long as you don't talk to him. However, the opposite doesn't hold true, if his ship has been stolen, he won't be in any mood to join the party.\n\n;Head directly to the command room\n* Gain access to [[Deadlight donjon]] through any means.\n* The command room where Benweth resides is locked (difficulty 5). If you have the key, you can enter directly. If not, slightly to the right of the command room, there is also a hidden switch to open a secret door (Lamond will tell you of this passage should you choose to help him out).\n* This is the best route if you want to end without any bloodshed.\n\n===Confront Benweth===\n* Now that you've come face-to-face with Benweth, you can either kill him or negotiate with him peacefully. \n*First he will ask you if he knows you. The clever option provides a Major Positive reputation with Principi\n* To negotiate, you'll need either:\n** [[Intimidate]] 6 - ''Lower quest reward''\n** [[Streetwise]] 5\n** [[Diplomacy]] 7 - ''Higher quest reward''\n:Benweth will promise not to hassle you further, and the fort will be free to explore/loot unimpeded. You can also murder him afterwards if you want his armor\n* After completing the quest, most of the guards will either ignore you or disappear when changing area. If you lured Benweth out and killed him '''in a fight''', his gang in the command room will remain hostile. You can also now attack the guards without triggering the alarm.\n\n===Conclusion===\n* If you head to [[Dunnage]] and the [[Balefire Beacon]], [[Captain Furrante|Furrante]] will congratulate you, especially if you managed to solve the problem without bloodshed or by intimidating Benweth. He'll give you a [[Cloak of Protection (Deadfire)|Cloak of Protection]] as a reward.\n* About two days after completing the quest, if you haven't gone to see Furrante yet, you'll get a [[Letter of Fine Penmanship|letter]] from him after departing any port.\n* Similarly, more than a day later you'll get a [[Wine and Gunpowder-Scented Letter|letter]] from [[Captain Aeldys|Aeldys]].\n\n==Cut content==\nA few cut interactions exist that once provided alternate routes to completing the quest:\n* [[Unlucky Ancret]] could be crushed by the hanging cargo while she stands under it, providing another way to give you clear and permanent access to the ramparts.\n* The [[Deadlight Horn]] could be used to call Benweth to arms, one way to lure him down to the court. [[Sceydwin]] would have taught you how to use the horn, however this dialogue was cut. Journal addendums that reference the horn still exist, and can be triggered while speaking with her.\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/XX_Principi_Faction_Questline/FCT_QST_Principi_Deadlight.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''Blow the Man Down'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Furrante</b>, leader of the <b>Príncipi sen Patrena</b>, has revealed the identity and location of the pirate that attacked me at sea - a captain named <b>Benweth</b> who has taken refuge at the pirate haven of <b>Fort Deadlight</b>. He suggested that I could seek my vengeance in Fort Deadlight, and that we have a mutual interest in seeing Benweth fall.\n|-\n| rowspan=\"5\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Sail to <b>Fort Deadlight</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Benweth</b> has returned to <b>Fort Deadlight</b>. This entrenched fortress occupies a small island in the <b>southwestern region of the Deadfire</b>. All manner of pirate crews call Deadlight their home. Getting to Benweth, either through force or subterfuge, won't be easy.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| The master of <b>Fort Deadlight</b> is <b>Aeldys</b>, leader of a large Príncipi subfaction. In her absence, <b>Benweth</b> runs the fortress, though most of its denizens are loyal specifically to Aeldys rather than him.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| <b>Furrante</b> discourages a direct attack against the fort. Its walls, cannons and pirates pose great danger. Instead, he suggests infiltrating unseen or posing as a Príncipi crew.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| If I were to fly a <b>Príncipi banner</b. during my approach to <b>Deadlight</b> then I could dock in its port pretending to be a pirate.\n|-\n| rowspan=\"8\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Locate <b>Benweth</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| I've arrived at <b>Deadlight</b>. <b>Benweth</b> is somewhere in the fort. Once I uncover his location, I can worry about how to reach him.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I've invaded <b>Fort Deadlight</b> by aggressive force. The pirates in the area are sure to openly oppose me.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| I've docked in <b>Fort Deadlight's</b> port, guised as a fellow pirate. If the others discovered my ruse, it could lead to trouble.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| I've approached <b>Fort Deadlight</b> by skiff under the cover of night. The pirates in the fortress have no reason to suspect me on sight, unless I'm caught where I shouldn't be.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| The fort's <b>ramparts</b> and <b>dungeons</b> are currently barred to anyone but <b>Benweth's own shipmates</b>.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| <b>Benweth's guards</b> use a horn to alert the fort to the presence of danger.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| I've learned how to call off Deadlight's alarm by using a guard's horn, though it's not likely to work a second time.\n|-\n| rowspan=\"8\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Find a means to reach <b>Benweth</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| <b>Benweth</b> has taken residence in the higher floors of the fort, behind locked doors and loyal pirate guards. The direct route to him appears well-defended, but perhaps there are less obvious ways to get around these obstacles.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| It may be possible to draw <b>Benweth</b> out of Deadlight's well-defended <b>captain's quarters</b> by luring him with a raucous party at the fort's mess hall, the <b>Court</b>.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| <b>Mirke</b> thinks that some of <b>Aeldys' special rum</b> is just what the pirates need to throw a party at <b>Deadlight's Court</b>. A shipment of this prized liquor is now being loaded by crane on the <b>eastern ramparts of the fort</b>.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| <b>Lamond</b> has promised to unlock a door to the fort's higher floors if I will free his crew from the brig in <b>Deadlight's dungeons</b>.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| <b>Lamond's crew</b> is imprisoned in the brig, found in the <b>southeastern part of the dungeons</b>. The keys to the cells should be by the jailer's post or on her person.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I've acquired <b>Aeldys' private stock of rum</b>. <b>Mirke</b> will be happy to get her hands on it.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I've freed <b>Lamond's crew</b> from the <b>brig</b>.\n|-\n| rowspan=\"10\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Confront <b>Benweth</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| I've found a way into the restricted areas that lead to <b>Deadlight's captain's quarters</b> where <b>Benweth</b> currently resides. While a direct approach is now possible, I can consider other options to deal with him.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| <b>Benweth</b> has been known to play the <b>harpsichord</b> at <b>Deadlight's Court</b> during wild parties. \n|-\n| style=\"vertical-align:text-top\" | 20014\n| <b>Mirke</b> needs some <b>special stew</b> from the <b>cook</b> to kick up the party's intensity at <b>Deadlight's Court</b>.\n|-\n| style=\"vertical-align:text-top\" | 20017\n| Getting to the <b>cook</b> in the <b>northern side of the dungeons</b> requires passing its powder store rooms - and <b>Benweth's guards</b>.\n|-\n| style=\"vertical-align:text-top\" | 20018\n| <b>Lamond</b> has a plan to flush <b>Benweth</b> out of his inner quarters and into the open, away from his guards.\n|-\n| style=\"vertical-align:text-top\" | 20015\n| <b>Lamond</b> will be ready to steal the Drake after I dispose of <b>Benweth's crew</b> in the private <b>docks under Deadlight's dungeons</b>.\n|-\n| style=\"vertical-align:text-top\" | 20016\n| Once the <b>docks</b> are cleared, I'm to ring the bell atop the <b>western ramparts</b> to let <b>Lamond</b> know it's time to steal </b>Benweth's ship</b>.\n|-\n| style=\"vertical-align:text-top\" | 20021\n| I've acquired the <b>special stew</b> that <b>Mirke</b> needs.\n|-\n| style=\"vertical-align:text-top\" | 20022\n| I've cleared the private docks. As soon as I sound the ship departure signal from the <b>ramparts</b>, <b>Lamond</b> will sail away with <b>Benweth's ship</b>, the Drake.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| I've made an impression on the pirates of the Deadfire by defeating Benweth. Captain Furrante, who resides in the island of Dunnage, will be pleased to learn of the meddlesome pirate's demise.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I've made an impression on the pirates of the Deadfire by exacting vengeance upon Benweth, even if I spared his life in the end. Captain Furrante, who resides in the island of Dunnage, will be pleased to learn of my success.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30002\n| Someone critical to this quest has died.\n|}",
  "slug": "blowTheManDown",
  "title": "Blow the Man Down"
}
