{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Cave of Threshing.png\n| caption_map   = \n| name          = Cave of Threshing\n| type          = Ruin\n| description   = \n| exits         = \n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Rikuhu's Maw\n| plants        = \n| expected_level= 17\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_26_uncharted_islands\n| internalname  = AR_2611_Fampyr_Cave\n| guid          = 8307c350-da44-43c3-8552-9a499c84d144\n| lsc           = \n| icon          = Icon Mountain 1 Cave Right.png\n}}\n'''{{PAGENAME}}''' (also called '''Fampyr's Crypt''' on the world map) is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\n{{Description|In the distance, you spy the entrance to a cave sunken into a hillside, barely hidden behind the stunted, shriveled trunks of leafless trees.\n\nAs you approach the cave, something snaps beneath your boot. You look down, expecting a stick, and find the splintered remains of ancient bone. You see the ground before the cave with new eyes. What you first thought were branches are bones - some half-buried in the dirt, others piled in drifts. Many are bleached white with age.\n\nYou linger at the entrance to the cave. The passage beyond extends into pitch-black darkness. It reeks of death and decay.}}\n\n==Points of interest==\n* The cave of threshing is filled with bones of thousands of people sacrificed on the altar here. If you choose to enter, you will also have to deal with four ancient fampyrs, who are very potent enemies at any stage of the game. Killing them (or sneaking around to it) grants you access to the adra sarcophagus containing [[The Giftbearer's Cloth]].\n\n==Loot==\n* [[The Giftbearer's Cloth]]: In the adra sarcophagus.\n\n==Trivia==\n* The exterior location is known as \"Fampyr's Crypt\", but the interior is called \"Cave of Threshing\"\n\n==Gallery==\n;Scripted interaction graphics\n<gallery mode=nolines>\n RE si uncharted 01 xaurip cave entrance.png\n</gallery>",
  "slug": "caveOfThreshing",
  "title": "Cave of Threshing"
}
