{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Cockerel Forest.png\n| image         = PE2 Cockerel Forest Forest.png\n| caption_map   = \n| name          = Cockerel Forest\n| type          = Scripted interaction\n| description   = \n| exits         = \n| sub_locations = Forest\n| merchant      = \n| innkeeper     = \n| inhabitants   = Cathŵenna;Cemoc;Hudango\n| main_location = Crookspur Island\n| plants        = \n| internalname  = \n| lsc           = \n| icon          = Icon Forest Dark.png\n}}\n'''{{Pagename nd}}''' is a scripted interaction on the northwestern edge of [[Crookspur Island]].\n\n== Background ==\n{{Description|North of Crookspur, the forest thickens. Wide-trunked trees tower above you, their leaves forming a ceiling against the sky. A symphony of insects provide constant accompaniment of chirping and buzzing.\n\nYour path leads you into a narrow gully, the hills rising high to both sides.}}\n== Interaction ==\n* You'll be greeted by a flurry of arrows from somewhere up ahead - they scatter at your feet, just barely short of you. You jump back and search wildly for the source, but see nothing and no one.\n** Continue cautiously forward, and you encounter a further volley of arrows. An Athletics 13 check on your entire party determines if you can dodge them or not. The character with the lowest athletics receives a [[Status effects (Deadfire)#Injury|Gaping Wound]] (-25% Healing received, -15% Max Health), otherwise you always enter combat.\n** Call out to the archers using a Watcher-only Insight 10 check, this is followed by another Watcher only check to determine what to say to the kith. Failing these checks will allow you to reattempt the previous choices.\n*** Bluff 12: Say that you're peaceful missionaries, and that you're not even armed\n*** Diplomacy 14: Say that they're clearly upset and offer help\n*** Intimidate 16: Warn them that the next arrow they fire is going where the sun don't shine.\n*** A Watcher with the Slave background, and Streetwise 14 can... <sup>Needs testing</sup>\n*** You can also ask a companion to speak to them, this performs a skill check for the associated companion (see below).\n*** If you succeed in convincing them to talk, you can tell them that you're '''not''' from Crookspur. This will put you in the [[Forest]] in dialogue with a trio of escaped slaves. \n** Try to locate the attackers with a Perception 16 check. If you have [[Maia]] in the party (and ask her to try), this doesn't require a check and always succeeds as she sends Ishiza to scout ahead. Succeeding, you spot movement along a side path and a flash of armor through the greenery. If you fail, you make out nothing but foliage.\n*** This allows you to double back and attempt an ambush with Stealth 13. Failing this check will cause them see your attempt, letting loose an arrow into your gut and giving you [[Status effects (Deadfire)#Injury|Bruised Ribs]] (-20 [[Fortitude]]) and [[Status effects (Deadfire)#Injury|Gaping Wound]]. Succeeding will allow you to either sneak past, or ambush and attack, placing you in stealth on the edge of the staging area.\n** With a Cipher in the party, you can search for the presence of other minds. Your Cipher points out the location of the archers. This skips the required Perception check above, allowing you to double back and ambush with a further Stealth 13 check.\n* A trio of kith emerge from the forest, companion animals at their sides. This places you in the [[Forest]] staging area, with [[Cathŵenna]], [[Hudango]], and [[Cemoc]] - a small group of slaves who have escaped the slavers at Crookspur and have been hiding in the forest since.\n** If you failed the above checks, or if you snuck up on the group, this will cause them to attack on sight. [[Cathŵenna]] drops the unique flail [[Ball and Chain]].\n** Otherwise, if you passed the checks and convinced them to back down, you will be put into dialogue as they explain their predicament. [[Cathŵenna]] will ask for your assistance in the form of {{cp2|6000}}, which you can graciously hand over, or you can ask for something in return - her [[Ball and Chain]]. If you ask for her weapon in exchange, Insight 10 will spot her reluctance to let the weapon go, but the weight of the purse seems to decide the issue. In any case she is thankful, and bids you farewell. You also have the option to attack them during the dialogue (although there is a bug here that causes them not to enter combat after you do this).\n** If Watcher has Cruel 2 / Deceptive 2 or more disposition, [[Cathŵenna]] will refuse to talk and tell Player to back off and not to return, locking the assistance option. \n* If you at any time return the way you came, you will be unable to return to Cockerel Forest.\n\n===Companion dialogue===\n{| class=\"wikitable sortable\" style=\"margin-left: 0px\"\n! Companion\n! Quote\n! style=\"width: 13%\"|Check\n\n|-\n| [[Aloth]]\n| {{Description|You could at least give us the chance to explain ourselves!\" Aloth calls.}}\n| Diplomacy 14\n\n|-\n| [[Edér]]\n| {{Description|\"Hey, can you stop that?\" Edér looks at you and shrugs.}}\n| Diplomacy 14\n\n|-\n| [[Maia]]\n| {{Description|\"Hey, amateurs! I had your positions marked after your first shot. Better luck next life.\"\n\nMaia holds her breath and raises her rifle to point at a spot in the trees.}}\n| Intimidate 16\n\n|-\n| [[Pallegina]]\n| {{Description|Pallegina stands and points at the nearest archer. Her golden eyes flash as five familiar balls of flame begin to form around her outstretched hand.\n\n\"Stop and live or persist and die!\"}}\n| Intimidate 16\n\n|-\n| [[Serafen]]\n| {{Description|The blue orlan grins and hops out into the midst of the path, arms held out to the side. \"Oi! Ain't you fathom-headed forest farts never heard of hospitality for healers?! We be medicinal types from Neketaka's queen!\"}}\n| Bluff 12\n\n|-\n| [[Tekēhu]]\n| {{Description|\"This will not do at all, I say! Words speak louder than arrows!\" \n\nTekēhu cups his mouth and calls off into the distance.}}\n| Diplomacy 14\n\n|-\n| [[Xoti]]\n| {{Description|\"Stop shooting at us, Gaun darn it! I am on divine mission for my god, and no kith - living or dead - is going to stand in my way!\"}}\n| Diplomacy 14\n\n|-\n! colspan=\"3\" | Sidekicks\n\n|-\n|[[Fassina]]\n| rowspan=\"3\" | {{Description|[Sidekick] peers into the surrounding trees. \"I don't suppose you could stop shooting at us for a moment? Give us a chance to at least learn each other's names?\"}}\n| rowspan=\"3\" | Diplomacy 14\n|-\n| [[Konstanten]]\n|-\n| [[Mirke]]\n|-\n| [[Rekke]]\n|-\n| [[Vatnir]]\n|-\n| [[Ydwin]]\n|}\n\n==Enemies==\n* [[Cathŵenna]], [[Hudango]], and [[Cemoc]]: Escaped slaves from [[Crookspur]].\n;Beasts\n* [[Elder tiger]] (x2)\n* A lion and wolf companion\n\n==Notes==\n* There is a bug that prevents you from entering combat during the dialogue sequence, should you choose to attack them.\n* If you attack [[Cathŵenna]] after exchanging money for her weapon, she will still be armed with her flail, allowing you gain two [[Ball and Chain]]s by killing her - although you won't be able to recover the {{cp2|6000}}.\n\n== Gallery ==\n'''Scripted interaction graphics:'''\n<gallery mode=nolines>\n RE si forest.png\n RE si uncharted 09 collapsed mine arrows.png\n RE si uncharted 12 witch cave kith swamp.png\n 15 si Yenwood arrows.png\n</gallery>",
  "slug": "cockerelForest",
  "title": "Cockerel Forest"
}
