{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Crookspur.png\n| caption_map   = Exterior\n| image         = PE2 Crookspur Int 1.png\n| caption       = Fort\n| image2        = PE2 Crookspur Int 2.png\n| caption2      = Dungeons\n| name          = Crookspur\n| type          = Town\n| description   = \n| exits         = \n| sub_locations = Sea Cave (Crookspur){{!}}Sea Cave\n| merchant      = Merchant (Crookspur){{!}}Merchant;Seafol\n| innkeeper     = \n| inhabitants   = Auctioneer Marcca;Bauha;Handsome Eliam;Master Kua;Seafol;Taskmaster Grom\n| monsters      = Ogre cannoneer;Ogre cutthroat;Ogre deadeye\n| main_location = Crookspur Island\n| plants        = \n| expected_level= 12\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_14_slaver_port\n| internalname  = <small>AR_1401_Slaver_Port_Exterior<br/>AR_1402_Slaver_Port_Interior_01<br/>AR_1403_Slaver_Port_Dungeon_01</small>\n| guid          = 0d717f45-d300-4f1b-a08a-bacde7d722ef<br/>d86b3ff9-0f34-4b12-8750-2965befd3184<br/>0b270971-a0a1-482e-8194-7102685cc686\n| lsc           = \n| icon          = Icon Crookspur.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}. It is situated on [[Crookspur Island]], far to the northwest of [[Neketaka]].\n\n==Background==\nThis sinister keep belongs to the infamous [[Crookspur Slavers]]. Although slavery is illegal in the Deadfire Archipelago, the region is too vast to be adequately policed. Slavers operate at the fringes of contested waters and are quick to take advantage of an isolated Huana tribe or foreign ship in trouble. Crookspur is a hub for all slave traffic in the region, allowing wealthy buyers within the archipelago to import chattel from abroad.\n\n==Points of interest==\n* You land in the area to the southeast, using the dinghy. A woman by the name of [[Seafol]] will immediately talk to you if you move through the encampment to the west. There's also a merchant there who grants access to recruits and carries the unique [[Helm of the Falcon]] and other items.\n*There are two main ways into the fortress: By the main gate and through the sea cave. The main gate is operated by an ogre cannoneer. When you approach it, he will accost you and say that the auction is almost over. You can hurry him on and enter the keep, just in time to see the last slave being auctioned by [[Auctioneer Marcca]]: [[Handsome Eliam]]. The fort itself is a central courtyard surrounded by battlements, which means that if you screw up, you'll be at risk of being attacked from every side. The exit to the fort is to the northeast, while you can also skip directly to the dungeons through the ladder.\n;Fort\n* This is a luxurious area with a central office belonging to [[Master Kua]], head of the slavers, surrounded by a lengthy corridor, with the exit to the dungeons in the southwest. \n;Dungeons\n* The dungeons are a bit maze-like, with the exits located to the northeast (courtyard; this turns the fort hostile), northwest (fort; this also turns the fort hostile), and southwest (to the [[Sea Cave (Crookspur)|Sea Cave]], this allows for stealthily coming and going). Slavers both human and ogre patrol the corridors and will alert the entire fort if turned hostile. [[Bauha]] is in the cell to the southwest and can be rescued or used to incite a general slave uprising, clearing the way to the master.\n\n==Characters==\n* [[Merchant (Crookspur)|Merchant]], sells unique items, lists adventurers and crew for hire.\n* [[Auctioneer Marcca]], the salesman of the slavers.\n* [[Handsome Eliam]], a death godlike slave.\n* [[Master Kua]], head of the slavers.\n* [[Taskmaster Grom]], an ogre torturer.\n* [[Bauha]], Wahaki tribe warrior, locked in the dungeons.\n\n'''During [[A Shrewd Proposition]]'''\n* [[Seafol]], thief, merchant, and an agent of Aeldys.\n\n==Loot==\n* [[Helm of the Falcon]], [[Patinated Plate]], [[Grave Calling]]: Sold by the generic merchant at the encampment.\n* [[Misty]] - \"Orphaned Cat\": On the ramparts to the west.\n* [[Rex]] - \"Neglected Dog\": On the ramparts to the east.\n* [[The Willbreaker]]: In the dungeons, on a weapon rack to the north.\n* [[Shining Bulwark]]: In the fort interior, on a weapon rack to the east.\n\n==Quests==\nCrookspur is a major crossover point between a number of faction quests (similar to [[Storms of Poko Kohara]]), all of which can be run concurrently to each other, and involve the feud between the Crookspur slavers, and the Wahaki tribe islanders of [[Ori o Koīki]]. For the most part, these quests are split into two categories.\n\n;Assist the Crookspur slavers\n* [[Of Like Minds]] (Príncipi / VTC) - Follow [[Director Castol]]s orders, and assist the Príncipi by assisting the Crookspur slavers.\n* [[A Shrewd Proposition]] (Príncipi / VTC) - Side with [[Captain Furrante]] and help him earn the loyalty of the Crookspur slavers (and gain the political favor of a \"[[Director Castol|business partner]]\" of the VTC) by assisting the slavers with a problem with the locals.\n* [[Tip of the Spear]]: Assassinate the three Wahiki tribe leaders on [[Ori o Koīki]]. This will cause [[Fruitful Alliance]] to fail.\n;Get rid of the slavers (and free the slaves)\n* [[A Shrewd Proposition]] (Príncipi) - Side with [[Captain Aeldys]] by freeing the slavers to disrupt Furrante's apparent attempts to gain standing with the VTC.\n* [[Clearing Out Crookspur]] (Royal Deadfire Company) - Clear out the slavers and gain Crookspur as a strategic position for the RDC. This quest can be done separately to the other quests, with no repercussions, so it is recommended that you do it afterwards.\n* [[Fruitful Alliance]] (Huana) - Assist the Wahaki tribe to gain their allegiance to the Queen via the quest below.\n* [[Cruel Cargo]]: Free the Wahiki tribesman enslaved by the Crookspur slavers, then wipe them out entirely.\n\nSee [[A Shrewd Proposition]] for a detailed outline.\n\n==Gallery==\n'''Entering the Sea Cave from the beach to the east:'''\n<gallery mode=nolines>\n 14 crookspur cavern exploration.png\n 06 SI Old City Water 04.png\n Px2 07 spider tunnel 1.png\n PX2 04 SI iceFloe 03.png\n Px2 07 spider tunnel 6.png\n 06 SI Old City Water 05.png\n</gallery>",
  "slug": "crookspur",
  "title": "Crookspur"
}
