{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Document }} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = Deadfire Lines\n| icon           = poe2 note_crumpled icon.png\n| description    = Someone has scrawled the lyrics to a traditional sailor shanty on this ragged scrap of paper.\n\n\"I found my spine on the Deadfire Lines, Hoorah for the Deadfire Lines! From a Dyrwood babe to a sailor fine, Hoorah for the Deadfire Lines!\n\nNow Deadfire routes they make good time Hoorah for the Deadfire Lines! With the clear wide straits, and inlets fine Hoorah for the Deadfire Lines!\n\nOh they're the lines where you can shine Hoorah for the Deadfire Lines! They're the lines where I spent my prime Hoorah for the Deadfire Lines!\n\nJust take a trip to Port Maje Hoorah for the Deadfire Lines! To Port Maje where the sailors stay Hoorah for the Deadfire Lines!\n\nThen Vailian captains you'll see there Hoorah for the Deadfire Lines! With their knee-high boots, and fine dark hair Hoorah for the Deadfire Lines!\n\nOh around Cape White to Port Maje Hoorah for the Deadfire Lines! Oh around Cape White is a damn long way Hoorah for the Deadfire Lines!\n\nAround Cape White with a sky sail set Hoorah for the Deadfire Lines! Around Cape White and we’re ringing’ wet Hoorah for the Deadfire Lines!\n\nWell if we drown when we are young Hoorah for the Deadfire Lines! It’s better to be drowned than hung Hoorah for the Deadfire Lines!\"\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Document\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 15\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Shanty_Deadfire_Lines\n| location       = \n| guid           =78293f63-ba38-4d16-a623-2257893f4f5f\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Document }} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "deadfireLines",
  "title": "Deadfire Lines"
}
