{
  "markdown": "The Drowned Kingdom;The Endless Queries (quest){{!}}The Endless Queries;The Bridge Ablaze (quest){{!}}The Bridge Ablaze\n| internalname = LAX02_qst_critical_path_quest_03\n| guid         = c7170ab3-fb8d-440f-887e-1d36a9eb2cd8\n}}\n'''{{PAGENAME}}''' is a [quest](/pillarsOfEternityIiDeadfireQuestsBeastOfWinter/) in {{bow}}.\n\n## Synopsis\n\n \nAgainst their better judgement, the Watcher struck a bargain with [Rymrgand](/rymrgand/): In return for access to the Void and finding the means to close the Vydmath, they will hunt down [Neriscyrlas](/neriscyrlas/), a dracolich that bruises Rymrgand's ego with every moment she spends flouting his laws. The hunt begins by stepping through the portal.\n\n## Walkthrough\n\n* After conversing with Rymrgand (and provided you didn't tell the god of death to fuck right off), enter the portal to appear in [the Shattered Passage](/theShatteredPassage/). Move north through the Soul Collector to meet the dracolich as she tears apart [Rynhaedr](/rynhaedr/). She will be amused, refuse to answer your questions, then promptly break through the floor and fly off. You're left with the task of putting [Rynhaedr](/rynhaedr/) back together. Find the wandering souls at the entrances to all the three side areas, then talk to the fourth soul. Rynhaedr is surprisingly pleasant and engenders a lot of comments from Vatnir and Ydwin, if present. She will direct your searches to the three areas that persist in the White Void, each tied to major events across Eora's history: Ancient Huana, post-Ascension Engwith, and the Saint's War.\n* Completing the quest hinges on completing the related quests: The Drowned Kingdom, the Endless Queries, and the Bridge Ablaze, each tied to a specific moment in Eora's history. The souls sustaining these decaying domains can provide magical aid to protect the Watcher as you descend deeper into Ryrmgand's domain. Alternatively, destroying them to please Rymrgand is another choice, as is releasing them back to the Wheel by having them join the evergrowing train of Souls following the Watcher. Its recommended that you go to The Bridge Ablaze first, since it contains a sundial that will let you use beams of light to manipulate time. Also you can get Betrayal by speaking to the spirit in The Endless Queries, which allows you to posses certain characters in the memories, which makes other quests easier.\n* After dealing with each of the three realms, you can jump into the void in the center, close to the heart of the god's domain. You appear in [Neriscyrlas' Lair](/neriscyrlasLair/), built around an ancient Engwithan phylactery that keeps her alive (or deathless). Any souls that pledged themselves to aid you will appear and provide unique bonuses. Each bonus can be activated by stepping on a circle in front of  the corresponding soul (this also grants 50% damage bonus against Neriscyrlas for 45 seconds) and can be used multiple times throughout the battle (but has a cooldown):\n** Navixa will immobilize the dragon using chains.\n** The King will call a powerful wave that will daze the dragon.\n** Waidwen will call a firestorm onto the dragon.\n* When you approach the center, Neriscyrlas will engage you in conversation. She will reveal a great many facts, including the fact that she's anchored to a relic that allows her to defy the Beast of Winter and that she knows the gods' real nature. \n*The Watcher has several options to deal with Neriscyrlas:\n**You can talk her down with '''Insight 13''' and '''Arcana 13''' and suggest that you take her phylactery out with you, either because \"that's what you do\" ('''Diplomacy 11''') or make a deal to do it if she joins forces and helps you destroy Eothas. If you are a wizard, after passing the previous checks you can ask Neriscyrlas to teach you how to make your own phylactery with Diplomacy 13 and saying you will use it for knowledge or to serve her.\n**You can have her attack Rymrgand. Simply asking if she knows how long she's been down here, and if she's considered taking the fight to Rymrgand, you can, with '''Arcana 17''', speculate that Rymrgands's essence can be divided between herself and the relic, thus leaving her strong enough to escape. This can also be accomplished with a high '''Bluff (19)''' check. She will then leave her lair to attack Rymrgand.\n***''There's also options which consider the nature and truth of the gods, but they doesn't seem to be required to get her to attack him.''\n***Upon confronting Rymrgand, you will see him engaged in a rather one-sided battle with Neriscyrlas, destroying her with ease. He will not be pleased with you for convincing the dragon to attack him—he did ask you to kill her after all—and will attack you no matter which conversation option you choose. \n**You can talk her into laying herself to rest. Ask her if she knows how long she's been here and why she hasen't given up yet. Cruelly pointing out that this isn' life; she's already dead; that she desperately clings to an eternity of endless, futile struggle, even after many centuries. The Watcher can convince her to let go, and take her well deserved respite on the Void. She will finally relent and admit that she does indeed feel very, very tired. Then she finally let go. \n***Vatnir will tell her to rest; she's earned it. Not surprisingly, Neriscyrlas likes him more than she does you. Serafen will point out that somehow this doesn't feel like a very happy ending, and Edér will point out the wisdom of learning to forgive onself so that one may move on with a clear conscience.\n***This option seems to only be available if you convinced Navixa, the King and Waidwen to let go and rest in the White Void during the previous quests. \n***''There does not seem to be any skill checks required for this option.''\n**The last and most obvious option is to fight her. \n*Once defeated, the game transitions into a scripted interaction, where you need to tear out her phylactery. With '''Athletics 15''' or with spells you can have a character rip it out without taking damage.\n*Regardless of whether you convinced Neriscyrlas to be carried out in her phylactery, let go of her endless struggle, had her redirect her ire, or laid the ancient creature to rest, the floor promptly falls out from under your feet and you're dumped in the heart of the White Void. Make your way to the northwest. [Ydwin](/ydwin/) will act uncharacteristically nervous, while [Vatnir](/vatnir/) will be quite impressed. Move forward and meet a partially-ruined spirit that will ask for release or at least ability to tag along to meet the Beast of Winter.\n* Make your way further through the glacier, killing the scourges and dealing with the souls. Watch out for the winds, they don't cause injuries, but do deal damage and add the [Frightened](/statusEffectsDeadfireAfflictions/) affliction (a Chanter chanting [One Dozen Stood](/oneDozenStoodAgainstThePowerOfTheSaintDeadfire/) can help here). \n*You will find [the Beast of Winter](/theBeastOfWinter/) in the northwestern corner. If the dragon was killed or convinced to stay inside the phylactery, Rymrgand will ask for the phylactery from you so that he can \"cleanse it of the dragon's taint\". The Watcher is free to refuse, or give it to him.\n**If the dragon was not killed, i.e. convined her to move inside the phylactery so that you may take her outside, and you give it to him to cleanse, the soul of Neriscyrlas will call you out for betrayal and lying, before vanishing into oblivion.\n*After dealing with the phylactery, he will renege on the agreement and declare that he will let you free if you pledge your soul to him, so that it returns not to the Wheel, but the White Void. You can accept this trade, consigning your soul to permadeath, trade him [Ydwin](/ydwin/), the renegade Glamfellen (much to the utter horror of the rest of your party), or refuse to do so - and fight the Beast of Winter. It is a difficult fight, more so due to the fact that you are immediately attacked by shambling souls as well. If you defeat the Beast, Rymrgand will be amused and allow you to leave the Void intact and with no other obligations. \n** You can safely ask the god why he is a jerk. His answer? It's in his nature. Perfect.\n* Although the quest resolves at this point, the final ending takes place at Harbinger's Watch, where you meet Hafbjorn. Your choices here determine whether [Vatnir](/vatnir/) remains in your party or not and the ending for the Watch, as you can convince the people of Harbinger's Watch to resettle at the White.\n**If you left Neriscyrlas alive, you can show off you Dragon-in-a-Bottle to the people at Harbinger's Watch.\n**If you convinced her to let go and embrace oblivion, you can tell of how you talked her to death.\n*You can also reenter the The Shattered Passage after dealing with [Neriscyrlas](/neriscyrlas/) and tell [Rynhaedr](/rynhaedr/) of the dragon's fate. If it was killed, she will be pleased and finally give in to oblivion. Sadly, she leaves no loot behind. If the dragon was preserved in its phylactery, she will be angry with you and continue to guard the Void for eternity, in case the dragon should return.\n\n## Loot\n\nThere are a few combinations available:\n* Defeat the dragon, but not the Beast: [Neriscyrlas' Hope](/neriscyrlasHope/) and [Whispers of Neriscyrlas](/whispersOfNeriscyrlas/)\n* Defeat both the dragon and the Beast: [Neriscyrlas' Hope](/neriscyrlasHope/), [Whispers of Neriscyrlas](/whispersOfNeriscyrlas/) and [Frostfur Mantle](/frostfurMantle/)\n* Help the dragon or have her attack the Beast: [Neriscyrlas' Hope](/neriscyrlasHope/) and [Frostfur Mantle](/frostfurMantle/)\n** You will not get to loot Neriscyrlas' corpse after Rymrgand kills her, so you won't get her skull ([Whispers of Neriscyrlas](/whispersOfNeriscyrlas/)).\n** Rymrgand will attack you, no matter what dialogue option you choose, so you will get a chunk of his fur ([Frostfur Mantle](/frostfurMantle/)).\n*Neriscyrlas lets herself be taken by the Void, but you don't defeat the Beast: [Neriscyrlas' Hope](/neriscyrlasHope/) and [Whispers of Neriscyrlas](/whispersOfNeriscyrlas/)\n*Neriscyrlas lets herself be taken by the Void, and you defeat the Beast: [Neriscyrlas' Hope](/neriscyrlasHope/), [Whispers of Neriscyrlas](/whispersOfNeriscyrlas/) and [Frostfur Mantle](/frostfurMantle/)\n\n<br />\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/LAX02_01_Iceberg_Dungeon/LAX02_qst_critical_path_quest_03.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''Death's Depthless Dominion'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| I've entered the bitterly cold realm of <b>Rymrgand</b>. Only by hunting down the dragon <b>Neriscyrlas</b> can I hope to close the <b>Vytmádh</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Locate the dragon.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| I've arrived in the Beyond but have yet to find the dragon <b>Neriscyrlas</b>. I must press deeper into Rymrgand's frigid domain if I'm to locate her.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| If I'm to face <b>Neriscyrlas</b>, I must search the <b>Shattered Passage</b> for some way to pursue the dragon.\n|-\n| rowspan=\"5\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Search the echo realms and appeal to the souls sustaining them.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| Neriscyrlas took refuge in her lair, deep within the White Void. The guardian Rynhaedr warned me against descending deeper into Rymrgand's realm without the aid of those who call it home.\n\nI could search these <b>decaying domains</b> for magical aid and perhaps enlist the aid of the <b>souls</b> who keep them afloat above the pale abyss.\n\nAlternatively, I could destroy the souls, consigning their essence to Rymrgand in a bid to secure the god's elusive gratitude.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| I located <b>King Wingauro o Watūri I</b> in the <b>Drowned Kingdom</b> and forced him to face the consequences of his actions.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I released the shackled spirit of <b>Inquisitor Naxiva</b> from her endless interrogation.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I freed <b>St. Waidwen</b> from the cycle of destruction at <b>Godhammer Bridge</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Enter the dragon's lair.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| There's little more I can do in Rymrgand's realm to prepare for my confrontation with <b>Neriscyrlas</b>.\n\nIf I'm to pursue her, I must descend into the pit she opened in the <b>Shattered Passage</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Escape the White Void.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| After I confronted her, Neriscyrlas' lair crumbled, dumping me into the bleak tundra of the White Void.\n\nRymrgand and Rynhaedr both warned me that there is no returning from these depths. If I'm to prove them wrong and return to Eora, I'll need to scour the realm for <b>a way out</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''12'''\n| colspan=\"2\" | '''Collect the Soul Fragments.'''\n|-\n| style=\"vertical-align:text-top\" | 10012\n| I witnessed a spirit attack Neriscyrlas - only for the dragon to tear it apart. If I can locate the pieces of the spirit, perhaps I can reassemble it and learn more about the dragon.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| I found a piece of the guardian's <b>fragmented soul</b>. If I locate the others, perhaps they can tell me more about <b>Neriscyrlas</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''13'''\n| colspan=\"2\" | '''Confront Neriscyrlas.'''\n|-\n| style=\"vertical-align:text-top\" | 10013\n| I've descended into <b>Neriscyrlas' Lair.</b> \n\nNow I've no choice but to face the dragon that has blighted <b>Rymrgand's</b> Realm.\n\n|-\n! colspan=\"3\" | Unused strings\n|-\n| rowspan=\"1\" style=\"vertical-align:text-top; text-align:center\" | '''-'''\n| style=\"vertical-align:text-top\" | 20001\n| [Description of meeting with Vailian lost soul.]\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| <b>Rymrgand</b> agreed to release me from <b>the Beyond</b> - all I had to promise him was my <b>soul</b>. When I die, my soul will be destroyed in the <b>White Void</b>, never to be incarnated again.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| <b>Rymrgand</b> accepted my pledge to act as his <b>champion</b> in Eora and returned me to the world of the living.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I convinced <b>Rymrgand</b> to return me to the world of the living as a reward for destroying the souls of <b>King Wingauro o Watūri I</b>, <b>Inquisitor Naxiva ix Kirent</b>, and <b>St. Waidwen</b>.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| I convinced <b>Rymrgand</b> to return me to the world of the living, reminding him of my past service in his name.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30004\n| I stood up against <b>Rymrgand</b> and bested his champion in combat. He unceremoniously dumped me back into the world of the living.\n\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30005\n| I sacrificed <b>Ydwin</b> to <b>Rymrgand</b> in exchange for my own release from <b>the Beyond</b>.\n|}",
  "raw": "{{Infobox quest poe2\n| name         = Death's Depthless Dominion\n| image        = BOW Neriscyrlas End.png\n| caption      = \n| added_in     = bow\n| quest_type   = Main quest\n| quest_region = The Dead Floe\n| quest_level  = 15\n| faction      = \n| locations    = Temple of Decline;The Shattered Passage\n| main_npcs    = Rynhaedr;Neriscyrlas\n| companion    = Vatnir;Ydwin\n| quest_giver  = \n| xp_amount    = 1800\n| xp_type      = Major\n| xp_level     = 15\n| xp_weights   = 1;1;1;1;1;1\n| rewardname1  = Defeat the dragon\n| reward1      = [[Neriscyrlas' Hope]] and [[Whispers of Neriscyrlas]]\n| rewardname2  = Defeat the dragon and the Beast\n| reward2      = [[Neriscyrlas' Hope]] and [[Whispers of Neriscyrlas]];[[Frostfur Mantle]]\n| rewardname3  = Help the dragon or have her attack the Beast \n| reward3      = [[Neriscyrlas' Hope]];[[Frostfur Mantle]]   \n| rewardname4  =\n| reward4      =\n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = To Rise and Decline\n| conc         = The Drowned Kingdom (quest){{!}}The Drowned Kingdom;The Endless Queries (quest){{!}}The Endless Queries;The Bridge Ablaze (quest){{!}}The Bridge Ablaze\n| internalname = LAX02_qst_critical_path_quest_03\n| guid         = c7170ab3-fb8d-440f-887e-1d36a9eb2cd8\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests#Beast of Winter|quest]] in {{bow}}.\n\n==Synopsis== \nAgainst their better judgement, the Watcher struck a bargain with [[Rymrgand]]: In return for access to the Void and finding the means to close the Vydmath, they will hunt down [[Neriscyrlas]], a dracolich that bruises Rymrgand's ego with every moment she spends flouting his laws. The hunt begins by stepping through the portal.\n\n==Walkthrough==\n* After conversing with Rymrgand (and provided you didn't tell the god of death to fuck right off), enter the portal to appear in [[the Shattered Passage]]. Move north through the Soul Collector to meet the dracolich as she tears apart [[Rynhaedr]]. She will be amused, refuse to answer your questions, then promptly break through the floor and fly off. You're left with the task of putting [[Rynhaedr]] back together. Find the wandering souls at the entrances to all the three side areas, then talk to the fourth soul. Rynhaedr is surprisingly pleasant and engenders a lot of comments from Vatnir and Ydwin, if present. She will direct your searches to the three areas that persist in the White Void, each tied to major events across Eora's history: Ancient Huana, post-Ascension Engwith, and the Saint's War.\n* Completing the quest hinges on completing the related quests: The Drowned Kingdom, the Endless Queries, and the Bridge Ablaze, each tied to a specific moment in Eora's history. The souls sustaining these decaying domains can provide magical aid to protect the Watcher as you descend deeper into Ryrmgand's domain. Alternatively, destroying them to please Rymrgand is another choice, as is releasing them back to the Wheel by having them join the evergrowing train of Souls following the Watcher. Its recommended that you go to The Bridge Ablaze first, since it contains a sundial that will let you use beams of light to manipulate time. Also you can get Betrayal by speaking to the spirit in The Endless Queries, which allows you to posses certain characters in the memories, which makes other quests easier.\n* After dealing with each of the three realms, you can jump into the void in the center, close to the heart of the god's domain. You appear in [[Neriscyrlas' Lair]], built around an ancient Engwithan phylactery that keeps her alive (or deathless). Any souls that pledged themselves to aid you will appear and provide unique bonuses. Each bonus can be activated by stepping on a circle in front of  the corresponding soul (this also grants 50% damage bonus against Neriscyrlas for 45 seconds) and can be used multiple times throughout the battle (but has a cooldown):\n** Navixa will immobilize the dragon using chains.\n** The King will call a powerful wave that will daze the dragon.\n** Waidwen will call a firestorm onto the dragon.\n* When you approach the center, Neriscyrlas will engage you in conversation. She will reveal a great many facts, including the fact that she's anchored to a relic that allows her to defy the Beast of Winter and that she knows the gods' real nature. \n*The Watcher has several options to deal with Neriscyrlas:\n**You can talk her down with '''Insight 13''' and '''Arcana 13''' and suggest that you take her phylactery out with you, either because \"that's what you do\" ('''Diplomacy 11''') or make a deal to do it if she joins forces and helps you destroy Eothas. If you are a wizard, after passing the previous checks you can ask Neriscyrlas to teach you how to make your own phylactery with Diplomacy 13 and saying you will use it for knowledge or to serve her.\n**You can have her attack Rymrgand. Simply asking if she knows how long she's been down here, and if she's considered taking the fight to Rymrgand, you can, with '''Arcana 17''', speculate that Rymrgands's essence can be divided between herself and the relic, thus leaving her strong enough to escape. This can also be accomplished with a high '''Bluff (19)''' check. She will then leave her lair to attack Rymrgand.\n***''There's also options which consider the nature and truth of the gods, but they doesn't seem to be required to get her to attack him.''\n***Upon confronting Rymrgand, you will see him engaged in a rather one-sided battle with Neriscyrlas, destroying her with ease. He will not be pleased with you for convincing the dragon to attack him—he did ask you to kill her after all—and will attack you no matter which conversation option you choose. \n**You can talk her into laying herself to rest. Ask her if she knows how long she's been here and why she hasen't given up yet. Cruelly pointing out that this isn' life; she's already dead; that she desperately clings to an eternity of endless, futile struggle, even after many centuries. The Watcher can convince her to let go, and take her well deserved respite on the Void. She will finally relent and admit that she does indeed feel very, very tired. Then she finally let go. \n***Vatnir will tell her to rest; she's earned it. Not surprisingly, Neriscyrlas likes him more than she does you. Serafen will point out that somehow this doesn't feel like a very happy ending, and Edér will point out the wisdom of learning to forgive onself so that one may move on with a clear conscience.\n***This option seems to only be available if you convinced Navixa, the King and Waidwen to let go and rest in the White Void during the previous quests. \n***''There does not seem to be any skill checks required for this option.''\n**The last and most obvious option is to fight her. \n*Once defeated, the game transitions into a scripted interaction, where you need to tear out her phylactery. With '''Athletics 15''' or with spells you can have a character rip it out without taking damage.\n*Regardless of whether you convinced Neriscyrlas to be carried out in her phylactery, let go of her endless struggle, had her redirect her ire, or laid the ancient creature to rest, the floor promptly falls out from under your feet and you're dumped in the heart of the White Void. Make your way to the northwest. [[Ydwin]] will act uncharacteristically nervous, while [[Vatnir]] will be quite impressed. Move forward and meet a partially-ruined spirit that will ask for release or at least ability to tag along to meet the Beast of Winter.\n* Make your way further through the glacier, killing the scourges and dealing with the souls. Watch out for the winds, they don't cause injuries, but do deal damage and add the [[Status effects (Deadfire)#Afflictions|Frightened]] affliction (a Chanter chanting [[One Dozen Stood Against the Power of the Saint (Deadfire)|One Dozen Stood]] can help here). \n*You will find [[the Beast of Winter]] in the northwestern corner. If the dragon was killed or convinced to stay inside the phylactery, Rymrgand will ask for the phylactery from you so that he can \"cleanse it of the dragon's taint\". The Watcher is free to refuse, or give it to him.\n**If the dragon was not killed, i.e. convined her to move inside the phylactery so that you may take her outside, and you give it to him to cleanse, the soul of Neriscyrlas will call you out for betrayal and lying, before vanishing into oblivion.\n*After dealing with the phylactery, he will renege on the agreement and declare that he will let you free if you pledge your soul to him, so that it returns not to the Wheel, but the White Void. You can accept this trade, consigning your soul to permadeath, trade him [[Ydwin]], the renegade Glamfellen (much to the utter horror of the rest of your party), or refuse to do so - and fight the Beast of Winter. It is a difficult fight, more so due to the fact that you are immediately attacked by shambling souls as well. If you defeat the Beast, Rymrgand will be amused and allow you to leave the Void intact and with no other obligations. \n** You can safely ask the god why he is a jerk. His answer? It's in his nature. Perfect.\n* Although the quest resolves at this point, the final ending takes place at Harbinger's Watch, where you meet Hafbjorn. Your choices here determine whether [[Vatnir]] remains in your party or not and the ending for the Watch, as you can convince the people of Harbinger's Watch to resettle at the White.\n**If you left Neriscyrlas alive, you can show off you Dragon-in-a-Bottle to the people at Harbinger's Watch.\n**If you convinced her to let go and embrace oblivion, you can tell of how you talked her to death.\n*You can also reenter the The Shattered Passage after dealing with [[Neriscyrlas]] and tell [[Rynhaedr]] of the dragon's fate. If it was killed, she will be pleased and finally give in to oblivion. Sadly, she leaves no loot behind. If the dragon was preserved in its phylactery, she will be angry with you and continue to guard the Void for eternity, in case the dragon should return.\n\n==Loot==\nThere are a few combinations available:\n* Defeat the dragon, but not the Beast: [[Neriscyrlas' Hope]] and [[Whispers of Neriscyrlas]]\n* Defeat both the dragon and the Beast: [[Neriscyrlas' Hope]], [[Whispers of Neriscyrlas]] and [[Frostfur Mantle]]\n* Help the dragon or have her attack the Beast: [[Neriscyrlas' Hope]] and [[Frostfur Mantle]]\n** You will not get to loot Neriscyrlas' corpse after Rymrgand kills her, so you won't get her skull ([[Whispers of Neriscyrlas]]).\n** Rymrgand will attack you, no matter what dialogue option you choose, so you will get a chunk of his fur ([[Frostfur Mantle]]).\n*Neriscyrlas lets herself be taken by the Void, but you don't defeat the Beast: [[Neriscyrlas' Hope]] and [[Whispers of Neriscyrlas]]\n*Neriscyrlas lets herself be taken by the Void, and you defeat the Beast: [[Neriscyrlas' Hope]], [[Whispers of Neriscyrlas]] and [[Frostfur Mantle]]\n\n<br />\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/LAX02_01_Iceberg_Dungeon/LAX02_qst_critical_path_quest_03.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''Death's Depthless Dominion'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| I've entered the bitterly cold realm of <b>Rymrgand</b>. Only by hunting down the dragon <b>Neriscyrlas</b> can I hope to close the <b>Vytmádh</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Locate the dragon.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| I've arrived in the Beyond but have yet to find the dragon <b>Neriscyrlas</b>. I must press deeper into Rymrgand's frigid domain if I'm to locate her.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| If I'm to face <b>Neriscyrlas</b>, I must search the <b>Shattered Passage</b> for some way to pursue the dragon.\n|-\n| rowspan=\"5\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Search the echo realms and appeal to the souls sustaining them.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| Neriscyrlas took refuge in her lair, deep within the White Void. The guardian Rynhaedr warned me against descending deeper into Rymrgand's realm without the aid of those who call it home.\n\nI could search these <b>decaying domains</b> for magical aid and perhaps enlist the aid of the <b>souls</b> who keep them afloat above the pale abyss.\n\nAlternatively, I could destroy the souls, consigning their essence to Rymrgand in a bid to secure the god's elusive gratitude.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| I located <b>King Wingauro o Watūri I</b> in the <b>Drowned Kingdom</b> and forced him to face the consequences of his actions.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I released the shackled spirit of <b>Inquisitor Naxiva</b> from her endless interrogation.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I freed <b>St. Waidwen</b> from the cycle of destruction at <b>Godhammer Bridge</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Enter the dragon's lair.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| There's little more I can do in Rymrgand's realm to prepare for my confrontation with <b>Neriscyrlas</b>.\n\nIf I'm to pursue her, I must descend into the pit she opened in the <b>Shattered Passage</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Escape the White Void.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| After I confronted her, Neriscyrlas' lair crumbled, dumping me into the bleak tundra of the White Void.\n\nRymrgand and Rynhaedr both warned me that there is no returning from these depths. If I'm to prove them wrong and return to Eora, I'll need to scour the realm for <b>a way out</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''12'''\n| colspan=\"2\" | '''Collect the Soul Fragments.'''\n|-\n| style=\"vertical-align:text-top\" | 10012\n| I witnessed a spirit attack Neriscyrlas - only for the dragon to tear it apart. If I can locate the pieces of the spirit, perhaps I can reassemble it and learn more about the dragon.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| I found a piece of the guardian's <b>fragmented soul</b>. If I locate the others, perhaps they can tell me more about <b>Neriscyrlas</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''13'''\n| colspan=\"2\" | '''Confront Neriscyrlas.'''\n|-\n| style=\"vertical-align:text-top\" | 10013\n| I've descended into <b>Neriscyrlas' Lair.</b> \n\nNow I've no choice but to face the dragon that has blighted <b>Rymrgand's</b> Realm.\n\n|-\n! colspan=\"3\" | Unused strings\n|-\n| rowspan=\"1\" style=\"vertical-align:text-top; text-align:center\" | '''-'''\n| style=\"vertical-align:text-top\" | 20001\n| [Description of meeting with Vailian lost soul.]\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| <b>Rymrgand</b> agreed to release me from <b>the Beyond</b> - all I had to promise him was my <b>soul</b>. When I die, my soul will be destroyed in the <b>White Void</b>, never to be incarnated again.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| <b>Rymrgand</b> accepted my pledge to act as his <b>champion</b> in Eora and returned me to the world of the living.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I convinced <b>Rymrgand</b> to return me to the world of the living as a reward for destroying the souls of <b>King Wingauro o Watūri I</b>, <b>Inquisitor Naxiva ix Kirent</b>, and <b>St. Waidwen</b>.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| I convinced <b>Rymrgand</b> to return me to the world of the living, reminding him of my past service in his name.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30004\n| I stood up against <b>Rymrgand</b> and bested his champion in combat. He unceremoniously dumped me back into the world of the living.\n\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30005\n| I sacrificed <b>Ydwin</b> to <b>Rymrgand</b> in exchange for my own release from <b>the Beyond</b>.\n|}",
  "slug": "deathsDepthlessDominion",
  "title": "Death's Depthless Dominion"
}
