{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Journal }} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = Diary of an Unnamed Pirate\n| icon           = poe2 book_angfors_journal icon.png\n| description    = Excerpt from the diary of an unnamed pirate about the lost vessel Fisher Queen.\n\n\"'The sea is every inch Ondra's blood, every inch her tears, and though it be Amira's breath what moves us through it, it's only by Ondra's will we don't drown in her holy viscera. Court her wrath at your peril, 'cause she don't know the meaning of mercy.'\n\nAn old-timer told me that on my first time out of port, and that crusty bastard never knew when to quit flapping him gums, so I never believed a word he said. ''I'' never saw the goddess herself rise up out of the depths and put her watery hand to a vessel. The winds and waves - those were ''earthly'' threats. The gods got better shit to do than torment us.\n\n'Course, that was all 'fore I started shipping aboard the ''Fisher Queen''.\n\nWreck of a man found me in the Mare in Neketaka - one eye, scars all up 'n down his face, a real pirate's pirate. Sidled up to me at the bar like we were old friends. 'Look like you know yer way about some rigging,' he said. Thought he was trying to pick me up at first, and I nearly let him do it. Instead, he laughed. 'Got my eye on some special game,' he said, 'and we're gonna need the best there is to bring it down.'\n\nNow, I don't give two half-shits about prestige. Pump up my ego all you want - what kind of coin you offering? Well, he was offering good coin indeed. So, I went with him. Dumb fucking thing to do, but what did I know? Nothing. Not a gods damned thing. That's clear as the morning to me now.\n\nWe were hunting maidens. Maiden-flesh, really. Wasn't a delicacy nowhere, but my new friend, the one-eyed sailor, was aiming to make it one. Start a craze. Cash in. Buy a nice little island out from under the locals and spend his remaining days laid out on a black sand beach with a jug of palm wine in the crook of one arm and a ready lover in the other.\n\nNow, you hear ''stories'' about those beasts. We all hear stories. Sailors lured to their deaths by the maiden of the depths and her handmaidens, unable to resist the beauty of their mournful song. Sounds like bullshit, doesn't it?\n\nWe found a pack out near the Ofecchia Channel, hunting tuna. They had the look of handsome ladies from a distance - tails long as a stormy night and slick as a salt-drenched deck, hair like seaweed with wide, comely smiles. So, we netted a few and dragged them on deck. Wasn't even hard. It was like they wanted to be caught.\n\nThey hissed and screamed as we readied our knives, and too soon we realized our mistake. We discovered their rows of serrated shark's teeth and unhinged jaws when one of them swallowed Yaryc whole, and we learned too late about the poisoned barbs on their hips when Gavril grappled with a pair and started vomiting up chunks of congealed black blood. And the glitter in their sclera-less eyes, dark blue and deep as Ondra's own void, I came to know when one took my right arm clean off at the elbow.\n\nAs if that wasn't grim enough, that night, the Lady of Lament got her revenge on the ''Fisher Queen'' for our transgression - we lost our mainmast, all our fresh water, and four men overboard in a storm the likes of which I haven't seen since. We drifted for a week before a Vailian merchant ship found us.\n\nAnd the great irony of it all was... the maidens tasted like shit.\"\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Journal\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 0\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Pirate_Diary\n| location       = \n| guid           =091921eb-b000-4f33-9b0c-d3e91d8793bf\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Journal }} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "diaryOfAnUnnamedPirate",
  "title": "Diary of an Unnamed Pirate"
}
