{
  "markdown": "''' Edér Teylecg''' is a male [human](/human/) [fighter](/fighter/) and recruitable [companion](/companion/) in {{poe1}} and {{poe2}}. \n\nHe can be recruited in [Gilded Vale](/gildedVale/) after completing [Visions and Whispers](/visionsAndWhispers/). In the sequel, he's automatically a part of your party.\n\n## Background\n\nEdér is a 32 year old, broad man with straw-colored hair, a light beard<ref name=\"strategyguide\">Pillars of Eternity Collector's Edition Guide, pg. 122</ref> and stands 6'2\" (188&nbsp;cm) tall. His scale armor, blade, and pipe are his most easily recognizable attributes — together with a laid-back, blackly humorous outlook on life. Expect no less from a veteran of the [Saint's War](/saintsWar/). Though people tend to dismiss him as somewhat of a simpleton due to his appearance, background, and partiality to enjoying smoking [whiteleaf](/whiteleaf/), Edér often proves to surprisingly observant of his surroundings and rather well-articulated.\n\nEdér hails from [Gilded Vale](/gildedVale/), the little village out on Dyrwood's frontier. The youngest son of two farmers, he grew up alongside his older brother, [Woden](/wodenTeylecg/). Despite some occasional sibling rivalry with Woden, Edér by and large idolized his brother and looked up to him. Like their parents, he and Woden were devotees of [Eothas](/eothas/) for much of their early life, but this changed forever when St. Waidwen overthrew [Readceras](/readceras/) and turned it into a theocracy with him as the living incarnate of Eothas. As he marched his armies down into Dyrwood, thereby starting the Saint's War, Woden decided to enlist, much to the chagrin of his family. Both his parents and Edér argued that he should remain with his people, rather than go to war against his own god. Edér, in a fit of rage, had a major fight with his brother, flinging every horrid thing he could think of at him — and failing to convince him. A few months later, Edér decided that his brother might be right after all and followed his lead, enlisting with the Dyrwoodan army.<ref name=\"fragmentsquest\">[Fragments of a Scattered Faith](/fragmentsOfAScatteredFaith/)</ref>\n\nHe did not believe Waidwen to be the true incarnation of Eothas because of his punishment of non-believers, more akin to a vengeful god like [Skaen](/skaen/) or [Woedica](/woedica/) than the god of light. However, he wasn't aware that Woden wound up fighting for Readceras, turning away from [Defiance Bay](/defianceBay/) and marching to [Readceras](/readceras/), enlisting with Waidwen's army... And eventually perishing in the Third Battle of [Clîaban Rilag](/cliabanRilag/).<ref name=\"fragmentsquest\">[Fragments of a Scattered Faith](/fragmentsOfAScatteredFaith/)</ref> Edér continued to serve with distinction, right up to the 'Dyrwoodan Hello' at Halgot Citadel, when Waidwen found himself at the receiving end of the Godhammer bomb. Edér returned to Gilded Vale alongside his captain, trying to find solace after the experience of the war and loss of his brother.\n\nWelcomed as a hero, he quickly found employment on a farm, with his former captain becoming his headman. However, as the [Hollowborn crisis](/waidwensLegacy/) intensified and [the Purges](/saintsWarEothasianPurges/) of Eothasian followers began, rumors began to circulate that his brother actually fought for Readceras. Edér was saved from the noose by his war record and his headman's vouching for him, but the rumors planted a seed of doubt in his mind about the true loyalties of his brother. The prejudice against Eothasians only intensified with time. Edér's parents eventually grew concerned for their own safety and moved across the ocean to [Aedyr](/aedyrEmpire/), with Edér staying behind out of habit. His luck held for a while, even as the tree in the courtyard of the former Eothasian temple in Gilded Vale filled with followers of the [Splintered God](/eothas/).<ref name=\"introdialog\">Edér's into dialog in Gilded Vale</ref>\n\nHowever, by the time the [Watcher](/watcher/) came to Gilded Vale, Edér's luck was running out. As the sole remaining worshipper of Eothas, he reasoned that was only a matter of time until [Raedric's](/raedricVii/) goons found an excuse to hoist him on the tree as the nineteenth victim of the Lord's madness.\n\n## ={{poe1}}\n\n=\nEdér joins the Watcher, seeing an opportunity to help him learn the fate of [Woden](/wodenTeylecg/) in the [Saint's War](/saintsWar/).\n\nIf Edér's personal quest is left unresolved and he therefore didn't find out the details about what happened to Woden, Edér grows disillusioned with his life in the Dyrwood and decides to journey over the ocean to Aedyr, to be with his parents. However, if his quest is completed, and depending on whether the Watcher reinforced his belief in the gods or encouraged him to find a new way in life, Edér either finds a new calling in Dyrford or strengthens his faith as an Eothasian.\n\nTraveling with the Watcher proved to be the adventure of his life. A simple farmer from Gilded Vale wound up taking down the head of an [ancient cult](/leadenKey/), learning the truth about the gods, and eventually deciding to take his life further.\n\n## ={{poe2}}\n\n=\n''If Edér joined the Night Market'': Edér joined the Night Market after meeting a member of the organization in typical Eder fashion: Bashing his head into the target after a game of Orlan's Head went awry. When the man noticed the symbol of Eothas that Edér carried of his chest, the two started talking — and a month or two later, Edér was introduced to the group. Most of the time, he helped Eothasians get out of bad situations, setting them up with better jobs, though the usual power struggles within the group cost a few of their charges their lives — something Edér isn't quite sure was necessary.\n\n''If Edér became mayor of Dyrford'': Inspired by the Watcher's example to be more proactive in helping out people, rather than relying on the gods to do so, Edér remembered the small village of Dyrford that him and the Watcher had journey through previously and how the place had plenty of problems, and so he journeyed there hoping to offer whatever help he could in getting the village back on its feet. Upon arriving Edér sought out Dyrford's mayor, and arranged a meeting with him. The mayor, however, turned out to be a member of the secret Skaen cult in the area, and tried to attack Edér off-guard, but Edér made short work of him and chopped his head clean off. Upon emerging from the fight with the mayor's head in his hand, the villagers hailed Edér as a hero and quickly pronounced him their new mayor, and his position was soon confirmed by the local  thayn. Under Edér's rule he drove out the last of Skaen's kind and enforcing his own brand of frontier justice and brought some life back into the ailing village by drawing in settlers with promises of free land, a trick he had learned from someone else. Life was fair and safe under his rule... Though he was always missing something, or rather someone: Someone to show his work to. Someone like Elafa.\n\n''If Edér went back to his parents in Aedyr'': Edér was welcomed back by open arms by his mother and father, and soon settled down for some time in his old work as farmhand at their farm. The peaceful times did not last for long though, as some of the bad blood towards Eothasian worshipers had carried back to Aedyr, and Edér and his parents were subjected to occasional incidents of harassment. When a group of brigands one day tried to drive Edér's parents from their land with threats of violence, Edér drew his weapon against them and expertly slew them all in combat. This outburst of violence created a rift between Edér and his parents; although they were grateful for him protecting them, they still thought that his use of deadly force had been disproportionate, and though they didn't say so out loud, Edér could still sense that they had become somewhat scared of him as a result. Edér decided that the best he could do for his parents was to let them have peace, and so he left their home again, journeying back to Dyrwood.\n\nEdér heard of the destruction of [Caed Nua](/caedNua/) at [Eothas](/eothas/)' hands and returned to help the Watcher once more — and helped charter the ship to bring the Watcher closer to [Eothas](/eothas/) in the [Deadfire Archipelago](/deadfireArchipelago/). He's grown ever more sarcastic as a result of his experiences - though he hasn't lost any of his good nature or love of cuddly animals. However, the return of his god hasn't done anything to help him resolve the underlying conflict over his religion and morals — if anything, it only amplified it. He doesn't know whether following him is the right path — or if there isn't one — and hopes that the Watcher can help him.\n\nAnother concern is his old flame. Edér never stopped loving her and would like to find her among the waters of the Deadfire. Particularly after he realizes that she had a son after the last time they were together — a chance that it is his son drives Edér forward.\n\n## Interactions\n\n## ={{poe1}}\n\n=\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =\n|quests_involved =[Fragments of a Scattered Faith](/fragmentsOfAScatteredFaith/)\n|other           =\n|none            = \n}}\n\n## =Companion\n\n=\n* Edér is an incredibly powerful fighter character, effectively immune to most challenges that the enemy can try and throw at him by the endgame. He's particularly powerful as a tank, locking down enemies and typically remaining as the last man standing.\n* Despite his firepower, Edér is polite, laid-back, and possessed of a particularly dark type of black humor. He loves animals and tends to pet them at any opportunity - with their caretakers' consent. This is regardless of whether it's [Sagani](/sagani/)'s [Itumaak](/itumaak/) or [Simoc](/simoc/)'s [stelgaer](/stelgaer/).\n\n## =Companion quest\n\n=\nEdér's companion quest is [Fragments of a Scattered Faith](/fragmentsOfAScatteredFaith/). Completing this quest will require you to have a [Reputation](/reputation/) of moderately positive with [Defiance Bay](/defianceBay/).\n\nEdér asks the Watcher to help him seek answers as to the rumors circulating around his brother's loyalties, as Maerwald was too damaged to provide assistance himself. Seeking to know whether he did truly join Waidwen in his rampage, Edér and the Watcher investigate the militia records in Defiance Bay, which the Watcher is granted access to as a result of their positive reputation in the city. Upon reading up on it, Edér discovers his brother did indeed fight for Readceras. Confused, he asks the Watcher to visit his brother's last battlefield. With the aid of multiple artifacts and a Cipher, the Watcher is able to glimpse the journey of Edér's brother through the Dyrwood and into Readceras. They discover he personally met with Waidwen, but is unable to discover what they talked about due to an intense energy radiating off Waidwen, which disrupts the Watcher's abilities in the present day. Shortly thereafter, the vision shows the final battle, and then ends. Upon revealing what they saw, Edér is distraught to discover how little they have learned, and is now deeply troubled by the possibility that he may have abandoned his god when he needed him. He thanks the Watcher for their assistance as they continue their journey.\n\n## =Endings\n\n=\nEdér's endings change depending on his views of faith. A neutral or positive value will renew his faith, while a negative value will have him focus efforts elsewhere in his ending slides.\n\nThere are several conversations where the player can influence this trait:\n{| class=\"wikitable\"\n| '''After entering Defiance Bay for the first time and speaking with the Dozens'''\n| '''Faith'''\n|-\n| → \"People hide behind symbols so they can't be questioned.\" || -1\n|-\n| → \"There must be plenty of other groups that are better reflections of the figures that inspired them.\" || +1 \n|-\n| → \"Too bad. I wouldn't mind seeing something like that.\" || -1\n|-\n| → \"Surely Magran has worthier followers.\" || +1\n\n|- style=\"background-color:transparent\"\n| colspan=\"2\" style=\"border-left:none; border-right:none; background-color:transparent\" | &nbsp;\n|-\n| colspan=\"2\" | '''Upon discovering Abydon's shrine in [Crucible Keep](/crucibleKeep/)'''\n|-\n| → \"It seems like some members do still take their ideals seriously.\" || +1 \n|-\n| → \"For all we know, maybe Abydon IS telling him to.\" || -1\n|-\n| → \"They don't seem all bad. They're keeping peace in Defiance Bay.\" || +1 \n|-\n| → \"And the nobles will respond that their gods told them that they're the only true nobles.\" || -1\n|-\n\n|- style=\"background-color:transparent\"\n| colspan=\"2\" style=\"border-left:none; border-right:none; background-color:transparent\" | &nbsp;\n|-\n| colspan=\"2\" | '''After completing his quest [Fragments of a Scattered Faith](/fragmentsOfAScatteredFaith/)'''\n|-\n| → \"What would your brother have to say about that?\" || +2\n|-\n| → \"You did what you had to. Even if Waidwen was Eothas, his actions were destructive.\" || -2\n|-\n| → \"It does seem like you put your faith in the wrong side. He'd have brought unity, even if it was by force.\" || +2\n|-\n|}\n\n## ={{poe2}}\n\n=\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =[The Lighted Path](/theLightedPath/)\n|quests_involved =\n|other           =\n|none            = \n}}\n\n## =Companion\n\n=\n* Eder is the first companion you receive in your party as long as he didn't die in the first game.\n* As a result of his quest [Fragments of a Scattered Faith](/fragmentsOfAScatteredFaith/) during the events of {{poe1}}, he wears either [Night Market Amulet](/nightMarketAmulet/) (if he joined the Night Market ), or the [Dyrwoodan Mayoral Medallion](/dyrwoodanMayoralMedallion/) (if he became the mayor of [Dyrford](/dyrford/)).\n* He can be a Fighter, a Rogue, or a multiclass of the two (Swashbuckler). He's as powerful as he was in {{poe1}} and a strong member of any party.\n* Once you pick [Xoti](/xoti/) up, he will mention the Dawnstars and a friend from Gilded Vale he would like to look up while in Deadfire. with Insight 2, Perception 11, or Diplomacy 2 you can press the issue and learn that she's a one-time lover of his, with a penchant for really, ''really'' loud screaming when she climaxes. Oh, Eder, you rapscallion.\n* More importantly, Eder is grappling with his doubts about Eothas. Once your reputation passes the first threshold, he will ask for your input on how to maintain your moral compass in the face of impossible odds and taking the right path (assuming he has a high opinion of you) and whether it's possible to follow Eothas still.\n\n## =Reputation\n\n=\n* Eder likes:\n** Anti-Leaden Key\n** Animal Kindness: Appreciates kindness and sentimentality toward animals of all kinds.\n**  Pro-Eothasians: Supports the followers of Eothas.\n** Lighthearted: Appreciates jokes and levity in life, even in the darkest of circumstances.\n** Traditional: Respects and enjoys cultural traditions and believes they are worthwhile to observe and practice.\n* Eder dislikes:\n**Animal Cruelty: Has a negative reaction to people who are cruel or callous toward animals.\n**Anti-Eothasians: Does not respond well to criticism of or hostility toward the followers of Eothas.\n**Pro-Leaden Key: Distrusts the Leaden Key and those who make excuses for it.\n\n## =Relationships\n\n=\n* Edér is inclined towards [Xoti](/xoti/), a fellow follower of Eothas, though her zealousness initially keeps him away.\n* If [Aloth](/aloth/) did not suppress Iselmyr, Edér has several conversations with her in which they joke at Aloth's expense. However, he eventually tires of Iselmyr's bashing.\n* Edér can't be romanced, and if the Watcher tries and is an [Orlan](/orlan/), he will cite his inability to overcome his racial prejudices as the reason for turning the Watcher down.\n\n## =Deadfire endings\n\n=\nEdér's endings change depending on:\n# Saving Bearn (or not) during his personal quest [The Lighted Path](/theLightedPath/).\n# Renewing/decreasing his faith in [Eothas](/eothas/), which happens during conversations in his quest as well as below.\n<div style=\"width:100%;max-width:700px;\">\n{| class=\"wikitable\" style=\"width:100%;\"\n|-\n! colspan=\"2\" | After Edér recalls the story of the little girl and Eothas.\n|-\n| <b>\"And that's the whole story. Doesn't have much explanation. What do you make of it?\"</b> || style=\"width:50px; | <small>Faith</small>\n|-\n| &nbsp;&nbsp; → \"Eothas loved the girl and was determined to help her.\" || 1\n|-\n| &nbsp;&nbsp; → \"The girl knew the consequences. Eothas let her decide.\" || 1\n|-\n| &nbsp;&nbsp; → \"Eothas' heart is bigger than his brain.\" || -1\n|-\n| &nbsp;&nbsp; → \"I fell asleep almost immediately.\" || -1\n|}\n{| class=\"wikitable\" style=\"width:100%;\"\n! colspan=\"2\" | After Act 3.\n|-\n| <b>\"But how many times do we have to stand by and watch, while someone with some big idea wrecks the world trying to make it happen?\"</b> || style=\"width:50px; | <small>Faith</small>\n|-\n| &nbsp;&nbsp; → \"We thwarted one calamity. Eothas is just exchanging it for a different one.\" || -2 \n|-\n| &nbsp;&nbsp; → \"The gods must face kith and be judged for their actions.\" || 2\n|-\n| &nbsp;&nbsp; → \"Eothas' plan is not the best way. There has to be a peaceful solution.\" || -2 \n|-\n| &nbsp;&nbsp; → \"It's kith nature to seek truth. What we saw in Dyrwood will happen again and again unless Eothas stops it.\" || 2\n|-\n|}\n</div>\n\n## Trivia\n\n*Edér was written by [Eric Fenstermaker](/ericFenstermaker/).<ref>[http://forums.obsidian.net/topic/74557-companions-who-wrote-what/#entry1622138 Eric Fenstermaker on Companions - who wrote what?]</ref>\n*He is voiced by [http://www.imdb.com/name/nm2233310/ Matthew Mercer], who also voices [Aloth](/alothCorfiser/).<ref>[https://twitter.com/matthewmercer/status/581136312964489216 Tweet by Matthew Mercer]</ref>\n* During the Kickstarter Campaign, he was called Edair but his name was changed to Edér to reflect the language of the [Dyrwood](/freePalatinateOfDyrwood/).<ref>[http://forums.somethingawful.com/showthread.php?threadid=3506352&userid=17931&perpage=40&pagenumber=17#post421835243 The Something Awful Forums post by Josh Sawyer (registration required)]</ref><!-- References, that require registration to see them, aren't good! --><ref>[http://forums.obsidian.net/topic/66069-the-npcs-of-poe-and-their-classes/?p=1441669 Unofficial forum post on this topic]</ref>\n* Eder's portrait is based on the late Max von Sydow.<ref>[https://twitter.com/jesawyer/status/1237044169903763456?s=20 J.E. Sawyer]</ref>\n*  Edér's class changed during development from a fighter to a [rogue](/rogue/), and then back again.<ref>[https://forums.somethingawful.com/showthread.php?threadid=3593502&pagenumber=304&perpage=40#post440244205  The Something Awful Forums post by Josh Sawyer (currently no registration required)]</ref>\n* Edér has the unique [background](/background/) [Farmer](/farmer/), which provides +1 [Survival](/survival/) and [Athletics](/athletics/)\n* Before [version](/version/) 1.03, Edér had the following Attributes: Mig: 16 Con: 16 Dex: 11 Per: 10 Int: 13 Res: 12.\n\n## Gallery\n\n<gallery>\nFile:Edair.png|Old design from the Kickstarter campaign.\nFile:Eder.jpg|Ingame model of Edér\nFile:PE1 Eder IG.png|Eder in Gilded Vale\nFile:PE2 Eder.png|Eder on the Defiant in POE2\nFile:PoE2 Fig Crowdfunding campaign Promo003.jpg|Promotional image for ''[Pillars of Eternity II: Deadfire](/pillarsOfEternityIiDeadfire/)''\n</gallery>\n\n{{References|2}}\n\n{{Companions navbar PoE1}}\n{{Companions navbar PoE2}}\n[Category:Gilded Vale characters](/categoryGildedValeCharacters/)",
  "raw": "{{Infobox npc\n|game         = poe1 \n|game2       = poe2\n|name       = Edér Teylecg\n|image = Eder composite.png\n|race       = Human\n|subrace    = Meadow\n|gender     = Male\n|class      = Fighter\n|location   = [[Gilded Vale]]\n|culture    = Free Palatinate of Dyrwood\n|background = Farmer\n|companion  = Permanent\n|quests     = [[Fragments of a Scattered Faith]]<hr/>[[The Lighted Path]]\n|MIG=16|CON=16|DEX=11|PER=12|INT=10|RES=13}}\n''' Edér Teylecg''' is a male [[human]] [[fighter]] and recruitable [[companion]] in {{poe1}} and {{poe2}}. \n\nHe can be recruited in [[Gilded Vale]] after completing [[Visions and Whispers]]. In the sequel, he's automatically a part of your party.\n\n==Background==\nEdér is a 32 year old, broad man with straw-colored hair, a light beard<ref name=\"strategyguide\">Pillars of Eternity Collector's Edition Guide, pg. 122</ref> and stands 6'2\" (188&nbsp;cm) tall. His scale armor, blade, and pipe are his most easily recognizable attributes — together with a laid-back, blackly humorous outlook on life. Expect no less from a veteran of the [[Saint's War]]. Though people tend to dismiss him as somewhat of a simpleton due to his appearance, background, and partiality to enjoying smoking [[whiteleaf]], Edér often proves to surprisingly observant of his surroundings and rather well-articulated.\n\nEdér hails from [[Gilded Vale]], the little village out on Dyrwood's frontier. The youngest son of two farmers, he grew up alongside his older brother, [[Woden Teylecg|Woden]]. Despite some occasional sibling rivalry with Woden, Edér by and large idolized his brother and looked up to him. Like their parents, he and Woden were devotees of [[Eothas]] for much of their early life, but this changed forever when St. Waidwen overthrew [[Readceras]] and turned it into a theocracy with him as the living incarnate of Eothas. As he marched his armies down into Dyrwood, thereby starting the Saint's War, Woden decided to enlist, much to the chagrin of his family. Both his parents and Edér argued that he should remain with his people, rather than go to war against his own god. Edér, in a fit of rage, had a major fight with his brother, flinging every horrid thing he could think of at him — and failing to convince him. A few months later, Edér decided that his brother might be right after all and followed his lead, enlisting with the Dyrwoodan army.<ref name=\"fragmentsquest\">[[Fragments of a Scattered Faith]]</ref>\n\nHe did not believe Waidwen to be the true incarnation of Eothas because of his punishment of non-believers, more akin to a vengeful god like [[Skaen]] or [[Woedica]] than the god of light. However, he wasn't aware that Woden wound up fighting for Readceras, turning away from [[Defiance Bay]] and marching to [[Readceras]], enlisting with Waidwen's army... And eventually perishing in the Third Battle of [[Clîaban Rilag]].<ref name=\"fragmentsquest\">[[Fragments of a Scattered Faith]]</ref> Edér continued to serve with distinction, right up to the 'Dyrwoodan Hello' at Halgot Citadel, when Waidwen found himself at the receiving end of the Godhammer bomb. Edér returned to Gilded Vale alongside his captain, trying to find solace after the experience of the war and loss of his brother.\n\nWelcomed as a hero, he quickly found employment on a farm, with his former captain becoming his headman. However, as the [[Waidwen's Legacy|Hollowborn crisis]] intensified and [[Saint's War#Eothasian Purges|the Purges]] of Eothasian followers began, rumors began to circulate that his brother actually fought for Readceras. Edér was saved from the noose by his war record and his headman's vouching for him, but the rumors planted a seed of doubt in his mind about the true loyalties of his brother. The prejudice against Eothasians only intensified with time. Edér's parents eventually grew concerned for their own safety and moved across the ocean to [[Aedyr Empire|Aedyr]], with Edér staying behind out of habit. His luck held for a while, even as the tree in the courtyard of the former Eothasian temple in Gilded Vale filled with followers of the [[Eothas|Splintered God]].<ref name=\"introdialog\">Edér's into dialog in Gilded Vale</ref>\n\nHowever, by the time the [[Watcher]] came to Gilded Vale, Edér's luck was running out. As the sole remaining worshipper of Eothas, he reasoned that was only a matter of time until [[Raedric VII|Raedric's]] goons found an excuse to hoist him on the tree as the nineteenth victim of the Lord's madness.\n\n==={{poe1}}===\nEdér joins the Watcher, seeing an opportunity to help him learn the fate of [[Woden Teylecg|Woden]] in the [[Saint's War]].\n\nIf Edér's personal quest is left unresolved and he therefore didn't find out the details about what happened to Woden, Edér grows disillusioned with his life in the Dyrwood and decides to journey over the ocean to Aedyr, to be with his parents. However, if his quest is completed, and depending on whether the Watcher reinforced his belief in the gods or encouraged him to find a new way in life, Edér either finds a new calling in Dyrford or strengthens his faith as an Eothasian.\n\nTraveling with the Watcher proved to be the adventure of his life. A simple farmer from Gilded Vale wound up taking down the head of an [[Leaden Key|ancient cult]], learning the truth about the gods, and eventually deciding to take his life further.\n\n==={{poe2}}===\n''If Edér joined the Night Market'': Edér joined the Night Market after meeting a member of the organization in typical Eder fashion: Bashing his head into the target after a game of Orlan's Head went awry. When the man noticed the symbol of Eothas that Edér carried of his chest, the two started talking — and a month or two later, Edér was introduced to the group. Most of the time, he helped Eothasians get out of bad situations, setting them up with better jobs, though the usual power struggles within the group cost a few of their charges their lives — something Edér isn't quite sure was necessary.\n\n''If Edér became mayor of Dyrford'': Inspired by the Watcher's example to be more proactive in helping out people, rather than relying on the gods to do so, Edér remembered the small village of Dyrford that him and the Watcher had journey through previously and how the place had plenty of problems, and so he journeyed there hoping to offer whatever help he could in getting the village back on its feet. Upon arriving Edér sought out Dyrford's mayor, and arranged a meeting with him. The mayor, however, turned out to be a member of the secret Skaen cult in the area, and tried to attack Edér off-guard, but Edér made short work of him and chopped his head clean off. Upon emerging from the fight with the mayor's head in his hand, the villagers hailed Edér as a hero and quickly pronounced him their new mayor, and his position was soon confirmed by the local  thayn. Under Edér's rule he drove out the last of Skaen's kind and enforcing his own brand of frontier justice and brought some life back into the ailing village by drawing in settlers with promises of free land, a trick he had learned from someone else. Life was fair and safe under his rule... Though he was always missing something, or rather someone: Someone to show his work to. Someone like Elafa.\n\n''If Edér went back to his parents in Aedyr'': Edér was welcomed back by open arms by his mother and father, and soon settled down for some time in his old work as farmhand at their farm. The peaceful times did not last for long though, as some of the bad blood towards Eothasian worshipers had carried back to Aedyr, and Edér and his parents were subjected to occasional incidents of harassment. When a group of brigands one day tried to drive Edér's parents from their land with threats of violence, Edér drew his weapon against them and expertly slew them all in combat. This outburst of violence created a rift between Edér and his parents; although they were grateful for him protecting them, they still thought that his use of deadly force had been disproportionate, and though they didn't say so out loud, Edér could still sense that they had become somewhat scared of him as a result. Edér decided that the best he could do for his parents was to let them have peace, and so he left their home again, journeying back to Dyrwood.\n\nEdér heard of the destruction of [[Caed Nua]] at [[Eothas]]' hands and returned to help the Watcher once more — and helped charter the ship to bring the Watcher closer to [[Eothas]] in the [[Deadfire Archipelago]]. He's grown ever more sarcastic as a result of his experiences - though he hasn't lost any of his good nature or love of cuddly animals. However, the return of his god hasn't done anything to help him resolve the underlying conflict over his religion and morals — if anything, it only amplified it. He doesn't know whether following him is the right path — or if there isn't one — and hopes that the Watcher can help him.\n\nAnother concern is his old flame. Edér never stopped loving her and would like to find her among the waters of the Deadfire. Particularly after he realizes that she had a son after the last time they were together — a chance that it is his son drives Edér forward.\n\n==Interactions==\n==={{poe1}}===\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =\n|quests_involved =[[Fragments of a Scattered Faith]]\n|other           =\n|none            = \n}}\n===Companion===\n* Edér is an incredibly powerful fighter character, effectively immune to most challenges that the enemy can try and throw at him by the endgame. He's particularly powerful as a tank, locking down enemies and typically remaining as the last man standing.\n* Despite his firepower, Edér is polite, laid-back, and possessed of a particularly dark type of black humor. He loves animals and tends to pet them at any opportunity - with their caretakers' consent. This is regardless of whether it's [[Sagani]]'s [[Itumaak]] or [[Simoc]]'s [[stelgaer]].\n\n===Companion quest===\nEdér's companion quest is [[Fragments of a Scattered Faith]]. Completing this quest will require you to have a [[Reputation]] of moderately positive with [[Defiance Bay]].\n\nEdér asks the Watcher to help him seek answers as to the rumors circulating around his brother's loyalties, as Maerwald was too damaged to provide assistance himself. Seeking to know whether he did truly join Waidwen in his rampage, Edér and the Watcher investigate the militia records in Defiance Bay, which the Watcher is granted access to as a result of their positive reputation in the city. Upon reading up on it, Edér discovers his brother did indeed fight for Readceras. Confused, he asks the Watcher to visit his brother's last battlefield. With the aid of multiple artifacts and a Cipher, the Watcher is able to glimpse the journey of Edér's brother through the Dyrwood and into Readceras. They discover he personally met with Waidwen, but is unable to discover what they talked about due to an intense energy radiating off Waidwen, which disrupts the Watcher's abilities in the present day. Shortly thereafter, the vision shows the final battle, and then ends. Upon revealing what they saw, Edér is distraught to discover how little they have learned, and is now deeply troubled by the possibility that he may have abandoned his god when he needed him. He thanks the Watcher for their assistance as they continue their journey.\n\n===Endings===\nEdér's endings change depending on his views of faith. A neutral or positive value will renew his faith, while a negative value will have him focus efforts elsewhere in his ending slides.\n\nThere are several conversations where the player can influence this trait:\n{| class=\"wikitable\"\n| '''After entering Defiance Bay for the first time and speaking with the Dozens'''\n| '''Faith'''\n|-\n| → \"People hide behind symbols so they can't be questioned.\" || -1\n|-\n| → \"There must be plenty of other groups that are better reflections of the figures that inspired them.\" || +1 \n|-\n| → \"Too bad. I wouldn't mind seeing something like that.\" || -1\n|-\n| → \"Surely Magran has worthier followers.\" || +1\n\n|- style=\"background-color:transparent\"\n| colspan=\"2\" style=\"border-left:none; border-right:none; background-color:transparent\" | &nbsp;\n|-\n| colspan=\"2\" | '''Upon discovering Abydon's shrine in [[Crucible Keep]]'''\n|-\n| → \"It seems like some members do still take their ideals seriously.\" || +1 \n|-\n| → \"For all we know, maybe Abydon IS telling him to.\" || -1\n|-\n| → \"They don't seem all bad. They're keeping peace in Defiance Bay.\" || +1 \n|-\n| → \"And the nobles will respond that their gods told them that they're the only true nobles.\" || -1\n|-\n\n|- style=\"background-color:transparent\"\n| colspan=\"2\" style=\"border-left:none; border-right:none; background-color:transparent\" | &nbsp;\n|-\n| colspan=\"2\" | '''After completing his quest [[Fragments of a Scattered Faith]]'''\n|-\n| → \"What would your brother have to say about that?\" || +2\n|-\n| → \"You did what you had to. Even if Waidwen was Eothas, his actions were destructive.\" || -2\n|-\n| → \"It does seem like you put your faith in the wrong side. He'd have brought unity, even if it was by force.\" || +2\n|-\n|}\n\n==={{poe2}}===\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =[[The Lighted Path]]\n|quests_involved =\n|other           =\n|none            = \n}}\n===Companion===\n* Eder is the first companion you receive in your party as long as he didn't die in the first game.\n* As a result of his quest [[Fragments of a Scattered Faith]] during the events of {{poe1}}, he wears either [[Night Market Amulet]] (if he joined the Night Market ), or the [[Dyrwoodan Mayoral Medallion]] (if he became the mayor of [[Dyrford]]).\n* He can be a Fighter, a Rogue, or a multiclass of the two (Swashbuckler). He's as powerful as he was in {{poe1}} and a strong member of any party.\n* Once you pick [[Xoti]] up, he will mention the Dawnstars and a friend from Gilded Vale he would like to look up while in Deadfire. with Insight 2, Perception 11, or Diplomacy 2 you can press the issue and learn that she's a one-time lover of his, with a penchant for really, ''really'' loud screaming when she climaxes. Oh, Eder, you rapscallion.\n* More importantly, Eder is grappling with his doubts about Eothas. Once your reputation passes the first threshold, he will ask for your input on how to maintain your moral compass in the face of impossible odds and taking the right path (assuming he has a high opinion of you) and whether it's possible to follow Eothas still.\n\n===Reputation===\n* Eder likes:\n** Anti-Leaden Key\n** Animal Kindness: Appreciates kindness and sentimentality toward animals of all kinds.\n**  Pro-Eothasians: Supports the followers of Eothas.\n** Lighthearted: Appreciates jokes and levity in life, even in the darkest of circumstances.\n** Traditional: Respects and enjoys cultural traditions and believes they are worthwhile to observe and practice.\n* Eder dislikes:\n**Animal Cruelty: Has a negative reaction to people who are cruel or callous toward animals.\n**Anti-Eothasians: Does not respond well to criticism of or hostility toward the followers of Eothas.\n**Pro-Leaden Key: Distrusts the Leaden Key and those who make excuses for it.\n\n===Relationships===\n* Edér is inclined towards [[Xoti]], a fellow follower of Eothas, though her zealousness initially keeps him away.\n* If [[Aloth]] did not suppress Iselmyr, Edér has several conversations with her in which they joke at Aloth's expense. However, he eventually tires of Iselmyr's bashing.\n* Edér can't be romanced, and if the Watcher tries and is an [[Orlan]], he will cite his inability to overcome his racial prejudices as the reason for turning the Watcher down.\n\n===Deadfire endings===\nEdér's endings change depending on:\n# Saving Bearn (or not) during his personal quest [[The Lighted Path]].\n# Renewing/decreasing his faith in [[Eothas]], which happens during conversations in his quest as well as below.\n<div style=\"width:100%;max-width:700px;\">\n{| class=\"wikitable\" style=\"width:100%;\"\n|-\n! colspan=\"2\" | After Edér recalls the story of the little girl and Eothas.\n|-\n| <b>\"And that's the whole story. Doesn't have much explanation. What do you make of it?\"</b> || style=\"width:50px; | <small>Faith</small>\n|-\n| &nbsp;&nbsp; → \"Eothas loved the girl and was determined to help her.\" || 1\n|-\n| &nbsp;&nbsp; → \"The girl knew the consequences. Eothas let her decide.\" || 1\n|-\n| &nbsp;&nbsp; → \"Eothas' heart is bigger than his brain.\" || -1\n|-\n| &nbsp;&nbsp; → \"I fell asleep almost immediately.\" || -1\n|}\n{| class=\"wikitable\" style=\"width:100%;\"\n! colspan=\"2\" | After Act 3.\n|-\n| <b>\"But how many times do we have to stand by and watch, while someone with some big idea wrecks the world trying to make it happen?\"</b> || style=\"width:50px; | <small>Faith</small>\n|-\n| &nbsp;&nbsp; → \"We thwarted one calamity. Eothas is just exchanging it for a different one.\" || -2 \n|-\n| &nbsp;&nbsp; → \"The gods must face kith and be judged for their actions.\" || 2\n|-\n| &nbsp;&nbsp; → \"Eothas' plan is not the best way. There has to be a peaceful solution.\" || -2 \n|-\n| &nbsp;&nbsp; → \"It's kith nature to seek truth. What we saw in Dyrwood will happen again and again unless Eothas stops it.\" || 2\n|-\n|}\n</div>\n\n==Trivia==\n*Edér was written by [[Eric Fenstermaker]].<ref>[http://forums.obsidian.net/topic/74557-companions-who-wrote-what/#entry1622138 Eric Fenstermaker on Companions - who wrote what?]</ref>\n*He is voiced by [http://www.imdb.com/name/nm2233310/ Matthew Mercer], who also voices [[Aloth Corfiser|Aloth]].<ref>[https://twitter.com/matthewmercer/status/581136312964489216 Tweet by Matthew Mercer]</ref>\n* During the Kickstarter Campaign, he was called Edair but his name was changed to Edér to reflect the language of the [[Free Palatinate of Dyrwood|Dyrwood]].<ref>[http://forums.somethingawful.com/showthread.php?threadid=3506352&userid=17931&perpage=40&pagenumber=17#post421835243 The Something Awful Forums post by Josh Sawyer (registration required)]</ref><!-- References, that require registration to see them, aren't good! --><ref>[http://forums.obsidian.net/topic/66069-the-npcs-of-poe-and-their-classes/?p=1441669 Unofficial forum post on this topic]</ref>\n* Eder's portrait is based on the late Max von Sydow.<ref>[https://twitter.com/jesawyer/status/1237044169903763456?s=20 J.E. Sawyer]</ref>\n*  Edér's class changed during development from a fighter to a [[rogue]], and then back again.<ref>[https://forums.somethingawful.com/showthread.php?threadid=3593502&pagenumber=304&perpage=40#post440244205  The Something Awful Forums post by Josh Sawyer (currently no registration required)]</ref>\n* Edér has the unique [[background]] [[Farmer]], which provides +1 [[Survival]] and [[Athletics]]\n* Before [[version]] 1.03, Edér had the following Attributes: Mig: 16 Con: 16 Dex: 11 Per: 10 Int: 13 Res: 12.\n\n==Gallery==\n<gallery>\nFile:Edair.png|Old design from the Kickstarter campaign.\nFile:Eder.jpg|Ingame model of Edér\nFile:PE1 Eder IG.png|Eder in Gilded Vale\nFile:PE2 Eder.png|Eder on the Defiant in POE2\nFile:PoE2 Fig Crowdfunding campaign Promo003.jpg|Promotional image for ''[[Pillars of Eternity II: Deadfire]]''\n</gallery>\n\n{{References|2}}\n\n{{Companions navbar PoE1}}\n{{Companions navbar PoE2}}\n[[Category:Gilded Vale characters]]",
  "slug": "ederTeylecg",
  "title": "Edér Teylecg"
}
