{
  "markdown": "###### Valera loot: [Duskfall](/duskfall/) and [Casità Samelia's Legacy](/casitaSameliasLegacy/), from Atello Valera's body.\n\n| rewardname3  = Valera prevail\n| reward3      = [Duskfall](/duskfall/);Bardatto loot: [Bardatto's Luxury](/bardattosLuxury/), [Deltro's Cage](/deltrosCage/), and [Deltro's Cage Helm](/deltrosCageHelm/) from Ezzali Bardatto's body.;Contents of Bardatto vault: [Rännig's Wrath](/rannigsWrath/) and [Resounding Call](/resoundingCall/).\n| rewardname4  = Both families are extinguished\n| reward4      = Loot from both of the family leaders\n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = Salt in the Wound\n| conc         = A Sinking Feeling;A Bigger Fish\n| internalname = 03_QST_Rival_Houses\n| guid         = 8ba2af7c-1aa4-4af7-a2a1-2654a17bbcec\n}}\n{{quote|Mestra and mestre, as you know, the brothers of the Canc Suolias are often called upon to help mediate conflicts between the ducs, the consuagli asegia, and the great houses of the Republics, such as yours. I would not presume to suggest your quarrel will be easy to mend, but di verus, during my service, I have seen much bloodier feuds mended with time and patience.  have also seen the wrath of the ducs bels turned against those who would cloud the skies of our nation's fortunes with their vendettas. I urge you to seek a remedy for your injuries that produces a lasting peace, for all our sakes.|Pallegina}}\n'''{{PAGENAME}}''' is a [quest](/pillarsOfEternityIiDeadfireQuests/) in {{poe2}}.\n\n## Synopsis\n\n \nThe Queen's Berth district in the city of Neketaka is home to several Vailian families. Two of the most prominent houses, Bardatto and Valera, appear to be in the midst of an escalating feud. Considering the importance of these families, I'm sure the Vailian Trading Company is invested in bringing the dispute to a close. It may be worth looking into just why these two Houses are pitted against each other. Both families have estates here in Queen's Berth. Speaking with their respective heads should make the source of antagonism clearer.\n\n## Walkthrough\n\n* The feud between the Bardattos and Valeras is one of the many vendettas in the Republics. The Bardattos are one of the oldest bloodlines in Vailian lands, while the Valeras are an ascendant noble family. Both are engaged in a bitter rivalry that goes back decades, exacerbated by the recent explosion of commerce in the Deadfire and Valeras' inability to compete with the RDC on equal footing. As such, they seek to remove the Bardattos and take their place, especially since they are shutting them out of investments and stifling the family finances. You can escalate the feud, exterminating one or both families, or mediate a peace between them.\n* [Pallegina](/pallegina/) will insist on mediating and saving both families to avoid escalating a feud. Other paths are covered in [A Sinking Feeling](/aSinkingFeeling/) and [A Bigger Fish](/aBiggerFish/).\n**Note: If Pallegina is in your party if you kill either Atello or Ezzali, she will be angry with you and leave your company.\n\n## =Achieving peace\n\n=\n* Convince either [Atello Valera](/atelloValera/) or [Ezzali Bardatto](/ezzaliBardatto/) to negotiate.\n**[Atello Valera](/atelloValera/)\n*** [Diplomacy](/diplomacy/) 2.\n*** Steal and read [Valera Captain's Report](/valeraCaptainsReport/). The report is in a locked chest (difficulty 6) in the office on the Upper Floor of [Valera Estate](/valeraEstate/).\n*** Have positive reputation (1) with [Royal Deadfire Company](/royalDeadfireCompany/).\n** [Ezzali Bardatto](/ezzaliBardatto/)\n*** Complete [A Sinking Feeling](/aSinkingFeeling/). [You might need to speak again as her initial answer might be that it is already too late]\n*** [Ezzali's Ledger](/ezzalisLedger/) probably can help convincing her, it can be found in a chest inside the vault.\n*** [Larro Bardatto](/larroBardatto/) killed [Orso Valera](/orsoValera/) in [Salt in the Wound](/saltInTheWound/).\n* Once you've convinced one of them, head to the other to invite them to the negotiation, then head back and inform that the negotiation can start.\n* The negotiation is held at [Valera Estate](/valeraEstate/), where you act as the mediator for both parties. If you have not completed [A Bigger Fish](/aBiggerFish/) or [A Sinking Feeling](/aSinkingFeeling/), these quests will fail once you begin the negotiation.\n* At first, they will start verbally attacking each other, ignoring whatever you say. Asking [Pallegina](/pallegina/) to pacify them give you positive reputation with her.\n* The real negotiation starts once Atello invites you to explain your reasoning. Depending on what you say, there are two main routes to peace:\n# Convince Ezzali to let the Valeras prove their trustworthiness.\n#* \"Ezzali, why shut the Valera family out of trade?\"\n#* \"It's not like you've given them a reason to prove their trustworthiness.\"\n# Convince Ezzali to look at the profit.\n#* \"You were a [Goldpact Knight](/goldpactKnights/) once, weren't you Ezzali?\"\n#* \"Ezzali, don't you know a chance at profit when you see it?\"\n#* At this point:\n#** \"Let's negotiate this like any business proposition. What do you want?\". This choice only succeeds if you had pointed out the poor economic the Valera family is in or said that duty should come first.\n#** [Insight](/insight/) 2.\n#** [Resolve](/resolve/) 17. This choice may not be available depending on your previous speech.\n#** If you had stolen and read [Valera Captain's Report](/valeraCaptainsReport/), you'll know the Valera family has lost ships and resources. Point this out if you haven't done so yet.\n* If you succeeded in convincing Ezzali. She will say \"I want the [Príncipi](/principiSenPatrena/) out of the trade lanes.\" Then, Atello will reply with utter surprise and a flat \"What?\". Everything goes smoothly from there and the negotiation succeeds, to the surprise of everyone.\n\n* Note that failing the negotiation will trigger one family to kill the other and you have to deal with the rest.\n\n* Collect your rewards from the heads of both houses: [Duskfall](/duskfall/) from the Valeras and [Bardatto's Luxury](/bardattosLuxury/) from Ezzali.\n* Unfortunately if the heist has already begun (by leaving too much time between finishing [A Bigger Fish](/aBiggerFish/) and the mediation - you'll know when Atello opens with \"You flaccid bazzo...\"), you'll be unable to enter dialogue with either of the Valeras to collect your reward, forcing you down one of the paths below - despite the fact the main quest has completed. Depending on if you have sided with Atello, and have informed Ezzalli about the plot, you may also be unable to collect the reward from Ezzali.\n\n## =Bardatto path\n\n=\n* Upon completion of [A Sinking Feeling](/aSinkingFeeling/), uncovering the Valera-driven plot to break into the Bardatto vault, Ezzali Bardatto suggests allowing the heist to play out to use it as a trap. Talk to her to take her side, and then head down to the vault to speak to [Captain Vilami](/captainVilami/). Note that doing this will cause the quest [A Bigger Fish](/aBiggerFish/) to fail, if you haven't yet completed it!\n* Prior to talking to Captain Vilami, you can still take the diplomatic path, or side with the Valeras instead.\n* Captain Vilami will make sure you know the plan. Once the thieves arrive, you and Captain Vilami's men hope to have them surrounded. Once you're ready, let Vilami know. Skipping forward, the plan has succeeded, and the would-be Valera thieves - including [Belda](/belda/) are indeed surrounded. With [Insight](/insight/) 3, you can spot her reaching for her pistol and warn Vilami. Doing so gains you Minor Positive Reputation with the Valian Trading Company. Otherwise if Captain Vilami is shot, he will be out of combat for a few seconds and will be left [Hobbled](/hobbled/). Note that all the dialogue options here will result in combat, so there's no hopes of negotiation once you start the heist sequence. Kill [Belda](/belda/) and her accomplices, then head upstairs.\n* Outraged, Ezzali will want Atello Valera's head. She'll give you {{cp2|1500}} and send you to kill him. Head over to the Valera Estate and kill Atello. Make sure to loot the unique items [Duskfall](/duskfall/) and [Casità Samelia's Legacy](/casitaSameliasLegacy/) from his body.\n* Return to Ezzali to complete the quest, receiving {{cp2|2500}} as a reward.\n* Alternatively, you can turn on the Bardattos. This is effectively the same as siding with the Valeras from the beginning.\n\n## =Valera path\n\n=\n* Upon completion of [A Bigger Fish](/aBiggerFish/), and after waiting a few days (or speaking to Ezzali Bardatto about the plot first), talk to Martino and Atello Valera to discover that the heist planned by Martino to break into the Bardattos' vault is already in motion, though it's not going as smoothly as they imagined. Some of the Valera men are engaged in a standoff within the vault, and Martino is concerned that they may be interrogated if caught. He wants you to get [Belda](/belda/), a Valera associate, out of the vault to prevent this from happening.\n* At this point, you can take sides and offer to get Belda out of the vault, otherwise Atello will question your allegiance, starting combat if you choose not to help them. Taking his side will cause the quest [A Sinking Feeling](/aSinkingFeeling/) to fail, if you haven't yet completed it.\n* Head over to the Bardatto estate.\n** If you previously informed Ezzali Bardatto about the plot, she will thank you for the information, but will accuse you of siding with the Valeras and will become hostile. You can avoid approaching her to prevent this from happening. If you leave too much time between talking to Atello/Martino and entering the Bardatto Estate, the guards will immediately become hostile upon entering (surprisingly even if you reload a save).\n** If you didn't inform Ezzalli Bardatto about the plot, she will be none the wiser.\n* In any case, if you decide to kill her, make sure to loot a number of unique items from her body: [Bardatto's Luxury](/bardattosLuxury/), [Deltro's Cage](/deltrosCage/), and [Deltro's Cage Helm](/deltrosCageHelm/).\n* In the vault are a few more Bardatto guards, kill them and continue to Captain Vilami and Belda. Again, reasoning with the Bardattos isn't an option at this point, so you'll have to kill Captain Vilami and his men too. Belda will hide in the corner while you fight. After the fight, talk to her, most of your party will chime in here too. She'll suggest to exit via the window in the room to the left to avoid further confrontation - useful if you avoided combat upstairs (even though returning upstairs won't inherently begin combat).\n* You'll need at least [Mechanics](/mechanics/) 12 to open the vault, opening a series of lower level locks beforehand. Use some [Thief's Putty](/thiefsPutty/) if required, else you'll have to come back another time. In the vault are the unique weapons [Rännig's Wrath](/rannigsWrath/) and [Resounding Call](/resoundingCall/), as well as number of other valuables.\n* Return to the Valera estate. They will ask you to take care of Ezzali Bardatto. Doing so and returning to them (or if you already killed Ezzali while saving Belda) will net you minor positive reputation with the Valian Trading Company (given you choose the correct dialogue option), and will complete the quest. As a reward, you will get [Duskfall](/duskfall/).\n* Alternatively, you can still turn on the Valeras instead of agreeing to kill the Bardatto matriarch. If you have already killed Ezzali, this will fail the quest. Returning to Ezzali will not yield a reward, as she will turn on you for siding with the Valeras in the first place.\n\n## =Scorched earth path\n\n=\n* This involves killing both families. There are many chances to attack them during dialogue, or you can just attack them whenever.\n\n## Bugs\n\n* If you complete both [A Bigger Fish](/aBiggerFish/), and/or [A Sinking Feeling](/aSinkingFeeling/) (and depending how much time has passed since then, while waiting for the heist to begin) - and then mediate peace between the families, the heist sequence of [Family Pride](/familyPride/) will still be open, despite the fact the quest is completed. In the most recent patch this seems to have been fixed.\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/03_Neketaka_Vailian_District/03_QST_Rival_Houses.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''Family Pride'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| The <b>Queen's Berth</b> district in the city of Neketaka is home to several Vailian families. Two of the most prominent houses, <b>Bardatto</b> and <b>Valera</b>, appear to be in the midst of an escalating feud. Considering the importance of these families, I'm sure the Vailian Trading Company is invested in bringing the dispute to a close.\n|-\n| rowspan=\"15\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Investigate the ongoing feud between the <b>Bardatto</b> and <b>Valera</b> families.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| It may be worth looking into just why these two Houses are pitted against each other. Both families have <b>estates</b> here in <b>Queen's Berth</b>. Speaking with their respective heads should make the source of antagonism clearer.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| <b>Ezzali Bardatto</b> has asked me to find information regarding a possible Valera plot. I'm on the lookout for <b>Zili Valera</b>.\n|-\n| style=\"vertical-align:text-top\" | 20016\n| I informed <b>Ezzali Bardatto</b> of the plan to rob her <b>vault</b>. She is poised to strike against the Valera family, should I agree to assist her.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| <b>Martino Valera</b> has asked me to get rid of some trouble-makers by the local <b>tavern</b> as a means of proving myself. He'd rather they were dealt with permanently, but it's entirely up to me.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| I cleared out the Rauataian soldiers at the tavern. That should put me in <b>Martino Valera's</b> good graces, for whatever that's worth.\n|-\n| style=\"vertical-align:text-top\" | 20014\n| <b>Martino</b> has no further work for the time being, though he suggested that I check back in a few days.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| <b>Atello Valera</b> confessed that his family is in financial trouble. They are finding it difficult to compete with the Royal Deadfire Company.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| The <b>Bardatto family</b> has recently lost a string of investments to corruption among its guardsmen. \n|-\n| style=\"vertical-align:text-top\" | 20002\n| The <b>Valera family</b> now believes the Príncipi to be responsible for the death of a relative, <b>Zili Valera</b>.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| The <b>Valera family</b> now believes the <b>Bardattos</b> to be responsible for the death of a relative, <b>Zili Valera</b>.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| I have decided to try and mediate peace talks between the two families. The first step is to talk to the head of each family and convince them to meet.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| <b>Ezzali</b> has agreed to hear Atello out. I can head back to <b>Atello Valera</b> once I am ready to kick off the talks.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| <b>Atello</b> has agreed to hear Ezzali out. I can head back to <b>Ezzali Bardatto</b> once I am ready to kick off the talks.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| Peace talks have broken down. I don't think this will end in any way but bloodshed.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Eliminate the <b>Bardattos</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| With reluctance, Atello Valera has given in to his son's desire that the <b>Bardatto family</b> be permanently removed from <b>Neketaka</b>. They have asked that I leave no witnesses.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Kill <b>Atello Valera</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| Ezzali Bardatto has given up on any pretense of keeping the peace. She asked me to kill the head of the Valera family, <b>Atello Valera</b>.\n|-\n| style=\"vertical-align:text-top\" | 20015\n| I spoke to <b>Atello Valera</b>, who asked that I turn on <b>Ezzali Bardatto</b>. If I wish to side with the Valera family, I must kill all the Bardattos.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Report to <b>Atello Valera</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| The Bardatto estate is now the scene of a massacre. I can report my success to <b>Atello Valera</b> in his estate in <b>Queen's Berth</b> in Neketaka.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Report to <b>Ezzali Bardatto</b>. '''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| Atello Valera is dead, bringing an end to any challenges to the Bardattos from that corner. <b>Ezzali Bardatto</b> should be pleased.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Survive the meeting.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| Peace negotiations between the Bardatto and Valera families have broken down, and violently. I'll have to fight my way out.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Resolve the situation in the <b>vault</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| Some thieves from the Valera family, led by Belda, have made an attempt on <b>Ezzali Bardatto's vault</b>. Their heist isn't exactly going to plan, and Martino Valera insists I rescue them. \n\nIt looks like the feud has escalated into open hostility. I doubt I'll be any more welcome inside the vault than the thieves were.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| <b>Belda</b> has been killed.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| <b>Captain Vilami</b> has been killed.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''8'''\n| colspan=\"2\" | '''Speak to <b>Ezzali Bardatto</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10008\n| After I helped him out in his duel, Larro pointed me to the Bardatto estate, here in <b>Queen's Berth</b>. There, I can speak to <b>Ezzali Bardatto</b>, the head of the family. \n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''9'''\n| colspan=\"2\" | '''Speak to <b>Atello Valera</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10009\n| After I helped him out in his duel, Orso pointed me to the Valera estate, here in <b>Queen's Berth</b>. There, I can speak to <b>Atello Valera</b>, the head of the family. \n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''10'''\n| colspan=\"2\" | '''Speak to <b>Captain Vilami</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10010\n| Ezzali asked me to speak with <b>Captain Vilami</b> in the <b>Bardatto vault</b>, on the lower level of her estate. We're to set an ambush for the Valera family. \n\nIt looks like this feud has escalated into open hostility. Going forward with this will mean taking up Ezzali's cause.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''11'''\n| colspan=\"2\" | '''Deal with the <b>thieves</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10011\n| The Valera-hired <b>thieves</b> have arrived, as expected. Time to go to work.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| <b>Captain Vilami</b> has been killed.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''12'''\n| colspan=\"2\" | '''Return to <b>Ezzali Bardatto</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10012\n| The thieves are dead, and <b>Ezzali</b> has her evidence. I can report to her on the upper floor of the <b>Bardatto estate</b> in Queen's Berth in Neketaka.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''13'''\n| colspan=\"2\" | '''Return to <b>Atello Valera</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10013\n| I've dealt with Ezzali's guards. <b>Atello</b> and <b>Martino Valera</b> will want an update.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30000\n| Someone critical to the completion of this quest has been killed\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I was able to convince Ezzali Bardatto and Atello Valera to see reason and bring their houses together in a profitable alliance. This should improve their fortunes, along with that of Vailian Trading Company operations in the region. \n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| Atello Valera is dead, putting an end to his feud with Ezzali Bardatto. Ezzali has rewarded me for solving her problem.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| The Bardatto family is dead, bringing an end to one of the Vailian Republic's oldest bloodlines - and their feud with the Valera family.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30004\n| I have brought an end to both families, Bardatto and Valera alike.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30005\n| Peace talks between the Bardatto and Valera families have culminated in a massacre. \n|}",
  "raw": "{{Infobox quest poe2\n| name         = Family Pride\n| image        = PE2 Family Pride.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Side quest\n| quest_region = Neketaka - Queen's Berth\n| quest_level  = 9\n| faction      = Vailian Trading Company\n| locations    = Queen's Berth;Bardatto Estate;Valera Estate\n| main_npcs    = Ezzali Bardatto;Atello Valera;Martino Valera;Captain Vilami;Belda\n| companion    = Pallegina\n| quest_giver  = \n| xp_amount    = 900\n| xp_type      = Normal\n| xp_level     = 9\n| xp_weights   = 1;1;1;1;1;1;1;1;1;1;1;1;1\n| rewardname1  = Mediate peace\n| reward1      = Major Positive reputation with the VTC;[[Duskfall]];[[Bardatto's Luxury]]\n| rewardname2  = Bardattos prevail\n| reward2      = {{cp2|2500}};Valera loot: [[Duskfall]] and [[Casità Samelia's Legacy]], from Atello Valera's body.\n| rewardname3  = Valera prevail\n| reward3      = [[Duskfall]];Bardatto loot: [[Bardatto's Luxury]], [[Deltro's Cage]], and [[Deltro's Cage Helm]] from Ezzali Bardatto's body.;Contents of Bardatto vault: [[Rännig's Wrath]] and [[Resounding Call]].\n| rewardname4  = Both families are extinguished\n| reward4      = Loot from both of the family leaders\n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = Salt in the Wound\n| conc         = A Sinking Feeling;A Bigger Fish\n| internalname = 03_QST_Rival_Houses\n| guid         = 8ba2af7c-1aa4-4af7-a2a1-2654a17bbcec\n}}\n{{quote|Mestra and mestre, as you know, the brothers of the Canc Suolias are often called upon to help mediate conflicts between the ducs, the consuagli asegia, and the great houses of the Republics, such as yours. I would not presume to suggest your quarrel will be easy to mend, but di verus, during my service, I have seen much bloodier feuds mended with time and patience.  have also seen the wrath of the ducs bels turned against those who would cloud the skies of our nation's fortunes with their vendettas. I urge you to seek a remedy for your injuries that produces a lasting peace, for all our sakes.|Pallegina}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests|quest]] in {{poe2}}.\n\n==Synopsis== \nThe Queen's Berth district in the city of Neketaka is home to several Vailian families. Two of the most prominent houses, Bardatto and Valera, appear to be in the midst of an escalating feud. Considering the importance of these families, I'm sure the Vailian Trading Company is invested in bringing the dispute to a close. It may be worth looking into just why these two Houses are pitted against each other. Both families have estates here in Queen's Berth. Speaking with their respective heads should make the source of antagonism clearer.\n\n==Walkthrough==\n* The feud between the Bardattos and Valeras is one of the many vendettas in the Republics. The Bardattos are one of the oldest bloodlines in Vailian lands, while the Valeras are an ascendant noble family. Both are engaged in a bitter rivalry that goes back decades, exacerbated by the recent explosion of commerce in the Deadfire and Valeras' inability to compete with the RDC on equal footing. As such, they seek to remove the Bardattos and take their place, especially since they are shutting them out of investments and stifling the family finances. You can escalate the feud, exterminating one or both families, or mediate a peace between them.\n* [[Pallegina]] will insist on mediating and saving both families to avoid escalating a feud. Other paths are covered in [[A Sinking Feeling]] and [[A Bigger Fish]].\n**Note: If Pallegina is in your party if you kill either Atello or Ezzali, she will be angry with you and leave your company.\n\n===Achieving peace===\n* Convince either [[Atello Valera]] or [[Ezzali Bardatto]] to negotiate.\n**[[Atello Valera]]\n*** [[Diplomacy]] 2.\n*** Steal and read [[Valera Captain's Report]]. The report is in a locked chest (difficulty 6) in the office on the Upper Floor of [[Valera Estate]].\n*** Have positive reputation (1) with [[Royal Deadfire Company]].\n** [[Ezzali Bardatto]]\n*** Complete [[A Sinking Feeling]]. [You might need to speak again as her initial answer might be that it is already too late]\n*** [[Ezzali's Ledger]] probably can help convincing her, it can be found in a chest inside the vault.\n*** [[Larro Bardatto]] killed [[Orso Valera]] in [[Salt in the Wound]].\n* Once you've convinced one of them, head to the other to invite them to the negotiation, then head back and inform that the negotiation can start.\n* The negotiation is held at [[Valera Estate]], where you act as the mediator for both parties. If you have not completed [[A Bigger Fish]] or [[A Sinking Feeling]], these quests will fail once you begin the negotiation.\n* At first, they will start verbally attacking each other, ignoring whatever you say. Asking [[Pallegina]] to pacify them give you positive reputation with her.\n* The real negotiation starts once Atello invites you to explain your reasoning. Depending on what you say, there are two main routes to peace:\n# Convince Ezzali to let the Valeras prove their trustworthiness.\n#* \"Ezzali, why shut the Valera family out of trade?\"\n#* \"It's not like you've given them a reason to prove their trustworthiness.\"\n# Convince Ezzali to look at the profit.\n#* \"You were a [[Goldpact Knights|Goldpact Knight]] once, weren't you Ezzali?\"\n#* \"Ezzali, don't you know a chance at profit when you see it?\"\n#* At this point:\n#** \"Let's negotiate this like any business proposition. What do you want?\". This choice only succeeds if you had pointed out the poor economic the Valera family is in or said that duty should come first.\n#** [[Insight]] 2.\n#** [[Resolve]] 17. This choice may not be available depending on your previous speech.\n#** If you had stolen and read [[Valera Captain's Report]], you'll know the Valera family has lost ships and resources. Point this out if you haven't done so yet.\n* If you succeeded in convincing Ezzali. She will say \"I want the [[Príncipi sen Patrena|Príncipi]] out of the trade lanes.\" Then, Atello will reply with utter surprise and a flat \"What?\". Everything goes smoothly from there and the negotiation succeeds, to the surprise of everyone.\n\n* Note that failing the negotiation will trigger one family to kill the other and you have to deal with the rest.\n\n* Collect your rewards from the heads of both houses: [[Duskfall]] from the Valeras and [[Bardatto's Luxury]] from Ezzali.\n* Unfortunately if the heist has already begun (by leaving too much time between finishing [[A Bigger Fish]] and the mediation - you'll know when Atello opens with \"You flaccid bazzo...\"), you'll be unable to enter dialogue with either of the Valeras to collect your reward, forcing you down one of the paths below - despite the fact the main quest has completed. Depending on if you have sided with Atello, and have informed Ezzalli about the plot, you may also be unable to collect the reward from Ezzali.\n\n===Bardatto path===\n* Upon completion of [[A Sinking Feeling]], uncovering the Valera-driven plot to break into the Bardatto vault, Ezzali Bardatto suggests allowing the heist to play out to use it as a trap. Talk to her to take her side, and then head down to the vault to speak to [[Captain Vilami]]. Note that doing this will cause the quest [[A Bigger Fish]] to fail, if you haven't yet completed it!\n* Prior to talking to Captain Vilami, you can still take the diplomatic path, or side with the Valeras instead.\n* Captain Vilami will make sure you know the plan. Once the thieves arrive, you and Captain Vilami's men hope to have them surrounded. Once you're ready, let Vilami know. Skipping forward, the plan has succeeded, and the would-be Valera thieves - including [[Belda]] are indeed surrounded. With [[Insight]] 3, you can spot her reaching for her pistol and warn Vilami. Doing so gains you Minor Positive Reputation with the Valian Trading Company. Otherwise if Captain Vilami is shot, he will be out of combat for a few seconds and will be left [[Hobbled]]. Note that all the dialogue options here will result in combat, so there's no hopes of negotiation once you start the heist sequence. Kill [[Belda]] and her accomplices, then head upstairs.\n* Outraged, Ezzali will want Atello Valera's head. She'll give you {{cp2|1500}} and send you to kill him. Head over to the Valera Estate and kill Atello. Make sure to loot the unique items [[Duskfall]] and [[Casità Samelia's Legacy]] from his body.\n* Return to Ezzali to complete the quest, receiving {{cp2|2500}} as a reward.\n* Alternatively, you can turn on the Bardattos. This is effectively the same as siding with the Valeras from the beginning.\n\n===Valera path===\n* Upon completion of [[A Bigger Fish]], and after waiting a few days (or speaking to Ezzali Bardatto about the plot first), talk to Martino and Atello Valera to discover that the heist planned by Martino to break into the Bardattos' vault is already in motion, though it's not going as smoothly as they imagined. Some of the Valera men are engaged in a standoff within the vault, and Martino is concerned that they may be interrogated if caught. He wants you to get [[Belda]], a Valera associate, out of the vault to prevent this from happening.\n* At this point, you can take sides and offer to get Belda out of the vault, otherwise Atello will question your allegiance, starting combat if you choose not to help them. Taking his side will cause the quest [[A Sinking Feeling]] to fail, if you haven't yet completed it.\n* Head over to the Bardatto estate.\n** If you previously informed Ezzali Bardatto about the plot, she will thank you for the information, but will accuse you of siding with the Valeras and will become hostile. You can avoid approaching her to prevent this from happening. If you leave too much time between talking to Atello/Martino and entering the Bardatto Estate, the guards will immediately become hostile upon entering (surprisingly even if you reload a save).\n** If you didn't inform Ezzalli Bardatto about the plot, she will be none the wiser.\n* In any case, if you decide to kill her, make sure to loot a number of unique items from her body: [[Bardatto's Luxury]], [[Deltro's Cage]], and [[Deltro's Cage Helm]].\n* In the vault are a few more Bardatto guards, kill them and continue to Captain Vilami and Belda. Again, reasoning with the Bardattos isn't an option at this point, so you'll have to kill Captain Vilami and his men too. Belda will hide in the corner while you fight. After the fight, talk to her, most of your party will chime in here too. She'll suggest to exit via the window in the room to the left to avoid further confrontation - useful if you avoided combat upstairs (even though returning upstairs won't inherently begin combat).\n* You'll need at least [[Mechanics]] 12 to open the vault, opening a series of lower level locks beforehand. Use some [[Thief's Putty]] if required, else you'll have to come back another time. In the vault are the unique weapons [[Rännig's Wrath]] and [[Resounding Call]], as well as number of other valuables.\n* Return to the Valera estate. They will ask you to take care of Ezzali Bardatto. Doing so and returning to them (or if you already killed Ezzali while saving Belda) will net you minor positive reputation with the Valian Trading Company (given you choose the correct dialogue option), and will complete the quest. As a reward, you will get [[Duskfall]].\n* Alternatively, you can still turn on the Valeras instead of agreeing to kill the Bardatto matriarch. If you have already killed Ezzali, this will fail the quest. Returning to Ezzali will not yield a reward, as she will turn on you for siding with the Valeras in the first place.\n\n===Scorched earth path===\n* This involves killing both families. There are many chances to attack them during dialogue, or you can just attack them whenever.\n\n==Bugs==\n* If you complete both [[A Bigger Fish]], and/or [[A Sinking Feeling]] (and depending how much time has passed since then, while waiting for the heist to begin) - and then mediate peace between the families, the heist sequence of [[Family Pride]] will still be open, despite the fact the quest is completed. In the most recent patch this seems to have been fixed.\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/03_Neketaka_Vailian_District/03_QST_Rival_Houses.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''Family Pride'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| The <b>Queen's Berth</b> district in the city of Neketaka is home to several Vailian families. Two of the most prominent houses, <b>Bardatto</b> and <b>Valera</b>, appear to be in the midst of an escalating feud. Considering the importance of these families, I'm sure the Vailian Trading Company is invested in bringing the dispute to a close.\n|-\n| rowspan=\"15\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Investigate the ongoing feud between the <b>Bardatto</b> and <b>Valera</b> families.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| It may be worth looking into just why these two Houses are pitted against each other. Both families have <b>estates</b> here in <b>Queen's Berth</b>. Speaking with their respective heads should make the source of antagonism clearer.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| <b>Ezzali Bardatto</b> has asked me to find information regarding a possible Valera plot. I'm on the lookout for <b>Zili Valera</b>.\n|-\n| style=\"vertical-align:text-top\" | 20016\n| I informed <b>Ezzali Bardatto</b> of the plan to rob her <b>vault</b>. She is poised to strike against the Valera family, should I agree to assist her.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| <b>Martino Valera</b> has asked me to get rid of some trouble-makers by the local <b>tavern</b> as a means of proving myself. He'd rather they were dealt with permanently, but it's entirely up to me.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| I cleared out the Rauataian soldiers at the tavern. That should put me in <b>Martino Valera's</b> good graces, for whatever that's worth.\n|-\n| style=\"vertical-align:text-top\" | 20014\n| <b>Martino</b> has no further work for the time being, though he suggested that I check back in a few days.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| <b>Atello Valera</b> confessed that his family is in financial trouble. They are finding it difficult to compete with the Royal Deadfire Company.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| The <b>Bardatto family</b> has recently lost a string of investments to corruption among its guardsmen. \n|-\n| style=\"vertical-align:text-top\" | 20002\n| The <b>Valera family</b> now believes the Príncipi to be responsible for the death of a relative, <b>Zili Valera</b>.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| The <b>Valera family</b> now believes the <b>Bardattos</b> to be responsible for the death of a relative, <b>Zili Valera</b>.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| I have decided to try and mediate peace talks between the two families. The first step is to talk to the head of each family and convince them to meet.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| <b>Ezzali</b> has agreed to hear Atello out. I can head back to <b>Atello Valera</b> once I am ready to kick off the talks.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| <b>Atello</b> has agreed to hear Ezzali out. I can head back to <b>Ezzali Bardatto</b> once I am ready to kick off the talks.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| Peace talks have broken down. I don't think this will end in any way but bloodshed.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Eliminate the <b>Bardattos</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| With reluctance, Atello Valera has given in to his son's desire that the <b>Bardatto family</b> be permanently removed from <b>Neketaka</b>. They have asked that I leave no witnesses.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Kill <b>Atello Valera</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| Ezzali Bardatto has given up on any pretense of keeping the peace. She asked me to kill the head of the Valera family, <b>Atello Valera</b>.\n|-\n| style=\"vertical-align:text-top\" | 20015\n| I spoke to <b>Atello Valera</b>, who asked that I turn on <b>Ezzali Bardatto</b>. If I wish to side with the Valera family, I must kill all the Bardattos.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Report to <b>Atello Valera</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| The Bardatto estate is now the scene of a massacre. I can report my success to <b>Atello Valera</b> in his estate in <b>Queen's Berth</b> in Neketaka.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Report to <b>Ezzali Bardatto</b>. '''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| Atello Valera is dead, bringing an end to any challenges to the Bardattos from that corner. <b>Ezzali Bardatto</b> should be pleased.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Survive the meeting.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| Peace negotiations between the Bardatto and Valera families have broken down, and violently. I'll have to fight my way out.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Resolve the situation in the <b>vault</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| Some thieves from the Valera family, led by Belda, have made an attempt on <b>Ezzali Bardatto's vault</b>. Their heist isn't exactly going to plan, and Martino Valera insists I rescue them. \n\nIt looks like the feud has escalated into open hostility. I doubt I'll be any more welcome inside the vault than the thieves were.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| <b>Belda</b> has been killed.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| <b>Captain Vilami</b> has been killed.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''8'''\n| colspan=\"2\" | '''Speak to <b>Ezzali Bardatto</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10008\n| After I helped him out in his duel, Larro pointed me to the Bardatto estate, here in <b>Queen's Berth</b>. There, I can speak to <b>Ezzali Bardatto</b>, the head of the family. \n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''9'''\n| colspan=\"2\" | '''Speak to <b>Atello Valera</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10009\n| After I helped him out in his duel, Orso pointed me to the Valera estate, here in <b>Queen's Berth</b>. There, I can speak to <b>Atello Valera</b>, the head of the family. \n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''10'''\n| colspan=\"2\" | '''Speak to <b>Captain Vilami</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10010\n| Ezzali asked me to speak with <b>Captain Vilami</b> in the <b>Bardatto vault</b>, on the lower level of her estate. We're to set an ambush for the Valera family. \n\nIt looks like this feud has escalated into open hostility. Going forward with this will mean taking up Ezzali's cause.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''11'''\n| colspan=\"2\" | '''Deal with the <b>thieves</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10011\n| The Valera-hired <b>thieves</b> have arrived, as expected. Time to go to work.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| <b>Captain Vilami</b> has been killed.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''12'''\n| colspan=\"2\" | '''Return to <b>Ezzali Bardatto</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10012\n| The thieves are dead, and <b>Ezzali</b> has her evidence. I can report to her on the upper floor of the <b>Bardatto estate</b> in Queen's Berth in Neketaka.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''13'''\n| colspan=\"2\" | '''Return to <b>Atello Valera</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10013\n| I've dealt with Ezzali's guards. <b>Atello</b> and <b>Martino Valera</b> will want an update.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30000\n| Someone critical to the completion of this quest has been killed\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I was able to convince Ezzali Bardatto and Atello Valera to see reason and bring their houses together in a profitable alliance. This should improve their fortunes, along with that of Vailian Trading Company operations in the region. \n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| Atello Valera is dead, putting an end to his feud with Ezzali Bardatto. Ezzali has rewarded me for solving her problem.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| The Bardatto family is dead, bringing an end to one of the Vailian Republic's oldest bloodlines - and their feud with the Valera family.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30004\n| I have brought an end to both families, Bardatto and Valera alike.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30005\n| Peace talks between the Bardatto and Valera families have culminated in a massacre. \n|}",
  "slug": "familyPride",
  "title": "Family Pride"
}
