{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Journal }} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = Gulfaryc's Journal \n| icon           = poe2 journal_brown icon.png\n| description    = 2 Fonivèrno, 2827\n\nThe new year is come. The time for reflection, beginnings and endings.\n\nHere I am, an aged man of sixty years retired from the services of the Steel Garrote. I have no family of which to speak. No tethers bind me to this life but those that bind me to my brothers in the order.\n\nIn the tradition of the new year, I wonder - will I spend my twilight years in swift decline, waiting only to feel the Pallid Knight's touch upon my cheek?\n\nNo. For decades, veterans of the Garrote have traded tales of a legendary mace said to be blessed by Woedica herself. What I would give to behold but one thing touched by the hands of the Exiled Queen!\n\nI will embark on my final quest. I will gather my brothers, find the mace, and with it - a pride that will buoy me to the end my days.\n\nSo be it.\n\n1 Inprima, 2827 Long we have journeyed, my brothers and I. I begin to wonder now if this was a fool's errand, an old man's last grasp at the glory of boyhood tales.\n\nWe left Aedyr in good spirits on a boat bound for the Deadfire. Our good cheer has fled, yet still we are on this cursed boat.\n\nWere the legends a lie? Cud for old soldiers to chew, fodder for talk of \"remember when\" and \"the good old days\"?\n\nI wake in the night thinking I have heard the sound of Wymarc's familiar drunken stumble into the barracks, but it is only the groan of the ship or a deck door swung open and slamming in the wind.\n\nI <xg>miss</xg> the comforts of the Garrote's lair. A roaring fire, strong beer, a tale or two among friends. <xg>Will</xg> I ever know those comforts again?\n\n17 Majestu, 2827 The tide has turned in our favor!\n\nUlfric muscled a tip from a skittish fisherboy in port. There is an ancient shrine on a nearby island, the boy said, and none from his town will venture within a hundred yards of it.\n\nExpecting little more than a benighted ruin, we dropped anchor just off its coast and rowed ashore. And what should we find but a shrine dedicated to the Queen That Was and her mace of legend!\n\nThe mace itself is exquisite, a marvel of craftsmanship. It will look magnificent above the mantle in the Garrote's hideaway. Ah, how my eyes burn to imagine the tales they will tell of us.\n\nWe have decided to rest here for the night and feast on our remaining hard tack and jerky. Tomorrow, we begin our journey home.\n\nSurely Woedica herself guides our path.\n\n18 Majestu, 2827 I cannot remember the last time I have slept so well. Not on the boat, not in the barracks, not even in my own bed as a boy.\n\nPerhaps it is the presence of the shrine that soothes me. Indeed, these past few hours I have known only the peace a man might find in communion with his god.\n\nMy brothers and I have decided to remain here for another night. We are old, and we are weary, and we all find comfort in the presence of the Exiled Queen.\n\nThis is a safe place. Certainly we will find no trouble here.\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Journal\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 0\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = ITEM_MISC_UCI_4_Gulfaryc_Journal\n| location       = * [[Subterranean Temple]]: Carried by [[Gulfaryc]]\n| guid           =5275cdd4-6d5b-4c1d-b36d-90abfac4ee9f\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Journal }} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "gulfarycsJournal",
  "title": "Gulfaryc's journal"
}
