{
  "markdown": "'''{{PAGENAME}}''' is a [quest](/pillarsOfEternityIiDeadfireQuests/) in {{poe2}}.\n\n## Synopsis\n\n \nThe Watcher spoke with Eothas in the ruins of Hasongo but was unable to divert him from his machinations. He bade the Watcher to meet him at a luminous adra pillar in a chain of volcanic islands called Magran's Teeth that rises from the northernmost seas of the Deadfire.\n\n## Consequences\n\n{{Hatnote|This section outlines the consequences and outcomes that may arise by completing this quest}}\n* Completing this quest '''ends all faction quest lines''' if you have not yet completed them up through [Fruitful Alliance](/fruitfulAlliance/) (Huana), [A Shrewd Proposition](/aShrewdProposition/) (Principi), [Clearing Out Crookspur](/clearingOutCrookspur/) (Royal Deadfire Company), or [A Glimpse Beyond](/aGlimpseBeyond/) (Vailian Trading Company). The quests will still be in your journal but it is likely that they will not update or you will have trouble turning them in. The faction quests that follow these will not become available until you do complete He Waits in Fire. They run concurrently with [The Coming Storm](/theComingStorm/).\n* Completing this quest without having completed [A Distant Light](/aDistantLight/) on [Hasongo](/hasongo/) '''forfeits the \"soul\" bonuses from PoE1''' that have not yet been acquired via that quest (including [Effigy's Resentment](/effigysResentment/), [Gift from the Machine](/giftFromTheMachine/)). You may still journey to Hasongo to start/complete [A Distant Light](/aDistantLight/), but the connection to Eothas will already be severed and you will not be able to commune with him to re-learn these abilities, nor will the god conversation following Hasongo be triggered. As a result, one of the three upgrades to the Watcher-only \"Death's Herald\" abilities will also be forfeited (though you will still gain one upgrade during the [god conversation](/godConversation/) following He Waits in Fire).\n* If it has not yet been started or completed, the quest [The Veins of Eora](/theVeinsOfEora/) will be completed upon speaking with Eothas in [Foundations of the Ashen Maw](/foundationsOfTheAshenMaw/).\n* Shortly after the quest, the [Steward](/steward/) will want to speak with you, starting [The Proving](/theProving/), the first quest of {{sss}}.\n\n## Walkthrough\n\n* This quest does not have any prerequisites, and can be completed at any time by simply sailing to Ashen Maw (the quest will start once walking over the bridge in the first area).\n* Once you arrive at the Ashen Maw, much of the garrison has been already wiped out by Eothas who is siphoning essence from a luminous adra pillar in the center of a volcano named the Ashen Maw. Travel deeper into the volcano to meet with him. Enter The Sentinel Wall from the Maw, then talk to the Rathun survivors. You can try to talk them down - say you do not follow Eothas, then use Metaphysics 5 to note your soul wasn't eaten, Religion 5 to ..., or Insight 5 to point out their anger is misdirected. Head down to the Ashen Bridge.\n* To reach Eothas, you need to activate the shrine of Magran in [the Jagged Keep](/theJaggedKeep/). To activate the shrine, you need the [Torc of Bithákten](/torcOfBithakten/) guarded by [Jadaferlas the Ancient](/jadaferlasTheAncient/) in the [Lair of the Ancient](/lairOfTheAncient/). Head there. Jadaferlas is a challenging opponent for wits or brawn. You can find out the nature of her deal with Resolve 11, then use Bluff 8 to ... or Diplomacy 8 to play on her vanity. Then you need to have Resolve 16, Survival 14, or Religion 14 + Priest (Magran) class. If that fails, being honest and having Honest 2 reputation will. She will fly away, allowing you to plunder her hoard and snatch the torc from the essence of Brenthís, the dead Rathun-Priestress of Magran.\n* In the Jagged Keep, the Torc buys you free passage all the way to [Bathor Erkon](/bathorErkon/). In lieu of killing him, you can talk him down if you have Diplomacy 5 or Intellect 15. Then you need to establish that your interests don't align with Eothas’s (eg. by stating he snatched a part of your soul). Then you can reveal the truth of Jadaferlas' betrayal. \n* Fire up the shrine with the Torc. Magran will contact you and explain a few things. Most notably, the fact that she formed the Rathun to ward against kith in order to safeguard Ukaizo - and they are entirely expendable. You can now leave the conversation and talk to the Bathor again. If your skills are high enough, you can convince the Rathun to leave the place before it is destroyed. Place the torc on the shrine, then descend to meet Eothas in the [foundations of the Ashen Maw](/foundationsOfTheAshenMaw/).\n* Eothas will be quite personable and nice - for a massive statue of adra whose single tooth is about your size. He will ask you about the origins of your greatness: Do you think it's innate? Or a result of the experiences that shaped you? After this little nature vs. nurture quandary is behind you, he will give you the opportunity to ask for answers (he will stall you, asking who really wants to know - you or the gods - etc.). Finally, when Magran thoughtfully reminds all of the ''impending volcano eruption and giant tsunami that's coming'', he will reveal his goal:\n<div style=\"margin:0 40px\">{{quote|I want to return the gods to our original purpose. And to allow mortals to worship us - or ignore us - for what we are, not what we pretend to be. When I entered Waidwen, I did so with the intention of illuminating the history of Engwith. I wanted to show all the nations of the Eastern Reach the machines we had used to create ourselves, how we had hidden our true nature from mortals for millennia.\n\nBut even if I had succeeded, my words would have been easy to deny. Belief creates the foundation upon which a mind's reality is built.\n\n###### Why is it so important that mortals know that the gods came from the Engwithans?\n\nWe began with a dream that if we provided guidance to mortals, each generation of souls would grow stronger. And if the souls grew stronger, societies would become better, moving ever closer to achieving the potential we believed all mortals have within them. Over two thousand years have passed. Hundreds of generations have been born, lived, and died. If the world has improved under our guidance, mortals should be prepared to understand the truth. If they have not improved after all of this time, then we have utterly failed in our aims and there should be a reckoning of our faults.\n\nThe time has come for a new covenant between gods and mortals, one forged in the light of truth and understanding between our kind. \n\nI will leave this place and go to the lost city the Huana call Ukaizo. It is there that all souls pass through the machines of the gods, where all souls pass into the Beyond before beginning their next life. When I reach that place, I will find our great machines and tear them to pieces. I will smash the Great Wheel until the lights of Hel all gutter and die.\n\nAnd when my work is done, I will leave this world forever.\n\n[...] \n\nBoth gods and mortals alike rely on the Wheel. We depend on it for the souls that give us power. Mortals depend on it for the lives of future generations. Breaking it will force all of us to face the truth. We will fail together or move forward together. Either ending is preferable to the cycle we still find ourselves in.\n}}</div>\n\n* Then Eothas will promptly save you. The adra giant will take your entire party in his palms to protect them from Magran's wrath. Of course, as your soul is partially embedded inside Eothas, you're in for a very, very bad trip. You will find the part of your soul that was split and get the option to rejoin, just as Eothas carries you away in his palm through the ruins of the Ashen Maw and the fire and brimstone Magran unsuccessfully threw at him.\n* Then Ondra sends her gigantic tsunami to smash Eothas and you. As the water smashes into the titan, you go back to tripping souls. You get the option of reaffirming yourself, with the narration depending on the choice you made at [Sun in Shadow](/sunInShadow/). Then Eothas will set your ship and you down on the water, with ''krakens'' clinging to him (in abject futility). Then he will gently nudge the ship with you southwards, which effectively turns it into a speedboat - and asks that you deliver message of his plans to the rest of the gods. \n* This completes the quest. After being saved by Eothas, you get an upgrade to one of the following Watcher-specific abilities (originally granted at the end of [Stranded](/stranded/)):\n** Upgrade [Sympathy for the Lost](/sympathyForTheLost/) to [Mercy for the Lost](/mercyForTheLost/)\n** Upgrade [No Pity for the Lost](/noPityForTheLost/) to [No Time for the Lost](/noTimeForTheLost/)\n** Upgrade [Chorus of the Lost](/chorusOfTheLost/) to [Commandment of the Lost](/commandmentOfTheLost/)\n\n###### The council\n\n* You come to in the audience hall of [Kahanga Palace](/kahangaPalace/), in the middle of a debate between [Director Castol](/directorCastol/), [Hazanui Karū](/hazanuiKaru/), and [Queen Onekaza II](/queenOnekazaIi/), regarding the information you brought from Eothas. In your sleep-induced mutterings, you reveal Eothas's plan. The kith are understandably concerned about him breaking the mechanism of reincarnation they took for granted - and potentially killing off the pantheon. Once you come to, you are immediately invited to join the talks (just who cleaned you up is not explained, unless you arrived overnight and stand there smelling of ash and fire) as to how address this new development.\n* The discussion is interrupted by the arrival of the Principi, who lay siege to [Queen's Berth](/queensBerth/) and invite themselves to the proceedings under the banner of [Captain Aeldys](/captainAeldys/). Once she makes her entrance, you reveal and clarify Eothas' plans. Although your knowledge is limited, you can speculate that breaking the cycle can extinguish all life on Eora in time - or just admit you have no idea. All faction leaders agree that something needs to be done about this and propose passing through Ondra's Mortar to reach Ukaizo and defend it. Fortunately, your soul is still bound to Eothas, allowing you to sense and locate the god within the storms.\n*[Queen Onekaza II](/queenOnekazaIi/) declares that she will not abide outsiders in Ukaizo, the ancestral home of her people.\n\n## God conversation\n\n* Shortly after completion of [He Waits in Fire](/heWaitsInFire/), the Watcher will commune with [Berath](/berath/) and the other gods regarding the events of the quest. This interaction occurs as a random event while sailing, sometimes immediately after leaving the port.\n* Your choices of dialogue during this conversation will determine which upgrade to [Visage of Death's Herald](/visageOfDeathsHerald/) (or its upgrades) the Watcher receives. Also see [Stranded](/stranded/) and [A Distant Light](/aDistantLight/) for the last two god conversations.\n* A score is tallied representing the amount of times the Watcher made a response of a particular Disposition. Each disposition is associated with an upgrade to [Visage of Death's Herald](/visageOfDeathsHerald/) (and its upgrades). You must choose at least 4 of the dialogue options for the associated ability, and your final \"score\" must be greater than that of the other two scores, with exceptions - see below.\n\n## =Upgrades\n\n=\nThe conditions in-game are very extensive, and are summarized below (with some repeat logic omitted). In cases where you have equal dispositions, the order of presedence is Aggressive > Sassy > Diplomatic (e.g. 4 Aggressive beats 4 Sassy).\n\nEach upgrade adds an [Inspiration](/statusEffectsDeadfireInspirations/) which is granted to the Watcher when using the ability. Diplomatic responses give a Perception Inspiration, Sassy gives Intellect, and Aggressive gives Might. If the ability already grants that Inspiration type, the Inspiration is upgraded to the next tier. For example, [Insightful](/statusEffectsDeadfireInspirations/) (Tier 1) would become [Aware](/statusEffectsDeadfireInspirations/) (Tier 2).\n\nIn order to get [Majesty of Death's Herald](/majestyOfDeathsHerald/), which grants all three types of Tier 1 Inspirations, you must have [Raiment](/raimentOfDeathsHerald/), [Awe](/aweOfDeathsHerald/), or [Cruelty](/crueltyOfDeathsHerald/) by selecting two different disposition responses in each of the previous god interactions, and then select the remaining disposition responses in this one.\n\nIn order to get a Tier 3 Inspiration, you must select the same disposition in all three god conversations. For example, to get the sought-after effect  [Brilliant](/statusEffectsDeadfireInspirations/) (Tier 3 Intellect Inspiration), you must choose Sassy responses in all three conversations.\n\n{| class=\"wikitable\"\n! colspan=\"8\" | Death's Herald upgrade matrix\n|-\n! rowspan=\"3\" | \n! colspan=\"7\" | Upgraded from\n|-\n! [Visage of Death's Herald](/visageOfDeathsHerald/)\n! [Mien of Death's Herald](/mienOfDeathsHerald/)\n! [Wit of Death's Herald](/witOfDeathsHerald/)\n! [Ire of Death's Herald](/ireOfDeathsHerald/)\n! [Raiment of Death's Herald](/raimentOfDeathsHerald/)\n! [Awe of Death's Herald](/aweOfDeathsHerald/)\n! [Cruelty of Death's Herald](/crueltyOfDeathsHerald/)\n|-\n! -\n! (Diplomatic)\n! (Sassy)\n! (Aggressive)\n! (Diplomatic + Sassy)\n! (Diplomatic + Aggressive)\n! (Sassy + Aggressive)\n|-\n! Diplomatic\n| [Mien of Death's Herald](/mienOfDeathsHerald/)\n| -\n| [Raiment of Death's Herald](/raimentOfDeathsHerald/)\n| [Awe of Death's Herald](/aweOfDeathsHerald/) \n| -\n| -\n| [Majesty of Death's Herald](/majestyOfDeathsHerald/)\n|-\n! Sassy\n| [Wit of Death's Herald](/witOfDeathsHerald/)\n| [Raiment of Death's Herald](/raimentOfDeathsHerald/)\n| -\n| [Cruelty of Death's Herald](/crueltyOfDeathsHerald/)\n| -\n| [Majesty of Death's Herald](/majestyOfDeathsHerald/)\n| -\n|-\n! Aggressive\n| [Ire of Death's Herald](/ireOfDeathsHerald/)\n| [Awe of Death's Herald](/aweOfDeathsHerald/)\n| [Cruelty of Death's Herald](/crueltyOfDeathsHerald/)\n| -\n| [Majesty of Death's Herald](/majestyOfDeathsHerald/)\n| -\n| -\n|}\n\n{| class=\"wikitable\"\n! colspan=\"2\" style=\"text-align:left\" | If you have 4 or more Aggressive responses:\n|-\n| And have [Raiment of Death's Herald](/raimentOfDeathsHerald/) (Sassy + Diplomatic)\n| Upgrade to [Majesty of Death's Herald](/majestyOfDeathsHerald/), remove [Raiment of Death's Herald](/raimentOfDeathsHerald/).\n|-\n| And have [Awe of Death's Herald](/aweOfDeathsHerald/) (Aggressive + Diplomatic)\n| Might Inspiration upgraded to higher tier (Tier 1 Perception and Tier 2 Might Inspirations)\n|-\n| And have [Cruelty of Death's Herald](/crueltyOfDeathsHerald/) (Aggressive + Sassy)\n| Might Inspiration upgraded to higher tier (Tier 1 Intellect and Tier 2 Might Inspirations)\n|-\n| And have [Mien of Death's Herald](/mienOfDeathsHerald/) (Diplomatic)\n| Upgrade to [Awe of Death's Herald](/aweOfDeathsHerald/), remove [Mien of Death's Herald](/mienOfDeathsHerald/).\n|-\n| And have [Wit of Death's Herald](/witOfDeathsHerald/) (Sassy)\n| Upgrade to [Cruelty of Death's Herald](/crueltyOfDeathsHerald/), remove [Wit of Death's Herald](/witOfDeathsHerald/).\n|-\n| And have [Ire of Death's Herald](/ireOfDeathsHerald/) (Aggressive)\n| Might Inspiration upgraded to higher tier (Tier 2 or Tier 3) \n|-\n| And have [Visage of Death's Herald](/visageOfDeathsHerald/)\n| Upgrade to [Ire of Death's Herald](/ireOfDeathsHerald/), remove [Visage of Death's Herald](/visageOfDeathsHerald/).\n|-\n! colspan=\"2\" style=\"text-align:left\" | If you have 4 or more Sassy responses:\n|-\n| And have [Raiment of Death's Herald](/raimentOfDeathsHerald/) (Sassy + Diplomatic)\n| Intellect Inspiration upgraded to higher tier (Tier 2 Intellect and Tier 1 Perception Inspirations)\n|-\n| And have [Awe of Death's Herald](/aweOfDeathsHerald/) (Aggressive + Diplomatic)\n| Upgrade to [Majesty of Death's Herald](/majestyOfDeathsHerald/), remove [Awe of Death's Herald](/aweOfDeathsHerald/).\n|-\n| And have [Cruelty of Death's Herald](/crueltyOfDeathsHerald/) (Aggressive + Sassy)\n| Intellect Inspiration upgraded to higher tier (Tier 2 Intellect and Tier 1 Might Inspirations)\n|-\n| And have [Mien of Death's Herald](/mienOfDeathsHerald/) (Diplomatic)\n| Upgrade to [Raiment of Death's Herald](/raimentOfDeathsHerald/), remove [Mien of Death's Herald](/mienOfDeathsHerald/).\n|-\n| And have [Wit of Death's Herald](/witOfDeathsHerald/) (Sassy)\n| Intellect Inspiration upgraded to higher tier (Tier 2 or Tier 3) \n|-\n| And have [Ire of Death's Herald](/ireOfDeathsHerald/) (Aggressive)\n| Upgrade to [Cruelty of Death's Herald](/crueltyOfDeathsHerald/), remove [Ire of Death's Herald](/ireOfDeathsHerald/).\n|-\n| And have [Visage of Death's Herald](/visageOfDeathsHerald/)\n| Upgrade to [Wit of Death's Herald](/witOfDeathsHerald/), remove [Visage of Death's Herald](/visageOfDeathsHerald/).\n|-\n! colspan=\"2\" style=\"text-align:left\" | If you have 4 or more Diplomatic responses:\n|-\n| And have [Raiment of Death's Herald](/raimentOfDeathsHerald/) (Sassy + Diplomatic)\n| Perception Inspiration upgraded to higher tier (Tier 1 Intellect and Tier 2 Perception Inspirations)\n|-\n| And have [Awe of Death's Herald](/aweOfDeathsHerald/) (Aggressive + Diplomatic)\n| Perception Inspiration upgraded to higher tier (Tier 2 Perception and Tier 1 Might Inspirations)\n|-\n| And have [Cruelty of Death's Herald](/crueltyOfDeathsHerald/) (Aggressive + Sassy)\n| Upgrade to [Majesty of Death's Herald](/majestyOfDeathsHerald/), remove [Awe of Death's Herald](/aweOfDeathsHerald/).\n|-\n| And have [Mien of Death's Herald](/mienOfDeathsHerald/) (Diplomatic)\n| Perception Inspiration upgraded to higher tier (Tier 2 or Tier 3) \n|-\n| And have [Wit of Death's Herald](/witOfDeathsHerald/) (Sassy)\n| Upgrade to [Raiment of Death's Herald](/raimentOfDeathsHerald/), remove [Wit of Death's Herald](/witOfDeathsHerald/).\n|-\n| And have [Ire of Death's Herald](/ireOfDeathsHerald/) (Aggressive)\n| Upgrade to [Awe of Death's Herald](/aweOfDeathsHerald/), remove [Ire of Death's Herald](/ireOfDeathsHerald/).\n|-\n| And have [Visage of Death's Herald](/visageOfDeathsHerald/)\n| Upgrade to [Ire of Death's Herald](/ireOfDeathsHerald/), remove [Visage of Death's Herald](/visageOfDeathsHerald/).\n|}\n\n## =Dialogue table\n\n=\n{| class=\"wikitable sortable\"\n! class=\"unsortable\" width=\"35%\" | Dialogue\n! class=\"unsortable\" width=\"35%\" | Response\n! width=\"15%\" | Disposition\n! width=\"15%\" | God&nbsp;reactivity\n|-\n\n| rowspan=\"4\" | ''Woedica screws her mouth into a sneer. \"You fool! If only we had attacked him when I first proposed it-!\" Accusations drip bitter as bile from her tongue.''\n| ''(Passionate) \"Shut up!\"''\n| Aggressive\n| Woedica (Negative)<br/>Ondra (Positive)\n|-\n| ''\"I'll just... wait until you're done.\"''\n| Sassy\n| Woedica (Negative)\n|-\n| ''\"Eothas could be destroying the Wheel right now, and you're <i>arguing?</i>\"''\n| Aggressive\n| Woedica (Negative)\n|-\n| ''\"What's going on here?\"''\n| Diplomatic\n| Berath (Positive)\n|-\n| ''\"We try, but... agreement eludes us.\" Ondra's storm-dark eyes swivel to meet yours.''\n| ''\"We can no longer count on the gods for guidance. Kith will have to figure this out on our own.\"'\n| Diplomatic\n| Ondra (Negative)<br/>Magran (Positive)\n|-\n\n| rowspan=\"2\" | ''Wael's many eyes alight on each god in turn. \"We make little enough progress on our own.\"''\n| ''(Clever) [Roll your eyes.] \"That's obvious.\"''\n| Sassy\n| Hylea (Negative)\n|-\n| ''\"Progress? Are you planning something new?\"''\n| Diplomatic\n| Ondra (Positive)\n|-\n\n| rowspan=\"3\" | ''...The Pallid Knight speaks with the chilly temperance possessed only by the god of death''\n| ''(Passionate) \"That's horrible!\"''\n| Aggressive\n| Berath (Negative)\n|-\n| ''(Honest) \"Whose 'good?' Yours?\"''\n| Sassy\n| Berath (Negative)\n|-\n| ''(Diplomatic) \"A grim but honorable sacrifice.\"''\n| Diplomatic\n| Berath (Positive)\n|-\n\n| rowspan=\"3\" | ''\"But we get ahead of ourselves. First, the Watcher must get to Ukaizo, and that will be a trial all its own.\"''\n| ''\"Good. I could use a challenge.\"''\n| Aggressive\n| Magran (Positive)\n|-\n| ''\"Another? Aren't you bored yet?\"''\n| Sassy\n| Magran (Positive)\n|-\n| ''\"Right, because I haven't had one of <i>those</i> lately.\"''\n| Sassy\n| Magran (Positive)\n|-\n\n| rowspan=\"2\" | ''\"And the Watcher will be forced to reckon with it if he wishes to confront Eothas.\"\n\nThe birds at last linger too long, and Magran slaps them away. They burst into a cloud of essence, then reform, and fly in a screeching chorus back to Hylea.''\n| ''\"Guardian of Ukaizo?\"''\n| Diplomatic\n| Magran (Positive)\n|-\n| ''\"This 'guardian' is but one more thing that will fall before me.\"''\n| Aggressive\n| Magran (Positive)\n|-\n\n| rowspan=\"3\" | ''\"Go prepared, Watcher. The guardian will not stand aside, not even for the Herald of Berath.\"''\n:'''OR'''\n''\"And Eothas will not fight the creature - it would prove little more than a distraction for him, especially as my tsunami and Magran's volcano couldn't stop him.\"''\n| ''\"Won't Eothas take care of it?\"''\n| Diplomatic\n| Ondra (Positive)\n|-\n| ''\"Why can't you just... get rid of it?\"'\n| Sassy\n| Magran (Negative)<br/>Galawain (Negative)\n|-\n| ''\"So I have to fight the Guardian of Ukaizo. Any suggestions?\"''\n| Aggressive\n| Magran (Positive)\n|-\n\n| rowspan=\"3\" | ''\"What do you think of Eothas' scheme to destroy the Wheel?\"''\n| ''(Aggressive) \"It's a long time coming. Kith will finally know what a bunch of frauds you all are.\"'\n| Sassy\n| Woedica (Negative)<br/>Rymrgand (Positive)<br/>Wael (Negative)\n|-\n| ''\"With the gods' guidance we might survive what Eothas plans.\"''\n| Diplomatic\n| Ondra (Positive)<br/>Hylea (Positive)<br/>Woedica (Positive)\n|-\n| ''\"This doesn't feel like the act of a caring god to me.\"''\n| Aggressive\n| Ondra (Positive)<br/>Hylea (Positive)<br/>Magran (Negative)\n|-\n\n| rowspan=\"3\" | ''\"Without sustenance, we starve as any mortal might. We die and leave a great silence behind - an eternal emptiness from which nothing is born.\"''\n| ''\"I prefer to think of it as a very long vacation.\"''\n| Sassy\n| \n|-\n| ''[Nod.]''\n| Diplomatic\n| \n|-\n| ''\"Why do you waste time arguing, then?\"''\n| Aggressive\n| \n|-\n\n| ''\"He believes kith will rise to his challenge. I am not so sure, but I look forward to watching them try.\"''\n| ''(Passionate) \"How did Eothas fool you all? You're the most powerful beings in Eora.\"''\n| Sassy\n| Berath (Negative)<br/>Woedica (Negative)<br/>Hylea (Negative)<br/>Ondra (Negative)<br/>Wael (Positive)\n|-\n\n| rowspan=\"3\" | ''\"What if Eothas is right, and kith succeed in rebuilding the Wheel? What then?\"''\n| ''\"We'll learn and grow, as Eothas intends.\"''\n| Diplomatic\n| Hylea (Positive)<br/>Abydon (Positive)\n|-\n| ''\"Don't worry - there will always be a place for the gods in Eora.\"''\n| Diplomatic\n| Woedica (Positive)<br/>Magran (Positive)\n|-\n| ''(Clever) \"I don't know, but aren't you curious to find out?\"''\n| Sassy\n| Wael (Positive)<br/>Magran (Positive)\n|-\n\n| rowspan=\"5\" | ''The Pallid Knight's eyes bore into yours. \"An impassioned plea from the Hound of Eothas may still temper his actions.\n\n\"Confront him at Ukaizo.\"''\n| ''\"I'll try.\"''\n| Diplomatic\n| Berath (Positive)\n|-\n| ''(Aggressive) \"I will make him heed my words.\"''\n| Aggressive\n| Woedica (Positive)<br/>Skaen (Positive)\n|-\n| ''\"He's not going to listen to me, I'm just a kith.\"''\n| Diplomatic\n| Hylea (Positive)<br/>Rymrgand (Negative)\n|-\n| ''(Aggressive) \"I don't owe you anything anymore.\"''\n| Aggressive\n| Wael (Positive)<br/>Berath (Positive)\n|-\n| ''\"I can't defy Eothas' will.\"''\n| Diplomatic\n| Berath (Negative)<br/>Woedica (Negative)\n|-\n\n| rowspan=\"5\" | ''\"Does that not frighten you? You, kith, who are most vulnerable?\"''\n| ''\"Oh, I'm terrified!\"''\n| Sassy\n| Ondra (Positive)<br/>Hylea (Positive)<br/>Magran (Negative)<br/>Woedica (Negative)\n|-\n| ''(Passionate) \"It does. But I will not let fear rule me.\"''\n| Diplomatic\n| Magran (Positive)<br/>Berath (Positive)<br/>Abydon (Positive)<br/>Galawain (Positive)\n|-\n| ''\"I trust Eothas. There is nothing to fear.\"''\n| Diplomatic\n| Hylea (Positive)\n|-\n| ''\"Fatalism helps no one and solves nothing.\"''\n| Aggressive\n| Magran (Positive)<br/>Berath (Positive)<br/>Wael (Positive)<br/>Ondra (Negative)\n|-\n| ''(Cruel) \"Only the weak know fear.\"'\n| Aggressive\n| Rymrgand (Positive)<br/>Woedica (Positive)\n|}\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/Crit_Path/CP_QST_10_Magran_Teeth.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''He Waits in Fire'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| I spoke with <b>Eothas</b> in the ruins of Hasongo but was unable to divert him from his machinations. He bade me to meet him at a <b>luminous adra pillar</b> in a chain of volcanic islands called <b>Magran's Teeth</b>. If I want to know more about his intentions, I will have to join him there.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| <b>Eothas</b> stands before a <b>pillar of luminous adra</b> in the center of the <b>Ashen Maw</b>, the largest volcano in Magran's Teeth. The god appears to be draining the pillar of its essence.\n|-\n| rowspan=\"6\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Rendezvous with <b>Eothas</b> in <b>Ashen Maw</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Eothas</b> invited me to speak with him further at <b>Ashen Maw</b> in Magran's Teeth, a chain of volcanoes that rises from the <b>northernmost seas of the Deadfire</b>.\n|-\n| style=\"vertical-align:text-top\" | 20018\n| I have marked the location of <b>Ashen Maw</b> on my map. It is the largest volcano within a chain of volcanic islands called <b>Magran's Teeth</b>.\n|-\n| style=\"vertical-align:text-top\" | 20017\n| <b>Eothas</b> is headed for <b>Magran's Teeth</b>, a volcanic chain along the <b>northeastern edge of Deadfire</b>. I have been asked to report this news to <b>Queen Onekaza II</b> in <b>Neketaka</b>.\n|-\n| style=\"vertical-align:text-top\" | 20016\n| I learned <b>Magran's Teeth</b> is a volcanic chain along the <b>northeastern edge of Deadfire</b>. While <b>Queen Onekaza II</b> might have known the location of the <b>Ashen Maw</b>, I'm in no position to ask her now.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| <b>Eothas</b> plans to restore his power somewhere in <b>Magran's Teeth</b>, undoubtedly from a large vein of luminous adra.\n|-\n| rowspan=\"5\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Reach the <b>lower bridge</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| <b>Eothas</b> is siphoning essence from a <b>luminous adra pillar</b> in the center of a volcano named the <b>Ashen Maw</b>. I must travel deeper into the volcano if I wish to meet with him.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| Speaking with the Rathun's warlord, the <b>bathor</b>, within his <b>Jagged Keep</b> may gain me a route to meet with Eothas.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| The <b>Rathun</b> intend to battle <b>Eothas</b> to the bitter end. They're currently planning for a secondary assault from within their fortress, the <b>Jagged Keep</b>.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| When Eothas stormed <b>Ashen Maw</b>, he siphoned souls from many of the <b>Rathun</b>, a sect of Magranite fire giants, living within the volcano.\n|-\n| rowspan=\"10\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Find a way to <b>Eothas</b> through the <b>Jagged Keep</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| I'm closer to <b>Eothas</b>, but I can see no clear route to the adra pillar in the center of the Maw. I'll search the Rathun's fortress, the <b>Jagged Keep</b>.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| The <b>shrine to Magran</b> inside the <b>Jagged Keep</b> is a gateway - kept locked to guard the adra spire within the depths of the Maw.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| Magran's <b>shrine</b> in the <b>Jagged Keep</b> appears to function as an elevating platform.\n|-\n| style=\"vertical-align:text-top\" | 20014\n| I've found a magical torc that bears the symbol of Magran.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| A <b>dragon</b> attacked and killed the Rathun's <b>brenthís</b>.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| <b>Jadaferlas the Ancient</b> hinted that the means to opening a route to <b>Eothas</b> through the <b>Jagged Keep</b> rests with the Rathun's <b>priestess</b> - or what's left of her.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| The <b>Rathun</b> are preparing for an assault against <b>Eothas</b> from within the <b>Jagged Keep</b>. They await the return of their priestess, the <b>brenthís</b>, before they strike.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| The dragon, <b>Jadaferlas the Ancient</b>, refuses to fight Eothas for the Rathun. She will allow me, however, to retrieve the <b>Torc of Bithákten</b> from the <b>brenthís' body</b>.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| Violent tremors are shaking the foundations of the <b>Maw</b>. The volcano is growing increasingly more active.\n|-\n| rowspan=\"7\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Acquire the <b>Torc of Bithákten</b> to access Magran's <b>shrine</b> in the <b>Jagged Keep</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| A <b>shrine</b> to Magran in the back of the <b>Jagged Keep</b> leads to the adra spire on which Eothas feeds. The shrine requires the <b>Torc of Bithákten</b>, a relic sacred to Magran, to operate.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| The Rathun's priestess, the <b>brenthís</b>, bears the <b>Torc of Bithákten</b> which can ignite the shrine. However, she's ventured into the <b>Lair of the Ancient</b> to secure the Ancient's help against Eothas.\n|-\n| style=\"vertical-align:text-top\" | 20015\n| A hanging <b>bridge</b>, <b>west of the Jagged Keep</b>, leads to the <b>Lair of the Ancient</b>.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| A <b>dragon</b> attacked and killed the Rathun's <b>brenthís</b>.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| The dragon, <b>Jadaferlas the Ancient</b>, refuses to fight Eothas for the Rathun. She will allow me, however, to retrieve the <b>Torc of Bithákten</b> from the <b>brenthís' body</b>.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| The <b>bathor</b> blessed me with a protective spell to aid me against the fire and fumes that fill the <b>Lair of the Ancient</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Ignite Magran's <b>shrine</b> to reach the <b>adra spire</b> within the depths of <b>Ashen Maw</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I've acquired the <b>Torc of Bithákten</b>. The relic should lower Magran's <b>shrine</b> from the <b>Jagged Keep</b> into the Maw, opening the way to <b>Eothas</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Speak to <b>Eothas</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| I've lowered Magran's shrine into the bowels of the volcano. Now I can face the god.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Take the torc to Magran's <b>shrine</b> in the <b>Jagged Keep</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| The fire torc I looted off a priestess' corpse may be related to Magran's <b>shrine</b> inside the <b>Jagged Keep</b>. I should take the torc to the shrine to further suss out their connection.\n\n|-\n! colspan=\"3\" | Unused strings\n|-\n| rowspan=\"1\" style=\"vertical-align:text-top; text-align:center\" | '''-'''\n| style=\"vertical-align:text-top\" | 20012\n| The <b>brenthís</b> was wielding a <b>sacred torc</b> when she and several of her Rathun warriors were killed.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| I've spoken with Eothas. I could not deter him from his plan to break the Wheel at Ukaizo.\n|}",
  "raw": "{{Infobox quest poe2\n| name         = He Waits in Fire\n| image        = PE2 He Waits in Fire.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Main quest\n| quest_region = Deadfire - Northeast\n| quest_level  = 12\n| faction      = \n| locations    = Magran's Teeth;Ashen Maw;Lair of the Ancient;The Jagged Keep;Foundations of the Ashen Maw;Kahanga Palace\n| main_npcs    = Eothas;Jadaferlas the Ancient;Bathor Erkon\n| quest_giver  = \n| xp_amount    = 5000\n| xp_type      = Normal\n| xp_level     = 12\n| xp_weights   = 1;1;1;1;1;1;1\n| rewardname1  = Complete the quest\n| reward1      = Upgrade one of the following Watcher abilities:\n* [[Sympathy for the Lost]] to [[Mercy for the Lost]]\n* [[No Pity for the Lost]] to [[No Time for the Lost]]\n* [[Chorus of the Lost]] to [[Commandment of the Lost]]\n| rewardname2  = \n| reward2      =  \n| rewardname3  = \n| reward3      =  \n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = A Distant Light\n| conc         =\n| next         = The Coming Storm\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests|quest]] in {{poe2}}.\n\n==Synopsis== \nThe Watcher spoke with Eothas in the ruins of Hasongo but was unable to divert him from his machinations. He bade the Watcher to meet him at a luminous adra pillar in a chain of volcanic islands called Magran's Teeth that rises from the northernmost seas of the Deadfire.\n\n==Consequences==\n{{Hatnote|This section outlines the consequences and outcomes that may arise by completing this quest}}\n* Completing this quest '''ends all faction quest lines''' if you have not yet completed them up through [[Fruitful Alliance]] (Huana), [[A Shrewd Proposition]] (Principi), [[Clearing Out Crookspur]] (Royal Deadfire Company), or [[A Glimpse Beyond]] (Vailian Trading Company). The quests will still be in your journal but it is likely that they will not update or you will have trouble turning them in. The faction quests that follow these will not become available until you do complete He Waits in Fire. They run concurrently with [[The Coming Storm]].\n* Completing this quest without having completed [[A Distant Light]] on [[Hasongo]] '''forfeits the \"soul\" bonuses from PoE1''' that have not yet been acquired via that quest (including [[Effigy's Resentment]], [[Gift from the Machine]]). You may still journey to Hasongo to start/complete [[A Distant Light]], but the connection to Eothas will already be severed and you will not be able to commune with him to re-learn these abilities, nor will the god conversation following Hasongo be triggered. As a result, one of the three upgrades to the Watcher-only \"Death's Herald\" abilities will also be forfeited (though you will still gain one upgrade during the [[#God conversation|god conversation]] following He Waits in Fire).\n* If it has not yet been started or completed, the quest [[The Veins of Eora]] will be completed upon speaking with Eothas in [[Foundations of the Ashen Maw]].\n* Shortly after the quest, the [[Steward]] will want to speak with you, starting [[The Proving]], the first quest of {{sss}}.\n\n==Walkthrough==\n* This quest does not have any prerequisites, and can be completed at any time by simply sailing to Ashen Maw (the quest will start once walking over the bridge in the first area).\n* Once you arrive at the Ashen Maw, much of the garrison has been already wiped out by Eothas who is siphoning essence from a luminous adra pillar in the center of a volcano named the Ashen Maw. Travel deeper into the volcano to meet with him. Enter The Sentinel Wall from the Maw, then talk to the Rathun survivors. You can try to talk them down - say you do not follow Eothas, then use Metaphysics 5 to note your soul wasn't eaten, Religion 5 to ..., or Insight 5 to point out their anger is misdirected. Head down to the Ashen Bridge.\n* To reach Eothas, you need to activate the shrine of Magran in [[the Jagged Keep]]. To activate the shrine, you need the [[Torc of Bithákten]] guarded by [[Jadaferlas the Ancient]] in the [[Lair of the Ancient]]. Head there. Jadaferlas is a challenging opponent for wits or brawn. You can find out the nature of her deal with Resolve 11, then use Bluff 8 to ... or Diplomacy 8 to play on her vanity. Then you need to have Resolve 16, Survival 14, or Religion 14 + Priest (Magran) class. If that fails, being honest and having Honest 2 reputation will. She will fly away, allowing you to plunder her hoard and snatch the torc from the essence of Brenthís, the dead Rathun-Priestress of Magran.\n* In the Jagged Keep, the Torc buys you free passage all the way to [[Bathor Erkon]]. In lieu of killing him, you can talk him down if you have Diplomacy 5 or Intellect 15. Then you need to establish that your interests don't align with Eothas’s (eg. by stating he snatched a part of your soul). Then you can reveal the truth of Jadaferlas' betrayal. \n* Fire up the shrine with the Torc. Magran will contact you and explain a few things. Most notably, the fact that she formed the Rathun to ward against kith in order to safeguard Ukaizo - and they are entirely expendable. You can now leave the conversation and talk to the Bathor again. If your skills are high enough, you can convince the Rathun to leave the place before it is destroyed. Place the torc on the shrine, then descend to meet Eothas in the [[foundations of the Ashen Maw]].\n* Eothas will be quite personable and nice - for a massive statue of adra whose single tooth is about your size. He will ask you about the origins of your greatness: Do you think it's innate? Or a result of the experiences that shaped you? After this little nature vs. nurture quandary is behind you, he will give you the opportunity to ask for answers (he will stall you, asking who really wants to know - you or the gods - etc.). Finally, when Magran thoughtfully reminds all of the ''impending volcano eruption and giant tsunami that's coming'', he will reveal his goal:\n<div style=\"margin:0 40px\">{{quote|I want to return the gods to our original purpose. And to allow mortals to worship us - or ignore us - for what we are, not what we pretend to be. When I entered Waidwen, I did so with the intention of illuminating the history of Engwith. I wanted to show all the nations of the Eastern Reach the machines we had used to create ourselves, how we had hidden our true nature from mortals for millennia.\n\nBut even if I had succeeded, my words would have been easy to deny. Belief creates the foundation upon which a mind's reality is built.\n\n;Why is it so important that mortals know that the gods came from the Engwithans?\n\nWe began with a dream that if we provided guidance to mortals, each generation of souls would grow stronger. And if the souls grew stronger, societies would become better, moving ever closer to achieving the potential we believed all mortals have within them. Over two thousand years have passed. Hundreds of generations have been born, lived, and died. If the world has improved under our guidance, mortals should be prepared to understand the truth. If they have not improved after all of this time, then we have utterly failed in our aims and there should be a reckoning of our faults.\n\nThe time has come for a new covenant between gods and mortals, one forged in the light of truth and understanding between our kind. \n\nI will leave this place and go to the lost city the Huana call Ukaizo. It is there that all souls pass through the machines of the gods, where all souls pass into the Beyond before beginning their next life. When I reach that place, I will find our great machines and tear them to pieces. I will smash the Great Wheel until the lights of Hel all gutter and die.\n\nAnd when my work is done, I will leave this world forever.\n\n[...] \n\nBoth gods and mortals alike rely on the Wheel. We depend on it for the souls that give us power. Mortals depend on it for the lives of future generations. Breaking it will force all of us to face the truth. We will fail together or move forward together. Either ending is preferable to the cycle we still find ourselves in.\n}}</div>\n\n* Then Eothas will promptly save you. The adra giant will take your entire party in his palms to protect them from Magran's wrath. Of course, as your soul is partially embedded inside Eothas, you're in for a very, very bad trip. You will find the part of your soul that was split and get the option to rejoin, just as Eothas carries you away in his palm through the ruins of the Ashen Maw and the fire and brimstone Magran unsuccessfully threw at him.\n* Then Ondra sends her gigantic tsunami to smash Eothas and you. As the water smashes into the titan, you go back to tripping souls. You get the option of reaffirming yourself, with the narration depending on the choice you made at [[Sun in Shadow]]. Then Eothas will set your ship and you down on the water, with ''krakens'' clinging to him (in abject futility). Then he will gently nudge the ship with you southwards, which effectively turns it into a speedboat - and asks that you deliver message of his plans to the rest of the gods. \n* This completes the quest. After being saved by Eothas, you get an upgrade to one of the following Watcher-specific abilities (originally granted at the end of [[Stranded]]):\n** Upgrade [[Sympathy for the Lost]] to [[Mercy for the Lost]]\n** Upgrade [[No Pity for the Lost]] to [[No Time for the Lost]]\n** Upgrade [[Chorus of the Lost]] to [[Commandment of the Lost]]\n\n;The council\n* You come to in the audience hall of [[Kahanga Palace]], in the middle of a debate between [[Director Castol]], [[Hazanui Karū]], and [[Queen Onekaza II]], regarding the information you brought from Eothas. In your sleep-induced mutterings, you reveal Eothas's plan. The kith are understandably concerned about him breaking the mechanism of reincarnation they took for granted - and potentially killing off the pantheon. Once you come to, you are immediately invited to join the talks (just who cleaned you up is not explained, unless you arrived overnight and stand there smelling of ash and fire) as to how address this new development.\n* The discussion is interrupted by the arrival of the Principi, who lay siege to [[Queen's Berth]] and invite themselves to the proceedings under the banner of [[Captain Aeldys]]. Once she makes her entrance, you reveal and clarify Eothas' plans. Although your knowledge is limited, you can speculate that breaking the cycle can extinguish all life on Eora in time - or just admit you have no idea. All faction leaders agree that something needs to be done about this and propose passing through Ondra's Mortar to reach Ukaizo and defend it. Fortunately, your soul is still bound to Eothas, allowing you to sense and locate the god within the storms.\n*[[Queen Onekaza II]] declares that she will not abide outsiders in Ukaizo, the ancestral home of her people.\n\n==God conversation==\n* Shortly after completion of [[He Waits in Fire]], the Watcher will commune with [[Berath]] and the other gods regarding the events of the quest. This interaction occurs as a random event while sailing, sometimes immediately after leaving the port.\n* Your choices of dialogue during this conversation will determine which upgrade to [[Visage of Death's Herald]] (or its upgrades) the Watcher receives. Also see [[Stranded]] and [[A Distant Light]] for the last two god conversations.\n* A score is tallied representing the amount of times the Watcher made a response of a particular Disposition. Each disposition is associated with an upgrade to [[Visage of Death's Herald]] (and its upgrades). You must choose at least 4 of the dialogue options for the associated ability, and your final \"score\" must be greater than that of the other two scores, with exceptions - see below.\n\n===Upgrades===\nThe conditions in-game are very extensive, and are summarized below (with some repeat logic omitted). In cases where you have equal dispositions, the order of presedence is Aggressive > Sassy > Diplomatic (e.g. 4 Aggressive beats 4 Sassy).\n\nEach upgrade adds an [[Status_effects_(Deadfire)#Inspirations|Inspiration]] which is granted to the Watcher when using the ability. Diplomatic responses give a Perception Inspiration, Sassy gives Intellect, and Aggressive gives Might. If the ability already grants that Inspiration type, the Inspiration is upgraded to the next tier. For example, [[Status_effects_(Deadfire)#Inspirations|Insightful]] (Tier 1) would become [[Status_effects_(Deadfire)#Inspirations|Aware]] (Tier 2).\n\nIn order to get [[Majesty of Death's Herald]], which grants all three types of Tier 1 Inspirations, you must have [[Raiment of Death's Herald|Raiment]], [[Awe of Death's Herald|Awe]], or [[Cruelty of Death's Herald|Cruelty]] by selecting two different disposition responses in each of the previous god interactions, and then select the remaining disposition responses in this one.\n\nIn order to get a Tier 3 Inspiration, you must select the same disposition in all three god conversations. For example, to get the sought-after effect  [[Status_effects_(Deadfire)#Inspirations|Brilliant]] (Tier 3 Intellect Inspiration), you must choose Sassy responses in all three conversations.\n\n{| class=\"wikitable\"\n! colspan=\"8\" | Death's Herald upgrade matrix\n|-\n! rowspan=\"3\" | \n! colspan=\"7\" | Upgraded from\n|-\n! [[Visage of Death's Herald]]\n! [[Mien of Death's Herald]]\n! [[Wit of Death's Herald]]\n! [[Ire of Death's Herald]]\n! [[Raiment of Death's Herald]]\n! [[Awe of Death's Herald]]\n! [[Cruelty of Death's Herald]]\n|-\n! -\n! (Diplomatic)\n! (Sassy)\n! (Aggressive)\n! (Diplomatic + Sassy)\n! (Diplomatic + Aggressive)\n! (Sassy + Aggressive)\n|-\n! Diplomatic\n| [[Mien of Death's Herald]]\n| -\n| [[Raiment of Death's Herald]]\n| [[Awe of Death's Herald]] \n| -\n| -\n| [[Majesty of Death's Herald]]\n|-\n! Sassy\n| [[Wit of Death's Herald]]\n| [[Raiment of Death's Herald]]\n| -\n| [[Cruelty of Death's Herald]]\n| -\n| [[Majesty of Death's Herald]]\n| -\n|-\n! Aggressive\n| [[Ire of Death's Herald]]\n| [[Awe of Death's Herald]]\n| [[Cruelty of Death's Herald]]\n| -\n| [[Majesty of Death's Herald]]\n| -\n| -\n|}\n\n{| class=\"wikitable\"\n! colspan=\"2\" style=\"text-align:left\" | If you have 4 or more Aggressive responses:\n|-\n| And have [[Raiment of Death's Herald]] (Sassy + Diplomatic)\n| Upgrade to [[Majesty of Death's Herald]], remove [[Raiment of Death's Herald]].\n|-\n| And have [[Awe of Death's Herald]] (Aggressive + Diplomatic)\n| Might Inspiration upgraded to higher tier (Tier 1 Perception and Tier 2 Might Inspirations)\n|-\n| And have [[Cruelty of Death's Herald]] (Aggressive + Sassy)\n| Might Inspiration upgraded to higher tier (Tier 1 Intellect and Tier 2 Might Inspirations)\n|-\n| And have [[Mien of Death's Herald]] (Diplomatic)\n| Upgrade to [[Awe of Death's Herald]], remove [[Mien of Death's Herald]].\n|-\n| And have [[Wit of Death's Herald]] (Sassy)\n| Upgrade to [[Cruelty of Death's Herald]], remove [[Wit of Death's Herald]].\n|-\n| And have [[Ire of Death's Herald]] (Aggressive)\n| Might Inspiration upgraded to higher tier (Tier 2 or Tier 3) \n|-\n| And have [[Visage of Death's Herald]]\n| Upgrade to [[Ire of Death's Herald]], remove [[Visage of Death's Herald]].\n|-\n! colspan=\"2\" style=\"text-align:left\" | If you have 4 or more Sassy responses:\n|-\n| And have [[Raiment of Death's Herald]] (Sassy + Diplomatic)\n| Intellect Inspiration upgraded to higher tier (Tier 2 Intellect and Tier 1 Perception Inspirations)\n|-\n| And have [[Awe of Death's Herald]] (Aggressive + Diplomatic)\n| Upgrade to [[Majesty of Death's Herald]], remove [[Awe of Death's Herald]].\n|-\n| And have [[Cruelty of Death's Herald]] (Aggressive + Sassy)\n| Intellect Inspiration upgraded to higher tier (Tier 2 Intellect and Tier 1 Might Inspirations)\n|-\n| And have [[Mien of Death's Herald]] (Diplomatic)\n| Upgrade to [[Raiment of Death's Herald]], remove [[Mien of Death's Herald]].\n|-\n| And have [[Wit of Death's Herald]] (Sassy)\n| Intellect Inspiration upgraded to higher tier (Tier 2 or Tier 3) \n|-\n| And have [[Ire of Death's Herald]] (Aggressive)\n| Upgrade to [[Cruelty of Death's Herald]], remove [[Ire of Death's Herald]].\n|-\n| And have [[Visage of Death's Herald]]\n| Upgrade to [[Wit of Death's Herald]], remove [[Visage of Death's Herald]].\n|-\n! colspan=\"2\" style=\"text-align:left\" | If you have 4 or more Diplomatic responses:\n|-\n| And have [[Raiment of Death's Herald]] (Sassy + Diplomatic)\n| Perception Inspiration upgraded to higher tier (Tier 1 Intellect and Tier 2 Perception Inspirations)\n|-\n| And have [[Awe of Death's Herald]] (Aggressive + Diplomatic)\n| Perception Inspiration upgraded to higher tier (Tier 2 Perception and Tier 1 Might Inspirations)\n|-\n| And have [[Cruelty of Death's Herald]] (Aggressive + Sassy)\n| Upgrade to [[Majesty of Death's Herald]], remove [[Awe of Death's Herald]].\n|-\n| And have [[Mien of Death's Herald]] (Diplomatic)\n| Perception Inspiration upgraded to higher tier (Tier 2 or Tier 3) \n|-\n| And have [[Wit of Death's Herald]] (Sassy)\n| Upgrade to [[Raiment of Death's Herald]], remove [[Wit of Death's Herald]].\n|-\n| And have [[Ire of Death's Herald]] (Aggressive)\n| Upgrade to [[Awe of Death's Herald]], remove [[Ire of Death's Herald]].\n|-\n| And have [[Visage of Death's Herald]]\n| Upgrade to [[Ire of Death's Herald]], remove [[Visage of Death's Herald]].\n|}\n\n===Dialogue table===\n{| class=\"wikitable sortable\"\n! class=\"unsortable\" width=\"35%\" | Dialogue\n! class=\"unsortable\" width=\"35%\" | Response\n! width=\"15%\" | Disposition\n! width=\"15%\" | God&nbsp;reactivity\n|-\n\n| rowspan=\"4\" | ''Woedica screws her mouth into a sneer. \"You fool! If only we had attacked him when I first proposed it-!\" Accusations drip bitter as bile from her tongue.''\n| ''(Passionate) \"Shut up!\"''\n| Aggressive\n| Woedica (Negative)<br/>Ondra (Positive)\n|-\n| ''\"I'll just... wait until you're done.\"''\n| Sassy\n| Woedica (Negative)\n|-\n| ''\"Eothas could be destroying the Wheel right now, and you're <i>arguing?</i>\"''\n| Aggressive\n| Woedica (Negative)\n|-\n| ''\"What's going on here?\"''\n| Diplomatic\n| Berath (Positive)\n|-\n| ''\"We try, but... agreement eludes us.\" Ondra's storm-dark eyes swivel to meet yours.''\n| ''\"We can no longer count on the gods for guidance. Kith will have to figure this out on our own.\"'\n| Diplomatic\n| Ondra (Negative)<br/>Magran (Positive)\n|-\n\n| rowspan=\"2\" | ''Wael's many eyes alight on each god in turn. \"We make little enough progress on our own.\"''\n| ''(Clever) [Roll your eyes.] \"That's obvious.\"''\n| Sassy\n| Hylea (Negative)\n|-\n| ''\"Progress? Are you planning something new?\"''\n| Diplomatic\n| Ondra (Positive)\n|-\n\n| rowspan=\"3\" | ''...The Pallid Knight speaks with the chilly temperance possessed only by the god of death''\n| ''(Passionate) \"That's horrible!\"''\n| Aggressive\n| Berath (Negative)\n|-\n| ''(Honest) \"Whose 'good?' Yours?\"''\n| Sassy\n| Berath (Negative)\n|-\n| ''(Diplomatic) \"A grim but honorable sacrifice.\"''\n| Diplomatic\n| Berath (Positive)\n|-\n\n| rowspan=\"3\" | ''\"But we get ahead of ourselves. First, the Watcher must get to Ukaizo, and that will be a trial all its own.\"''\n| ''\"Good. I could use a challenge.\"''\n| Aggressive\n| Magran (Positive)\n|-\n| ''\"Another? Aren't you bored yet?\"''\n| Sassy\n| Magran (Positive)\n|-\n| ''\"Right, because I haven't had one of <i>those</i> lately.\"''\n| Sassy\n| Magran (Positive)\n|-\n\n| rowspan=\"2\" | ''\"And the Watcher will be forced to reckon with it if he wishes to confront Eothas.\"\n\nThe birds at last linger too long, and Magran slaps them away. They burst into a cloud of essence, then reform, and fly in a screeching chorus back to Hylea.''\n| ''\"Guardian of Ukaizo?\"''\n| Diplomatic\n| Magran (Positive)\n|-\n| ''\"This 'guardian' is but one more thing that will fall before me.\"''\n| Aggressive\n| Magran (Positive)\n|-\n\n| rowspan=\"3\" | ''\"Go prepared, Watcher. The guardian will not stand aside, not even for the Herald of Berath.\"''\n:'''OR'''\n''\"And Eothas will not fight the creature - it would prove little more than a distraction for him, especially as my tsunami and Magran's volcano couldn't stop him.\"''\n| ''\"Won't Eothas take care of it?\"''\n| Diplomatic\n| Ondra (Positive)\n|-\n| ''\"Why can't you just... get rid of it?\"'\n| Sassy\n| Magran (Negative)<br/>Galawain (Negative)\n|-\n| ''\"So I have to fight the Guardian of Ukaizo. Any suggestions?\"''\n| Aggressive\n| Magran (Positive)\n|-\n\n| rowspan=\"3\" | ''\"What do you think of Eothas' scheme to destroy the Wheel?\"''\n| ''(Aggressive) \"It's a long time coming. Kith will finally know what a bunch of frauds you all are.\"'\n| Sassy\n| Woedica (Negative)<br/>Rymrgand (Positive)<br/>Wael (Negative)\n|-\n| ''\"With the gods' guidance we might survive what Eothas plans.\"''\n| Diplomatic\n| Ondra (Positive)<br/>Hylea (Positive)<br/>Woedica (Positive)\n|-\n| ''\"This doesn't feel like the act of a caring god to me.\"''\n| Aggressive\n| Ondra (Positive)<br/>Hylea (Positive)<br/>Magran (Negative)\n|-\n\n| rowspan=\"3\" | ''\"Without sustenance, we starve as any mortal might. We die and leave a great silence behind - an eternal emptiness from which nothing is born.\"''\n| ''\"I prefer to think of it as a very long vacation.\"''\n| Sassy\n| \n|-\n| ''[Nod.]''\n| Diplomatic\n| \n|-\n| ''\"Why do you waste time arguing, then?\"''\n| Aggressive\n| \n|-\n\n| ''\"He believes kith will rise to his challenge. I am not so sure, but I look forward to watching them try.\"''\n| ''(Passionate) \"How did Eothas fool you all? You're the most powerful beings in Eora.\"''\n| Sassy\n| Berath (Negative)<br/>Woedica (Negative)<br/>Hylea (Negative)<br/>Ondra (Negative)<br/>Wael (Positive)\n|-\n\n| rowspan=\"3\" | ''\"What if Eothas is right, and kith succeed in rebuilding the Wheel? What then?\"''\n| ''\"We'll learn and grow, as Eothas intends.\"''\n| Diplomatic\n| Hylea (Positive)<br/>Abydon (Positive)\n|-\n| ''\"Don't worry - there will always be a place for the gods in Eora.\"''\n| Diplomatic\n| Woedica (Positive)<br/>Magran (Positive)\n|-\n| ''(Clever) \"I don't know, but aren't you curious to find out?\"''\n| Sassy\n| Wael (Positive)<br/>Magran (Positive)\n|-\n\n| rowspan=\"5\" | ''The Pallid Knight's eyes bore into yours. \"An impassioned plea from the Hound of Eothas may still temper his actions.\n\n\"Confront him at Ukaizo.\"''\n| ''\"I'll try.\"''\n| Diplomatic\n| Berath (Positive)\n|-\n| ''(Aggressive) \"I will make him heed my words.\"''\n| Aggressive\n| Woedica (Positive)<br/>Skaen (Positive)\n|-\n| ''\"He's not going to listen to me, I'm just a kith.\"''\n| Diplomatic\n| Hylea (Positive)<br/>Rymrgand (Negative)\n|-\n| ''(Aggressive) \"I don't owe you anything anymore.\"''\n| Aggressive\n| Wael (Positive)<br/>Berath (Positive)\n|-\n| ''\"I can't defy Eothas' will.\"''\n| Diplomatic\n| Berath (Negative)<br/>Woedica (Negative)\n|-\n\n| rowspan=\"5\" | ''\"Does that not frighten you? You, kith, who are most vulnerable?\"''\n| ''\"Oh, I'm terrified!\"''\n| Sassy\n| Ondra (Positive)<br/>Hylea (Positive)<br/>Magran (Negative)<br/>Woedica (Negative)\n|-\n| ''(Passionate) \"It does. But I will not let fear rule me.\"''\n| Diplomatic\n| Magran (Positive)<br/>Berath (Positive)<br/>Abydon (Positive)<br/>Galawain (Positive)\n|-\n| ''\"I trust Eothas. There is nothing to fear.\"''\n| Diplomatic\n| Hylea (Positive)\n|-\n| ''\"Fatalism helps no one and solves nothing.\"''\n| Aggressive\n| Magran (Positive)<br/>Berath (Positive)<br/>Wael (Positive)<br/>Ondra (Negative)\n|-\n| ''(Cruel) \"Only the weak know fear.\"'\n| Aggressive\n| Rymrgand (Positive)<br/>Woedica (Positive)\n|}\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/Crit_Path/CP_QST_10_Magran_Teeth.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''He Waits in Fire'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| I spoke with <b>Eothas</b> in the ruins of Hasongo but was unable to divert him from his machinations. He bade me to meet him at a <b>luminous adra pillar</b> in a chain of volcanic islands called <b>Magran's Teeth</b>. If I want to know more about his intentions, I will have to join him there.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| <b>Eothas</b> stands before a <b>pillar of luminous adra</b> in the center of the <b>Ashen Maw</b>, the largest volcano in Magran's Teeth. The god appears to be draining the pillar of its essence.\n|-\n| rowspan=\"6\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Rendezvous with <b>Eothas</b> in <b>Ashen Maw</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Eothas</b> invited me to speak with him further at <b>Ashen Maw</b> in Magran's Teeth, a chain of volcanoes that rises from the <b>northernmost seas of the Deadfire</b>.\n|-\n| style=\"vertical-align:text-top\" | 20018\n| I have marked the location of <b>Ashen Maw</b> on my map. It is the largest volcano within a chain of volcanic islands called <b>Magran's Teeth</b>.\n|-\n| style=\"vertical-align:text-top\" | 20017\n| <b>Eothas</b> is headed for <b>Magran's Teeth</b>, a volcanic chain along the <b>northeastern edge of Deadfire</b>. I have been asked to report this news to <b>Queen Onekaza II</b> in <b>Neketaka</b>.\n|-\n| style=\"vertical-align:text-top\" | 20016\n| I learned <b>Magran's Teeth</b> is a volcanic chain along the <b>northeastern edge of Deadfire</b>. While <b>Queen Onekaza II</b> might have known the location of the <b>Ashen Maw</b>, I'm in no position to ask her now.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| <b>Eothas</b> plans to restore his power somewhere in <b>Magran's Teeth</b>, undoubtedly from a large vein of luminous adra.\n|-\n| rowspan=\"5\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Reach the <b>lower bridge</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| <b>Eothas</b> is siphoning essence from a <b>luminous adra pillar</b> in the center of a volcano named the <b>Ashen Maw</b>. I must travel deeper into the volcano if I wish to meet with him.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| Speaking with the Rathun's warlord, the <b>bathor</b>, within his <b>Jagged Keep</b> may gain me a route to meet with Eothas.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| The <b>Rathun</b> intend to battle <b>Eothas</b> to the bitter end. They're currently planning for a secondary assault from within their fortress, the <b>Jagged Keep</b>.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| When Eothas stormed <b>Ashen Maw</b>, he siphoned souls from many of the <b>Rathun</b>, a sect of Magranite fire giants, living within the volcano.\n|-\n| rowspan=\"10\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Find a way to <b>Eothas</b> through the <b>Jagged Keep</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| I'm closer to <b>Eothas</b>, but I can see no clear route to the adra pillar in the center of the Maw. I'll search the Rathun's fortress, the <b>Jagged Keep</b>.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| The <b>shrine to Magran</b> inside the <b>Jagged Keep</b> is a gateway - kept locked to guard the adra spire within the depths of the Maw.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| Magran's <b>shrine</b> in the <b>Jagged Keep</b> appears to function as an elevating platform.\n|-\n| style=\"vertical-align:text-top\" | 20014\n| I've found a magical torc that bears the symbol of Magran.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| A <b>dragon</b> attacked and killed the Rathun's <b>brenthís</b>.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| <b>Jadaferlas the Ancient</b> hinted that the means to opening a route to <b>Eothas</b> through the <b>Jagged Keep</b> rests with the Rathun's <b>priestess</b> - or what's left of her.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| The <b>Rathun</b> are preparing for an assault against <b>Eothas</b> from within the <b>Jagged Keep</b>. They await the return of their priestess, the <b>brenthís</b>, before they strike.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| The dragon, <b>Jadaferlas the Ancient</b>, refuses to fight Eothas for the Rathun. She will allow me, however, to retrieve the <b>Torc of Bithákten</b> from the <b>brenthís' body</b>.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| Violent tremors are shaking the foundations of the <b>Maw</b>. The volcano is growing increasingly more active.\n|-\n| rowspan=\"7\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Acquire the <b>Torc of Bithákten</b> to access Magran's <b>shrine</b> in the <b>Jagged Keep</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| A <b>shrine</b> to Magran in the back of the <b>Jagged Keep</b> leads to the adra spire on which Eothas feeds. The shrine requires the <b>Torc of Bithákten</b>, a relic sacred to Magran, to operate.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| The Rathun's priestess, the <b>brenthís</b>, bears the <b>Torc of Bithákten</b> which can ignite the shrine. However, she's ventured into the <b>Lair of the Ancient</b> to secure the Ancient's help against Eothas.\n|-\n| style=\"vertical-align:text-top\" | 20015\n| A hanging <b>bridge</b>, <b>west of the Jagged Keep</b>, leads to the <b>Lair of the Ancient</b>.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| A <b>dragon</b> attacked and killed the Rathun's <b>brenthís</b>.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| The dragon, <b>Jadaferlas the Ancient</b>, refuses to fight Eothas for the Rathun. She will allow me, however, to retrieve the <b>Torc of Bithákten</b> from the <b>brenthís' body</b>.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| The <b>bathor</b> blessed me with a protective spell to aid me against the fire and fumes that fill the <b>Lair of the Ancient</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Ignite Magran's <b>shrine</b> to reach the <b>adra spire</b> within the depths of <b>Ashen Maw</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I've acquired the <b>Torc of Bithákten</b>. The relic should lower Magran's <b>shrine</b> from the <b>Jagged Keep</b> into the Maw, opening the way to <b>Eothas</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Speak to <b>Eothas</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| I've lowered Magran's shrine into the bowels of the volcano. Now I can face the god.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Take the torc to Magran's <b>shrine</b> in the <b>Jagged Keep</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| The fire torc I looted off a priestess' corpse may be related to Magran's <b>shrine</b> inside the <b>Jagged Keep</b>. I should take the torc to the shrine to further suss out their connection.\n\n|-\n! colspan=\"3\" | Unused strings\n|-\n| rowspan=\"1\" style=\"vertical-align:text-top; text-align:center\" | '''-'''\n| style=\"vertical-align:text-top\" | 20012\n| The <b>brenthís</b> was wielding a <b>sacred torc</b> when she and several of her Rathun warriors were killed.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| I've spoken with Eothas. I could not deter him from his plan to break the Wheel at Ukaizo.\n|}",
  "slug": "heWaitsInFire",
  "title": "He Waits in Fire"
}
