{
  "markdown": "'''{{Pagename nd}}''' is a document in {{poe2}}.\n\n## Description\n\n{{Description|{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap:{{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = Journal Page\n| icon           = poe2 tattered note icon.png\n| description    = It has been a stroke of unimaginable fortune to find an adra vein in such pristine condition. The essence is so concentrated here that, even from the far side of the corridor, the pillar's light pulses like a star. At times I almost feel as if I can sense it, like the warmth of sunlight upon the skin.\n\nWe will need to reinforce the central chamber before attempting further excavations. The ruins are unstable, and Sela's motley workforce of savages and paupers grows more fearful by the day.\n\nWith the assistance of a single Watcher, we could trace the essence in the primary vein, and isolate those deposits worthy of extraction. I've petitioned Director Castol in Neketaka for such a resource, but I am continually rebuffed. \n\nIt is unthinkable that the Vailian Trading Company cannot isolate, within the vast borders of its considerable influence, a single suitable candidate.\n\nI must assume that the wretched Elette woman is hoarding them for her fanciful experiments. Transportation! As if we have the time to expend on such frivolities.\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Document\n| item_category  = \n| requirements   = \n| is_soulbound   = no\n| is_unique      = no\n| value          = 0\n| range          = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| location       = * [[Engwithan Dig Site]]: In [[Oderisi]]'s workshop.\n| internalname   = ITEM_MISC_09_PM_Notes_Oderisi_Spire\n| guid           = a5f83258-6711-42cb-9dce-e4394fbdcac5\n}}\n'''{{Pagename nd}}''' is a document in {{poe2}}.\n\n==Description==\n{{Description|{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap:{{#var:location}}|;|x|x|\\n}}",
  "slug": "journalPageDigSite",
  "title": "Journal page (dig site)"
}
