{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Kabara Reku Shrine.png\n| image         = \n| caption_map   = \n| name          = Kābara Reku Shrine\n| type          = Scripted interaction\n| description   = \n| exits         = \n| sub_locations = \n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Poko Kohara\n| plants        = \n| internalname  = \n| lsc           = \n| icon          = Icon Huana Shrine.png\n}}\n'''{{Pagename nd}}''' is a scripted interaction on [[Poko Kohara]]. It is located at the coordinates 23° 46' S, 62° 55' E.\n\n== Background ==\nKābara Reku Shrine is a small shrine dedicated to the god [[Berath|Rikihu]], the [[Huana]] portrayal of Berath. It is located to the west of [[Poko Kohara ruins]], and due to it's isolation, does not see many pilgrimages.\n\n== Interaction ==\n* This interaction is very much like [[Teo Ramunga]], however there are no Huana to bother you here - simplifying the interaction a bit.\n* Upon approaching the shrine, you can use Survival 6 to look around. Succeeding tells you that the shrine could be a good place to rest.\n* With Religion 5, you can approach and identify the statue as that of Rikuhu, the Huana rendition of Berath. It is the shape of a pair of stone eels, twisting up and around the sculpture, each eel is clinging to the tail of the other, creating an unbroken circuit. Along the base of the shrine is an inscription: <i>\"Some flee. Others fight. Rikuhu consumes all.\"</i> If the check fails, you admire the craftsmanship - but cannot determine who the shrine is dedicated to. You can tell that is has been some time since the shrine was tended to.\n* At this point, if you passed the above check you can either choose to kneel and pray at the shrine, or desecrate the shrine. Otherwise, you can set up camp and rest (even if you didn't pass the survival check), which will pass 8 hours of time and leave you rested.\n* As a Druid, Cipher or Monk you can meditate which count as a regular rest (without food) and doesn't give any buff.\n* If you choose to kneel and prey, you will receive the buff [[Status effects (Deadfire)#Misc bonuses|Rikuhu's Blessing]] (+2 [[Resolve]]). This buff lasts until the next rest, and you can return at any time to renew it.\n* Desecrating the shrine will yield no bonuses or immediate reprecussions, however you will be unable to return to the shrine.\n\n== Gallery ==\n<gallery mode=\"nolines\">\nFile:RE si shrine desert.png\n</gallery>",
  "slug": "kabaraRekuShrine",
  "title": "Kābara Reku Shrine"
}
