{
  "raw": "{{Infobox location poe2\n| game          = lax1\n| map           = LAX01 Kazuwari.png\n| caption_map   = \n| name          = Kazuwari\n| type          = Island\n| description   = \n| exits         = Pillars of Eternity II: Deadfire world map{{!}}World map\n| main_location = Deadfire Archipelago\n| sub_locations = Rebūtara Pass;Temple of Toamowhai\n| merchant      = \n| internalname  = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{lax1}}.\n\n==Background==\nThe Kazuwari island is located in the western Deadfire and is considered a holy place to the worshipers of [[Galawain]] among the [[Huana]]. The island is subjugated to the will of the Faces of the Hunt, representing the aspects of Galawain and conflict endemic to all life. Although the Temple of Toamowhai is centuries old, it's constantly maintain by a legion of devoted followers and servants of the Faces, which were created when the centuries-long slaughter in the arena fed enough souls into the walls of the temple to allow them to emerge. However, a few months ago, the song spun by the spirits that make up the Faces changed, prompting [[Humaire]] to send [[Muātu]] out to seek out a [[Watcher]] - in a rather unorthodox fashion.\n\nThe reason is simple. While Kazuwari was always a major destination for upstarts and would-be heroes seeking to gain glory or relive old days, the challenges have grown increasingly unfair and the island hostile to life. While this is expected of Galawain, the challenges appear to be intended less as a test of mettle and more as a way to sate the growing bloodlust of the Faces. Gallons of blood spilt during the centuries aren't enough, not when they can get fresh blood of green challengers forced to go against seasoned, ancient monstrosities. The decision was made after Humaire obtained, through [[Engari]], a fragment of the Watcher's battle with the Drake, which manifested an echo in the arena - which proved itself in battle, imppressively so.\n\n==Points of interest==\n* This island is vast and labyrinthine. The only safe access point is at the waterfall to the southeast, with a trail that leads inland through jungle passing through [[Rebūtara Pass]].\n* [[File:Icon Temple of Toamowhai.png|50px|left]] '''[[Temple of Toamowhai]]''': Populated area and quest hub of Kazuwari, consisting of a large stone arena surrounded by a semicircle shaped construction.<br clear=\"left\"/>\n* [[File:Icon Trees.png|50px|left]] '''[[Rebūtara Pass]]''': A small, but critical pass to the southeast of Kazuwari.<br clear=\"left\"/>\n* [[File:Icon Shrine.png|50px|left]] '''Huaba Maha Depths''': A small, derelict shrine to Galawain, with a small well that can provide a point of entrance to the Crucible. You can check the area for traps with Perception 14, revealing one that's been ruined by the passage of centuries. History 12 allows you to identify the stone statues as jaguars, rendered in the abstract Huana style, dedicated to the jungle. Guardians, perhaps.<br clear=\"left\"/>\n* [[File:Icon Hilltop Stone.png|50px|left]] '''Hiuahariki Rise''': This steep hill leads to an old proving stone (identified with History 6), a Huana tradition used to resolve tribal conflicts through rituals, rather than violence. You can use it to gain entrance into the arena by using magical abilities (Maura's tentacles), chanter phrases (If their Bones Still Slept...), or raw physical might (18). Failing to move it up the hill can cause injury, unless aided by a character with Might 14. Up the hill is an entrance to the ruin with a receptacle for the stone. The three Faces are carved onto the doors, representing Toamowhai. To open up the way, you either need the proving rock or Might 16 to push it down. The passage leads into the [[Temple of Toamowhai]].<br clear=\"left\"/>\n* [[File:Icon Bridge.png|50px|left]] '''Pingaka Ravine''': A scripted interaction that focuses on crossing the ravine through a rickety bridge. Has several skill checks. Survival 13 allows you to discover the wood is basically tinder, unusable as support. Mechanics 12 shows that the rope is stronger, but could use reinforcement.  Stealth 15 reveals that each piece of wood examined looks like the kind one would avoid trying to sneak over. To cross the bridge, you can either try going ahead (good luck), search for another route (Survival + Mechanics 14 each), which reveals its the only way forward and will require either reinforcing with materials or magic. Reinforcing the bridge consumes two days and results in your party becoming fatigued, while reinforcing with magic allows you to pick a mage to use Lashing Vine, Wicked Briars or Tanglefoot (druid), Thorny Roots or binding web (sorcerer?), or ... to cross over. The location disappears after successfully crossing the bridge. <br clear=\"left\"/>\n* [[File:Icon Cliffs Tropical.png|50px|left]] '''[[Whakupoko Lowveld]]''': A dense forest where you seek an artifact related to the Slayer.<br clear=\"left\"/>\n* [[File:Icon Forest Dark.png|50px|left]] '''[[Kōhatekana Expanse]]''': An even ''denser'' forest where you seek an artifact related to the Seeker.<br clear=\"left\"/>\n* [[File:Icon Cliffs.png|50px|left]] '''[[Tiebe o Waiapu]]''': A blasted expanse of sand and stone where you seek the Survivor's artifact.<br clear=\"left\"/>\n* [[File:Icon Burial Mound.png|50px|left]] '''Burial Site'''",
  "slug": "kazuwari",
  "title": "Kazuwari"
}
