{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = Legacy of the Tacan\n| icon           = poe2 book_tome_green icon.png\n| description    = This slim volume tells the tale of the Tacan, a people who lived along the banks of the Acqui River on the fertile Ixamitl Plains. It details their rise to prominence in the region and their eventual demise at the hands of their ancient enemies, the Quechmatl people.\n\nA significant portion of the book is given over to examining the role of the Tacan's order of monks, the Nalpazca, in Tacan society. The Nalpazca believed that transcendence could only be attained by overcoming one's personal vanity, the desire for pleasure, and fear of death. To that end, they engaged in pointedly anti-social behavior, various forms of self-mutilation, and meditation with or consumption of the recently deceased.\n\nThe Nalpazca were led by an anitlei, or master warrior, the last of whom was a man named Ixepillo. Ixepillo was charged with protecting his people from the Quechmatl and other threats, but in a tragic twist of fate, Ixepillo died before he was able to pass on his sacred knowledge on to the man poised to take his place.\n\nThe book dwells on this failure for some time, its author apparently of the belief that it was this one error that gave the Quechmatl the opening they needed to launch their attack. The book's author goes on to describe how he attempted to instigate a popular uprising among his people against the Quechmatl, but his efforts were unsuccessful, as the Tacan were by then too broken by the destruction of their culture to muster much of a defense.\n\nThe volume concludes with an exhortation for the reader not to mourn the Tacan's passing, but to learn what they had to teach, and to teach others in turn.\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Book\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 80\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Pillars_1_Reactivity_Legacy_of_the_Tacan\n| location       = \n| guid           =bea291f9-fd57-4a3b-a0af-2093a6515992\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "legacyOfTheTacan",
  "title": "Legacy of the Tacan"
}
