{
  "markdown": "| rewardname3  = Save or free Oswald\n| reward3      = [Cowl of the Piercing Gaze](/cowlOfThePiercingGaze/) (dropped by [Inquisitor Lödwyn](/inquisitorLodwyn/));[Drunkard's Regret](/drunkardsRegret/) (optional);Oswald as a crew member\n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         =\n| internalname = 09_QST_Erol_is_Missing\n| guid         = 22b8fc97-d68b-4fd6-b93e-65d7f0c9a621\n}}\n'''{{PAGENAME}}''' is a [side quest](/pillarsOfEternityIiDeadfireQuestsSideQuest/) in {{poe2}}.\n\n## Synopsis\n\n[Kahn](/kahn/) asks you to help her find [Oswald](/oswald/), an old elf who owes her 5,000 coppers. Oswald favored [Aenalys](/aenalys/), one of the courtesans on the second level of [The Wild Mare](/theWildMare/).\n\n## Overview\n\n# Talk to [Kahn](/kahn/) in [The Wild Mare](/theWildMare/).\n# Find [Oswald](/oswald/)'s whereabouts by obtaining his journal, either by stealing it from [Aenalys](/aenalys/)' armoire, or by convincing her to give it to you, returning to Kahn once you have it.\n# Travel to [Oathbinder's Sanctum](/oathbindersSanctum/) and either rescue Oswald from the cultists, or let him die.\n# Return to Kahn and tell her what happened, or lie and give her money\n\n## Walkthrough\n\nThis quest can be started by either coming across [Oathbinder's Sanctum](/oathbindersSanctum/) during your travels (see [below](/alternativeRoute/)), or by talking with Kahn in The Wild Mare.\n* Talk to Kahn to get the rundown of the quest. Oswald owes her {{cp2|5000}}, and she's offering 20% if you can find him and return the money. You can push her a bit in order to bump it up to 40% (no check required), and with [Diplomacy](/diplomacy/) 5 up to 60%, and then with the [Merchant](/merchant/) background up to 80%.\n* Kahn tells you that Oswald was especially fond of [Aenalys](/aenalys/), one of the courtesans upstairs. Head upstairs and talk to find out more. She will deny knowing him and try to kick him out. You can use [Diplomacy](/diplomacy/) 4, [Streetwise](/streetwise/) 3, or [Insight](/insight/) 4 to make her spill the beans (or pay {{cp2|250}}). She will explain that Oswald was quite sentimental and visited her to listen to old epics in Eld Aedyran. However, he started behaving like a paranoiac in recent days and eventually gave her his [journal](/oswaldsJournal/) for safekeeping, then disappeared. She will direct you to her armoire.\n* Otherwise, you need to break into her armoire and pilfer it for himself, then return to Kahn to read through it. She will wonder where they've taken. You can prod her memory with [Survival](/survival/) 4 or a Deadfire origin. She will eventually mention a weird old temple in the [Karatapu Channel](/karatapuChannel/) to the southwest of Neketaka. Head to the [Oathbinder's Sanctum](/oathbindersSanctum/) by ship.\n\n'''Finding Oswald'''\n* Make your way through the sanctum. On the fourth floor you will come across a group of Woedican cultists led by [Inquisitor Lödwyn](/inquisitorLodwyn/). They accuse Oswald of oath breaking, and sentence him to death. You can choose to fight and save Oswald, watch him die from the shadows, convince them to let him go, or side with them and allow him to die.\n** If you discovered the soul of a murdered innocent on the second floor, you can either side with the cultists, or talk them down by convincing them they have wronged many souls.\n*** If you're honest with them and say that they killed only one innocent, you can then let them carry on with their judgement. They will reward you with {{cp2|1400}} for your good faith, though you lose relationship with [Aloth](/aloth/) and [Serafen](/serafen/). This completes the quest, and you will be escorted back to the entrance.\n*** If you lie and say that they wrongly killed \"A handful\". Passing a hidden [Bluff](/bluff/) 3 check will cause her to question you (looping back to the previous dialogue options), and failing will cause her to attack immediately.\n*** You can talk them down by lying, saying they killed \"Too many to count\". This requires a hidden [Bluff](/bluff/) 7 check to succeed, otherwise they will attack immediately. Accepting what you have said, Lödwyn agrees to let Oswald go, and the cultists escort you both back to the first floor of the dungeon.\n** If you step in and save Oswald (either by talking them down, or killing the cultists), and have 6 [Diplomacy](/diplomacy/) or 5 [Intimidate](/intimidate/), he will give you a unique ring, [Drunkard's Regret](/drunkardsRegret/) that saves you from hangovers if you drink while wearing it. He will also offer to join your crew. Oswald will also come clean, and tells you that he's broke and can't afford to pay Kahn back.\n** If you let him die (either by hanging back and letting the judgement carry out, or killing the lot of them, NOT by siding with the cultists, as they will escort you out) you can loot the ring from his body, and discover that he doesn't actually have the money after all.\n** Note that if you started the quest via entering the sanctum (and not via Kahn), deciding Oswalds fate will complete the quest.\n* Either way, you can head back to the Wild Mare and talk to Kahn to wrap things up.\n** If you let him die, you can tell her that he was executed. She will shed a tear for Oswald, but will accept the fact  and leave.\n** If you let him live or die, Kahn will be nonplussed about the whole affair, all she cares about is the 5000 coppers. You can lie to her and give her the \"cut\" (between {{cp2|1000}} and {{cp2|4000}}, depending on your prior arrangement) and she'll leave happy. Otherwise you can be honest and tell her than Oswald was flat broke. She'll be annoyed, deeply, and storm off, leaving the Archipelago.\n\n## =Alternative route\n\n=\nIf you went to Oathbinder's Sanctum prior to talking with Kahn, the quest will complete once the fate of Oswald is decided. Upon returning to Kahn (assuming you do) the following interaction will occur:\n* You're able to tell her that you met him not long ago, in a humongous pyramid dedicated to Woedica, or lie to her and say that he's elsewhere\n** If you let Oswald die - You can tell her the truth, and say that he died, or lie to her and say that he's totally fine and went his own way.\n** If you let Oswald live, and either didn't add him to your crew (or he isn't on your current active crew) - You can tell her that you saved him, but left him to his own devices.\n** Either way, she doesn't care for the details, and asks if he had any coin on him. \n*** You can tell the truth again and say that he was broke. She thanks you for the information, accepts the fact, and leaves.\n*** Or you can lie to her, and say that Oswald was loaded, and that his riches belong to you now. She'll ask you to hand over the coin (see below).\n* If you let Oswald live, and he is currently part of your active crew, Kahn opens by asking if you're the captain with the \"ancient Aedyran elf on your crew\", claiming that he owes her money and that it's your responsibility as his captain to pay his debts.\n** The debt is {{cp2|5000}}, though with [Diplomacy](/diplomacy/) 6 you can negotiate it down to half the amount ({{cp2|2500}}). \n** If you pay her, she takes the money, and tells you that she's sorry that Oswald dragged you into this, though she's glad that you've given him honest work.\n** Otherwise, you can tell her that Oswald is nothing but a broke old drunk. As above, she will storm off angrily.\n** With [Intimidate](/intimidate/) 8, you can express your badassery for just having waded through an ancient pyramid filled with monsters and cultists. This will shut her up, and she will quickly down her drink and leave.\n\n* Interestingly, you can re-trigger the start of the quest again by saying \"Why do you care?\", or lying about Oswalds whereabouts upon first talking to Kahn. While this doesn't un-complete the quest, it essentially makes the quest act as if you had already talked to Kahn before finding Oswald, thereby opening up the \"returning\" dialogue tree as per the Kahn quest route.\n* You gain no XP for any of this, as the quest will already be finished.\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/09_Port_Maje/09_QST_Erol_is_Missing.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''Lost Dues in Good Faith'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Kahn</b> has asked me to help her find <b>Oswald</b>, an old elf who owes her 5,000 coppers.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| I stumbled across a strange impromptu court at the bottom of the <b>Oathbinder's Sanctum.</b>\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Talk to <b>Aenalys</b> about <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| Kahn mentioned that Oswald favored <b>Aenalys</b>, one of the courtesans on the <b>second level</b> of the <b>Wild Mare</b>.\n\nKahn told me that Aenalys refused to speak to her about Oswald or his whereabouts. She suggested I might have better luck with Aenalys instead.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| Though <b>Aenalys</b> wouldn't tell me anything about Oswald, she did seem nervous about something in her <b>armoire</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Give <b>Oswald's journal</b> to <b>Kahn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I found Oswald's journal in Aenalys' armoire. <b>Kahn</b> will want to read it. I can find her on the <b>ground floor</b> of the <b>Wild Mare</b>.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| From what I read in <b>Oswald's</b> journal, it appears someone's been following him for some time. Strangely, the final entry in the journal is just a drawing of Woedica's broken crown symbol. <b>Kahn</b> might know more.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Find the ancient temple near the <b>Karatapu Channel</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| Kahn heard tell of a massive temple dedicated to Woedica on a large island near the <b>Karatapu Channel</b> <b>southwest of Neketaka</b>.\n\nKahn suspects that Oswald was kidnapped and taken there by whomever has been stalking him.\n\nShe asked me to travel to the temple and get her money from Oswald, one way or another.\n|-\n| rowspan=\"6\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Search for <b>Oswald</b> inside <b>Oathbinder's Sanctum</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| I found the temple Kahn told me about. With any luck, <b>Oswald's</b> inside and still alive - or at least his money is still on his corpse.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| Judging by the lit candles on the altar in the pyramid's entrance, it seems someone has been here recently.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| I found the soul of a person who appeared to have been brought here by mysterious figures and put on trial. The soul insisted they were innocent. Perhaps the kidnappers were wrong about their victim, or maybe they just didn't care.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| Based on a note I found on a corpse, it seems someone named <b>Inquisitor Lödwyn</b> is the leader of whatever group is currently occupying this pyramid.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| I found <b>Oswald</b>. He's been put on trial for oathbreaking, and his chances don't look. He'll probably die if I don't intervene.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''8'''\n| colspan=\"2\" | '''Speak to <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10008\n| <b>Oswald</b> was held captive by a cult of overzealous Woedicans and put on trial for oathbreaking. I convinced the people who kidnapped him to let him go.\n\nI need to talk to him about the money he owes <b>Kahn.</b>\n|-\n| style=\"vertical-align:text-top\" | 20000\n| I managed to talk down the <b>Oswald's captors</b>. Though they agreed to leave peaceably, I killed them all anyway.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''9'''\n| colspan=\"2\" | '''Speak to <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10009\n| <b>Oswald</b> was held captive by a cult of overzealous Woedicans and put on trial for oathbreaking. I saved Oswald from his fate and killed the people who'd kidnapped him.\n\nI need to talk to him about the money he owes <b>Kahn</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''21'''\n| colspan=\"2\" | '''Get <b>Kahn's money</b> from <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10021\n| <b>Oswald</b> was held captive by a cult of overzealous Woedicans and put on trial for oathbreaking. He didn't survive their judgment.\n\nThe money he owes <b>Kahn</b> might still be on his body.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''23'''\n| colspan=\"2\" | '''Intervene, or watch the scene play out.'''\n|-\n| style=\"vertical-align:text-top\" | 10023\n| I discovered an elven man named <b>Oswald</b> being put on trial by what appear to be agents of Woedica. I suspect he won't survive this situation without my help.\n\nHe told the agents that he could make them rich. I could save him and demand a reward... or I could just take the money off his body.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''24'''\n| colspan=\"2\" | '''Search <b>Oswald's</b> body.'''\n|-\n| style=\"vertical-align:text-top\" | 10024\n| The elf on trial was killed by his captors. Before he died, he mentioned that he could make his captors rich if they set him free.\n\nI should search his body and see just how much money he had.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''25'''\n| colspan=\"2\" | '''Speak to <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10025\n| <b>Oswald</b> was being held captive by an overzealous cult of Woedicans and put on trial for the crime of oathbreaking.\n\nI saved Oswald and killed his captors. I should speak to him about a reward.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''26'''\n| colspan=\"2\" | '''Speak to <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10026\n| <b>Oswald</b> was being held captive by an overzealous cult of Woedicans and put on trial for the crime of oathbreaking.\n\nI convinced Oswald's captors to let him go. I should speak to him about a reward.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''27'''\n| colspan=\"2\" | '''Return to <b>Kahn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10027\n| I searched Oswald's body, but didn't find the money he mentioned.\n\nI suspect <b>Kahn</b> at the <b>Wild Mare</b> won't be pleased to hear this.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''28'''\n| colspan=\"2\" | '''Return to <b>Kahn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10028\n| I spoke with Oswald and discovered he's completely broke. I suspect <b>Kahn</b> at the <b>Wild Mare</b> won't be pleased to hear this.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''29'''\n| colspan=\"2\" | '''Return to <b>Kahn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10029\n| I spoke with Oswald and discovered he's completely broke. I suspect <b>Kahn</b> at the <b>Wild Mare</b> won't be pleased to hear this.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''33'''\n| colspan=\"2\" | '''Intervene or watch the scene play out.'''\n|-\n| style=\"vertical-align:text-top\" | 10033\n| I found <b>Oswald</b> held by a cult of Woedicans. I could intervene to help him, or just take <b>Kahn's money</b> off of his body after the cult is done with him.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''35'''\n| colspan=\"2\" | '''Return to <b>Kahn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10035\n| Oswald was held captive by a cult of overzealous Woedicans and put on trial for oathbreaking. I didn't interfere with the cult and Oswald died. As it turned out, he didn't have Kahn's money anyway.\n\nI need to return to <b>Kahn</b> in the <b>Wild Mare</b> and let her know. I suspect she won't be pleased.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| I saved Oswald from his captors by killing them all.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I saved Oswald from his captors by convincing them to let him go.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30002\n| Kahn died.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| Oswald died.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30004\n| Kahn ran off to Oathbinder's Sanctum to find Oswald's ring. I'm not sure what will happen to her.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30007\n| The man on trial, Oswald, was killed. Unfortunately, he didn't have the money he'd claimed to.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30012\n| I sided with the Woedicans holding a man named Oswald on trial. He didn't have the money he claimed, but the court rewarded me for my faith.\n|}",
  "raw": "{{Infobox quest poe2\n| name         = Lost Dues in Good Faith\n| image        = PE2 Lost Dues in Good Faith.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Side quest\n| quest_region = Deadfire - Southwest\n| quest_level  = 4\n| faction      = \n| locations    = Queen's Berth;The Wild Mare;Oathbinder's Sanctum\n| main_npcs    = Kahn;Aenalys;Inquisitor Lödwyn;Oswald\n| companion    = Xoti\n| quest_giver  = Kahn\n| xp_amount    = 800\n| xp_type      = Normal\n| xp_level     = 4\n| xp_weights   = 1;1;1;1;1;1;1;1;1;1;1;1;1;1;1;1\n| rewardname1  = Let Oswald die\n| reward1      = [[Drunkard's Regret]] (if you loot Oswald)\n| rewardname2  = Side with the cultists\n| reward2      = {{cp2|1400}}\n| rewardname3  = Save or free Oswald\n| reward3      = [[Cowl of the Piercing Gaze]] (dropped by [[Inquisitor Lödwyn]]);[[Drunkard's Regret]] (optional);Oswald as a crew member\n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         =\n| internalname = 09_QST_Erol_is_Missing\n| guid         = 22b8fc97-d68b-4fd6-b93e-65d7f0c9a621\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests#Side quest|side quest]] in {{poe2}}.\n\n==Synopsis==\n[[Kahn]] asks you to help her find [[Oswald]], an old elf who owes her 5,000 coppers. Oswald favored [[Aenalys]], one of the courtesans on the second level of [[The Wild Mare]].\n\n==Overview==\n# Talk to [[Kahn]] in [[The Wild Mare]].\n# Find [[Oswald]]'s whereabouts by obtaining his journal, either by stealing it from [[Aenalys]]' armoire, or by convincing her to give it to you, returning to Kahn once you have it.\n# Travel to [[Oathbinder's Sanctum]] and either rescue Oswald from the cultists, or let him die.\n# Return to Kahn and tell her what happened, or lie and give her money\n\n==Walkthrough==\nThis quest can be started by either coming across [[Oathbinder's Sanctum]] during your travels (see [[#Alternative route|below]]), or by talking with Kahn in The Wild Mare.\n* Talk to Kahn to get the rundown of the quest. Oswald owes her {{cp2|5000}}, and she's offering 20% if you can find him and return the money. You can push her a bit in order to bump it up to 40% (no check required), and with [[Diplomacy]] 5 up to 60%, and then with the [[Merchant]] background up to 80%.\n* Kahn tells you that Oswald was especially fond of [[Aenalys]], one of the courtesans upstairs. Head upstairs and talk to find out more. She will deny knowing him and try to kick him out. You can use [[Diplomacy]] 4, [[Streetwise]] 3, or [[Insight]] 4 to make her spill the beans (or pay {{cp2|250}}). She will explain that Oswald was quite sentimental and visited her to listen to old epics in Eld Aedyran. However, he started behaving like a paranoiac in recent days and eventually gave her his [[Oswald's Journal|journal]] for safekeeping, then disappeared. She will direct you to her armoire.\n* Otherwise, you need to break into her armoire and pilfer it for himself, then return to Kahn to read through it. She will wonder where they've taken. You can prod her memory with [[Survival]] 4 or a Deadfire origin. She will eventually mention a weird old temple in the [[Karatapu Channel]] to the southwest of Neketaka. Head to the [[Oathbinder's Sanctum]] by ship.\n\n'''Finding Oswald'''\n* Make your way through the sanctum. On the fourth floor you will come across a group of Woedican cultists led by [[Inquisitor Lödwyn]]. They accuse Oswald of oath breaking, and sentence him to death. You can choose to fight and save Oswald, watch him die from the shadows, convince them to let him go, or side with them and allow him to die.\n** If you discovered the soul of a murdered innocent on the second floor, you can either side with the cultists, or talk them down by convincing them they have wronged many souls.\n*** If you're honest with them and say that they killed only one innocent, you can then let them carry on with their judgement. They will reward you with {{cp2|1400}} for your good faith, though you lose relationship with [[Aloth]] and [[Serafen]]. This completes the quest, and you will be escorted back to the entrance.\n*** If you lie and say that they wrongly killed \"A handful\". Passing a hidden [[Bluff]] 3 check will cause her to question you (looping back to the previous dialogue options), and failing will cause her to attack immediately.\n*** You can talk them down by lying, saying they killed \"Too many to count\". This requires a hidden [[Bluff]] 7 check to succeed, otherwise they will attack immediately. Accepting what you have said, Lödwyn agrees to let Oswald go, and the cultists escort you both back to the first floor of the dungeon.\n** If you step in and save Oswald (either by talking them down, or killing the cultists), and have 6 [[Diplomacy]] or 5 [[Intimidate]], he will give you a unique ring, [[Drunkard's Regret]] that saves you from hangovers if you drink while wearing it. He will also offer to join your crew. Oswald will also come clean, and tells you that he's broke and can't afford to pay Kahn back.\n** If you let him die (either by hanging back and letting the judgement carry out, or killing the lot of them, NOT by siding with the cultists, as they will escort you out) you can loot the ring from his body, and discover that he doesn't actually have the money after all.\n** Note that if you started the quest via entering the sanctum (and not via Kahn), deciding Oswalds fate will complete the quest.\n* Either way, you can head back to the Wild Mare and talk to Kahn to wrap things up.\n** If you let him die, you can tell her that he was executed. She will shed a tear for Oswald, but will accept the fact  and leave.\n** If you let him live or die, Kahn will be nonplussed about the whole affair, all she cares about is the 5000 coppers. You can lie to her and give her the \"cut\" (between {{cp2|1000}} and {{cp2|4000}}, depending on your prior arrangement) and she'll leave happy. Otherwise you can be honest and tell her than Oswald was flat broke. She'll be annoyed, deeply, and storm off, leaving the Archipelago.\n\n===Alternative route===\nIf you went to Oathbinder's Sanctum prior to talking with Kahn, the quest will complete once the fate of Oswald is decided. Upon returning to Kahn (assuming you do) the following interaction will occur:\n* You're able to tell her that you met him not long ago, in a humongous pyramid dedicated to Woedica, or lie to her and say that he's elsewhere\n** If you let Oswald die - You can tell her the truth, and say that he died, or lie to her and say that he's totally fine and went his own way.\n** If you let Oswald live, and either didn't add him to your crew (or he isn't on your current active crew) - You can tell her that you saved him, but left him to his own devices.\n** Either way, she doesn't care for the details, and asks if he had any coin on him. \n*** You can tell the truth again and say that he was broke. She thanks you for the information, accepts the fact, and leaves.\n*** Or you can lie to her, and say that Oswald was loaded, and that his riches belong to you now. She'll ask you to hand over the coin (see below).\n* If you let Oswald live, and he is currently part of your active crew, Kahn opens by asking if you're the captain with the \"ancient Aedyran elf on your crew\", claiming that he owes her money and that it's your responsibility as his captain to pay his debts.\n** The debt is {{cp2|5000}}, though with [[Diplomacy]] 6 you can negotiate it down to half the amount ({{cp2|2500}}). \n** If you pay her, she takes the money, and tells you that she's sorry that Oswald dragged you into this, though she's glad that you've given him honest work.\n** Otherwise, you can tell her that Oswald is nothing but a broke old drunk. As above, she will storm off angrily.\n** With [[Intimidate]] 8, you can express your badassery for just having waded through an ancient pyramid filled with monsters and cultists. This will shut her up, and she will quickly down her drink and leave.\n\n* Interestingly, you can re-trigger the start of the quest again by saying \"Why do you care?\", or lying about Oswalds whereabouts upon first talking to Kahn. While this doesn't un-complete the quest, it essentially makes the quest act as if you had already talked to Kahn before finding Oswald, thereby opening up the \"returning\" dialogue tree as per the Kahn quest route.\n* You gain no XP for any of this, as the quest will already be finished.\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/09_Port_Maje/09_QST_Erol_is_Missing.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''Lost Dues in Good Faith'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Kahn</b> has asked me to help her find <b>Oswald</b>, an old elf who owes her 5,000 coppers.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| I stumbled across a strange impromptu court at the bottom of the <b>Oathbinder's Sanctum.</b>\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Talk to <b>Aenalys</b> about <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| Kahn mentioned that Oswald favored <b>Aenalys</b>, one of the courtesans on the <b>second level</b> of the <b>Wild Mare</b>.\n\nKahn told me that Aenalys refused to speak to her about Oswald or his whereabouts. She suggested I might have better luck with Aenalys instead.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| Though <b>Aenalys</b> wouldn't tell me anything about Oswald, she did seem nervous about something in her <b>armoire</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Give <b>Oswald's journal</b> to <b>Kahn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I found Oswald's journal in Aenalys' armoire. <b>Kahn</b> will want to read it. I can find her on the <b>ground floor</b> of the <b>Wild Mare</b>.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| From what I read in <b>Oswald's</b> journal, it appears someone's been following him for some time. Strangely, the final entry in the journal is just a drawing of Woedica's broken crown symbol. <b>Kahn</b> might know more.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Find the ancient temple near the <b>Karatapu Channel</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| Kahn heard tell of a massive temple dedicated to Woedica on a large island near the <b>Karatapu Channel</b> <b>southwest of Neketaka</b>.\n\nKahn suspects that Oswald was kidnapped and taken there by whomever has been stalking him.\n\nShe asked me to travel to the temple and get her money from Oswald, one way or another.\n|-\n| rowspan=\"6\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Search for <b>Oswald</b> inside <b>Oathbinder's Sanctum</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| I found the temple Kahn told me about. With any luck, <b>Oswald's</b> inside and still alive - or at least his money is still on his corpse.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| Judging by the lit candles on the altar in the pyramid's entrance, it seems someone has been here recently.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| I found the soul of a person who appeared to have been brought here by mysterious figures and put on trial. The soul insisted they were innocent. Perhaps the kidnappers were wrong about their victim, or maybe they just didn't care.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| Based on a note I found on a corpse, it seems someone named <b>Inquisitor Lödwyn</b> is the leader of whatever group is currently occupying this pyramid.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| I found <b>Oswald</b>. He's been put on trial for oathbreaking, and his chances don't look. He'll probably die if I don't intervene.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''8'''\n| colspan=\"2\" | '''Speak to <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10008\n| <b>Oswald</b> was held captive by a cult of overzealous Woedicans and put on trial for oathbreaking. I convinced the people who kidnapped him to let him go.\n\nI need to talk to him about the money he owes <b>Kahn.</b>\n|-\n| style=\"vertical-align:text-top\" | 20000\n| I managed to talk down the <b>Oswald's captors</b>. Though they agreed to leave peaceably, I killed them all anyway.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''9'''\n| colspan=\"2\" | '''Speak to <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10009\n| <b>Oswald</b> was held captive by a cult of overzealous Woedicans and put on trial for oathbreaking. I saved Oswald from his fate and killed the people who'd kidnapped him.\n\nI need to talk to him about the money he owes <b>Kahn</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''21'''\n| colspan=\"2\" | '''Get <b>Kahn's money</b> from <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10021\n| <b>Oswald</b> was held captive by a cult of overzealous Woedicans and put on trial for oathbreaking. He didn't survive their judgment.\n\nThe money he owes <b>Kahn</b> might still be on his body.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''23'''\n| colspan=\"2\" | '''Intervene, or watch the scene play out.'''\n|-\n| style=\"vertical-align:text-top\" | 10023\n| I discovered an elven man named <b>Oswald</b> being put on trial by what appear to be agents of Woedica. I suspect he won't survive this situation without my help.\n\nHe told the agents that he could make them rich. I could save him and demand a reward... or I could just take the money off his body.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''24'''\n| colspan=\"2\" | '''Search <b>Oswald's</b> body.'''\n|-\n| style=\"vertical-align:text-top\" | 10024\n| The elf on trial was killed by his captors. Before he died, he mentioned that he could make his captors rich if they set him free.\n\nI should search his body and see just how much money he had.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''25'''\n| colspan=\"2\" | '''Speak to <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10025\n| <b>Oswald</b> was being held captive by an overzealous cult of Woedicans and put on trial for the crime of oathbreaking.\n\nI saved Oswald and killed his captors. I should speak to him about a reward.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''26'''\n| colspan=\"2\" | '''Speak to <b>Oswald</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10026\n| <b>Oswald</b> was being held captive by an overzealous cult of Woedicans and put on trial for the crime of oathbreaking.\n\nI convinced Oswald's captors to let him go. I should speak to him about a reward.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''27'''\n| colspan=\"2\" | '''Return to <b>Kahn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10027\n| I searched Oswald's body, but didn't find the money he mentioned.\n\nI suspect <b>Kahn</b> at the <b>Wild Mare</b> won't be pleased to hear this.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''28'''\n| colspan=\"2\" | '''Return to <b>Kahn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10028\n| I spoke with Oswald and discovered he's completely broke. I suspect <b>Kahn</b> at the <b>Wild Mare</b> won't be pleased to hear this.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''29'''\n| colspan=\"2\" | '''Return to <b>Kahn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10029\n| I spoke with Oswald and discovered he's completely broke. I suspect <b>Kahn</b> at the <b>Wild Mare</b> won't be pleased to hear this.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''33'''\n| colspan=\"2\" | '''Intervene or watch the scene play out.'''\n|-\n| style=\"vertical-align:text-top\" | 10033\n| I found <b>Oswald</b> held by a cult of Woedicans. I could intervene to help him, or just take <b>Kahn's money</b> off of his body after the cult is done with him.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''35'''\n| colspan=\"2\" | '''Return to <b>Kahn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10035\n| Oswald was held captive by a cult of overzealous Woedicans and put on trial for oathbreaking. I didn't interfere with the cult and Oswald died. As it turned out, he didn't have Kahn's money anyway.\n\nI need to return to <b>Kahn</b> in the <b>Wild Mare</b> and let her know. I suspect she won't be pleased.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| I saved Oswald from his captors by killing them all.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I saved Oswald from his captors by convincing them to let him go.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30002\n| Kahn died.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| Oswald died.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30004\n| Kahn ran off to Oathbinder's Sanctum to find Oswald's ring. I'm not sure what will happen to her.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30007\n| The man on trial, Oswald, was killed. Unfortunately, he didn't have the money he'd claimed to.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30012\n| I sided with the Woedicans holding a man named Oswald on trial. He didn't have the money he claimed, but the court rewarded me for my faith.\n|}",
  "slug": "lostDuesInGoodFaith",
  "title": "Lost Dues in Good Faith"
}
