{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Maukotu's Canopy.png\n| image         = PE2 Maukotu's Canopy Jungle.png\n| caption_map   = \n| name          = Maukotu's Canopy\n| type          = Scripted interaction\n| description   = \n| exits         = \n| sub_locations = Jungle\n| merchant      = \n| innkeeper     = \n| inhabitants   = Dank Spore (Deadfire){{!}}Dank Spore;Sporeling (Deadfire){{!}}Sporeling;Jungle lurker{{!}}Jungle Lurker;Trixie\n| main_location = Neketaka Island\n| plants        = \n| internalname  = \n| lsc           = \n| icon          = Icon Forest Bright.png\n}}\n'''{{Pagename nd}}''' is a scripted interaction on [[Neketaka Island]], heading southwest inland of [[Neketaka]]. It is located at the coordinates 17° 56' S, 45° 44' E.\n\n== Background ==\nMaukotu's Canopy is an area within the dense hilly jungles to the west of Neketaka. Evidently it is home to a number of Lurkers and Sporelings.\n\n== Interaction ==\n* When you first enter the area, you'll discover a seemingly abandoned campsite. As you move closer you see pair of bodies, torn apart and mostly-eaten. With Perception 13, you can examine the area closely to discover that whatever came through the area likely came and left from the south by the way the trees and brush are bent aside. You also see that the campsite is thoroughly destroyed, and the fire has been stomped out.\n* After examining the area, you can search for the presence of spirits to reveal that [[Lurkers]] were the cause of the carnage. The defender fought back using ice-enchanted arrows, but it was no use.\n* Searching for salvage shows that the kith were hunters, and will give you the following items: 4x [[Fang (item)|Fang]], 2x [[Antler]], 5x [[Pelt]] around the campsite, and 3x [[Sugar]], 5x [[Milk]], 2x [[Murkberries]], 13x [[Water]], 6x [[Egg]], 4x [[Pork]] and 7x [[Fresh Fruit]] in a chest in the collapsed tent.\n* With Survival 10, you can examine the tracks to the south to show they are in fact Lurker tracks, and that they seemed to be dragging something heavy behind them when they left.\n* After investigating the area, you have the option to either bury or burn the bodies. In both cases this will result in positive reputation with [[Eder]] and [[Xoti]] (Pro-Eothasians) for returning their souls to the cycle.\n* With Xoti in your party, you'll also have the option to harvest the souls for [[The Lantern of Gaun]].\n\n'''Follow the tracks'''\n* Following the tracks deeper into the forest leads you to a clearing, and a sight not entirely unexpected, a group of Lurkers blending into their surroundings.\n* Using a Spyglass will also reveal a number of smaller sporelings dotted amongst the lurkers and the mangled corpse of a young elven woman grasping an intricately-tooled bow, shimmering with a fine layer of frost.\n* With Stealth 8, you can sneak closer to avoid immediately entering combat.\n* A Wizard with a decoy spell (for example [[Essential Phantom]]) can cast it as a distraction, dispersing the Lurkers into the jungle. This is probably the best choice, as you won't have to fight the lurkers at all, it will also end the scripted interaction and place you out of combat so you can better position yourself.\n* Either way, you'll come to a [[Jungle]], where there are a number of [[Dank Spore (Deadfire)|Dank Spore]]s, [[Sporeling (Deadfire)|Sporeling]]s and (if you didn't cast a decoy spell) [[Jungle lurker|Jungle Lurker]]s.\n* Once the enemies are dead, you can pick up the pet [[Trixie]], and loot the corpse for the unique war bow [[Frostseeker]].\n\n== Gallery ==\n<gallery mode=nolines>\n RE si jungle.png\n</gallery>",
  "slug": "maukotusCanopy",
  "title": "Maukotu's Canopy"
}
