{
  "markdown": "'''{{Pagename nd}}''' is a [book](/book/) in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = Monsters of the Deadfire Archipelago\n| icon           = Book tome dirty icon.png\n| description    = The Archipelago winds its way between The Great Eastern Ocean and The Restless Ocean - hundreds of small islands in the midst of the water. Few dare brave its treacherous rapids, and fewer still have returned to tell tale of their adventures through it.\n \nTravel between the two oceans is virtually impossible. Great storms hammer any ships foolhardy enough to attempt to navigate, and this alone should be enough to deter anyone from attempting the voyage as untold ships have gone down, tossed against the rocks.\n\nThe weather and treacherous rocks are only a precursor to the actual horror of the archipelago, the terrors of the deep. No one knows how many creatures stalk the oceans, waiting for unsuspecting sailors to drift into their waters. But we do know of some.\n\n\nBarbed Ravager\n\nA giant shark that is known to ram passing vessels, trying to knock sailors off the deck and smash a hole in the hull. It has tremendous spines protruding from its side and back that are presumed to be poisonous. The largest sighted Barbed Ravager (with survivors) was estimated to be almost 30 feet long.\n\n\nWinding Serpent\n\nSmaller around than the Ravager, but potentially longer, the Winding Serpent attacks in small packs, usually 3-8. They have long, sharp heads, somewhat reminiscent of a barracuda. \n\nLike the Ravager, they repeatedly slam into the side of a ship hoping to crack a hole in it or knock someone from the deck. They have also been known to swim to the depths and shoot up out of the ocean, landing on the deck, coiling and winding their way around, snapping up any crew they can before plunging back into the ocean.\n\n\nLeviathan\n\nImagine the largest whale you have ever seen. The leviathan is at least ten times that size. By the time a ship sees a leviathan, it is already too late. As they rise from the depths, the water around them begins to spin and sink, creating a whirlpool. \n\nThe leviathan's body surrounds the hapless vessel, preventing escape, and as it goes down, the enormous mouth opens, pulling all aboard to their watery deaths.\n\n\nPolpovir\n\nAll the creatures you've read about in this book are nothing compared to the Polpovir. Barely the size of a man, what they lack in size and strength, they make up for in numbers and terrifying viciousness. \n\nTheir lower halves are a mass of tentacles like an octopus or squid, but more numerous. The tentacles are long, black whips with suction cups on the underside and small thorny barbs on the top. The sheer number of tentacles gives them frightening speed when walking on land, pulling themselves forward almost as fast as a running horse. \n\nWhile they vaguely resemble a human from the waist up, any extended examination proves how wrong that assumption is. Long, stringy black hair falls from the top of their heads to cover a face taken directly from a nightmare. A wide, gaping mouth, cuts across the bottom of its head from ear to ear, full of wicked dagger-like teeth. Two large round eyes are sunken into its head, black as coal, shining with a malevolent fire. A small antenna protrudes from the middle of its forehead, ending in a small nodule that can glow with an eerie blue light.\n\nOne can imagine a sailor on the deck of his ship at night, looking out across the black water, blood freezing as countless lights appear beneath the surface, rising toward him as the Polpovir swarm upward. \n\nBecause they seem to be more octopus than man, they can collapse in on themselves, fitting into spaces no person should be able to. The smallest crack in a hull, the slightest separation between boards offers them entrance. It is not unknown for them to slaughter an entire crew from hold up to deck by infiltrating the ship from underneath. \n\nFortunately they do not seem to have spread too far outside of the archipelago, but there may come a day when Polpovir attacks become commonplace.\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Book\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = no\n| value          = 80\n| shop_value     = 400\n| range          = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Monsters_Deadfire_Archipelago\n| location       = * [[Sayuka]], [[Workshop (Sayuka|Workshop]]: On a bookshelf at the back of the room.\n| guid           = 76ba6b3f-48d5-472f-9411-9a4ec21c6231\n}}\n'''{{Pagename nd}}''' is a [[book]] in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "monstersOfTheDeadfireArchipelagoDeadfire",
  "title": "Monsters of the Deadfire Archipelago (Deadfire)"
}
