{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Journal }} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = Nothing is Lost: The Search for Ukaizo\n| icon           = Poe2 LAX01 research survivor icon.png\n| description    = Excerpted from ''Nothing is Lost'', the collected journals of Wanamora Wave-Chaser.\n\n\"The ranga's men came to collect my portion of prize-share this morning, and I had nothing to give them again. I make no money for the tribe, though I am always in my little ferryboat, ''Grey Gull'', carving through the waves. At night, I get no sleep. Whaitaro asks me to conserve the lamp oil, to come to bed, but I can't, not until I find it.\n\nI know it's out there. The lost city of Ukaizo. On every chart and map of the Deadfire I've found, whether Huana, Vailian, or Ruautaian, there is a gap. An empty space where so much of our history should be.\n\nDid it burn to ash and cinders in the cataclysm? Did it sink below the waves? Does Ngati clutch it to her breast at the bottom of the sea?\n\nPerhaps it's lost and wandering, like me. Unmoored. Looking for a home it can't remember, but for which some insistent longing burns in its chest, an ember always smoldering, a little fire to push it on.\n\nWhaitaro wants me to give it up. But how can I? On mornings when the sky is so clear I can hardly catch my breath for the beauty of it, I think I see it out there, shimmering in the brightening blue light. Is it a taunt or a beckoning? Would I be able to tell the difference?\n\nI ask the fisherfolk when they return with their catch at sunset. 'Tibere,' I say, 'did you see anything? Or you, Mabori? How about you, Puira?' They avoid me now. Whaitaro says they're busy, but I know they think I'm tide-sick and sun-addled. The way Puira's lip curls in disgust when I approach, the way Tibere's eyes seem to see right through me. I know.\n\nThey won't have to suffer me much longer, because tomorrow I'm taking ''Grey Gull'' and sailing north.\n\nSomeone has to chase the old tales.\n\nSo I will.\"\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Journal\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 80\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Wanamora_Wave_Chaser\n| location       = \n| guid           =b3873178-b16b-4e98-af93-35c345feea9e\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Journal }} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "nothingIsLostTheSearchForUkaizo",
  "title": "Nothing is Lost: The Search for Ukaizo"
}
