{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = On the Efficacy of Imps\n| icon           = poe2 book_box_black icon.png\n| description    = A timeworn adage among practitioners of the arcane arts avers that early wizards compelled imps to service not out of a desire for the assistance, but to banish them from underfoot. I doubt it not at all, for one could not conjure more unruly, noisome, maladroit, or irascible aid. Why then, do we employ these diminutive meddlers?\n\nImps, dear reader, are to a wizard's sanctum as rats are to a ship. Whether out of malign instinct or pure mischievousness, they infiltrate our laboratories with alarming regularity. Ninagauth conjectures in his Sensitivity of Simpletons that imps infest any locus of concentrated mystical influence, and accounts of the creatures lurking among the uninhabited ruins of Engwith seem to corroborate his supposition. Yet a wizard's domicile seems to possess a particular appeal to them, regardless of whether it resides at a nexus of spiritual power or no.\n\nLeft to their own devices, the winged miscreants accrue loose baubles, hording them in filthy dens as often as not established in our cupboards and privies. Seemingly possessed of an antiquity dealer's discernment, each prefers to pilfer the most valuable paraphernalia and potent artifacts, yet they remain pathetically inept in the use of even the simplest gewgaw.\n\nI admit the imp's general incompetence makes them appealing retainers. One of the little cretins may displace a favored wand of elemental power, but little peril exists of it activating the instrument and immolating your collected volumes of arcana.\n\nThe same cannot be said of apprentices.\n\nYet the beasts present a danger to the unwary, for they possess a low cunning not unlike that of xaurips and orlans. Without a domineering hand to direct them, imps rapidly regress to their base instincts. As a result of their propensity for pack behavior, even transitory leniency with a single imp can imperil a wizard's entire collection.\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Book\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 80\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Imps\n| location       = * [[Arkemyr's Manor]]: Bedroom, in the bookcase on the wall.\n| guid           =afaae200-c2ea-45c8-9a0b-51eca035818b\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "onTheEfficacyOfImps",
  "title": "On the Efficacy of Imps"
}
