{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Document}} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = On the Provenance and Ruination of Neketaka's 'Old City'\n| icon           = poe2 expedition_report_p1 icon.png\n| description    = Excerpt from a lecture given before the annual convention of the academy of architectural historians in Aedyr.\n\n\"Close examination by learned parties suggests that Neketaka is significantly older than it might at first appear.\n\nWe take as our example the suppurating wound in the city's side, which the locals most charmingly refer to as 'the Gullet.' On its face, it is not considerably different from your average slum. Indeed, it contains all that one might expect of such a place - desperate poverty, wrenching hunger, a tavern fair brimming with miscreants, and a flourishing criminal culture. Of course, it has its own unique offering, as well - a towering pile of garbage dumped into the district from the more affluent neighborhoods above it. It is, in every sense, abominable. The Huana leadership should be ashamed.\n\nBut I digress. Far more interesting than the caste stratifications among the Huana are the bones their city is built upon - for beneath 'the Gullet' lies a vast cavern littered with the remains of an ancient city. Referred to simply as the 'Old City' by the denizens of Neketaka, this sunken metropolis is notable for two reasons - the Old City's architecture is markedly different in style, form, and apparent use from the architecture of modern Neketaka, and there is no readily available explanation for the Old City's destruction that has not already been considered and discounted by those inclined to study it.\n\nMy peers here in the academy and beyond believe that the Old City's destruction is clearly the fault of the region's energetic vulcanism and subsequent tectonic rumblings. I would caution against grasping at such easy solutions, however.\n\nConsider the following -\n\nThe Huana have lived in the region for thousands of years. Earthquakes are no more a surprise to them than are the archipelago's daily soaking rains. None in Eora match their sheer creativity and expertise in building to withstand these events.\n\nMoreover, for all their flexibility in building construction, the Huana's tastes have proven to be remarkably stable over time, showing a clear preference for designs that mimic the rhythm and shapes of the natural world. The Old City shows none of these things. Indeed, what remains was constructed primarily of stone cut in austere blocks, and the buildings are arranged in a manner not dissimilar from those prevalent in the Engwithan ruins that dot the landscape.\n\nWith those two points in mind, does it not seem prudent to ask whether the Old City is Huana in origin and, if it is not, who built it, and, finally, what destroyed it?\"\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Document\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = \n| is_unique      = \n| value          = 16\n| shop_value     = 80\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Old_City_Lecture\n| location       = * [[Tikawara]]: [[Kuaru hut]], in a hidden drawer on the left.\n| guid           =03e6163b-1b01-48ca-a02c-186801b807f9\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Document}} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "onTheProvenanceAndRuinationOfNeketakasOldCity",
  "title": "On the Provenance and Ruination of Neketaka's 'Old City'"
}
