{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = On the Fire-Forged Path: The Travels of Gjaryc Yltan\n| icon           = poe2 book_dec_brown icon.png\n| description    = Excerpt from ''On the Fire-Forged Path: the Travels of Gjaryc Yltan''.\n\n\"Though I was born and raised a Magranite - and a Magranite, now, I will stay - as a young man I undertook a pilgrimage to visit a holy house dedicated to every god. In so doing, I hoped to know them each the better, to take what they had to teach and sow it into my soul like so many seeds, that my soul might grow and bear only the most delectable fruit for my goddess to devour at the moment of my death. So it is with no small amount of amusement that I pen this account of my visit once to a church of Wael, the many-eyed, many-tongued god of dreams and secrets, revelations and mysteries, and reveal to you all I learned there.\n\nThe challenge came first in finding adherents to Wael's doctrine, for they are not often ones to announce their presence, preferring instead to build their flock from the solitary seekers who delve through ancient ruins and ruined archives in search of the strange, the bizarre, the forgotten. But persistence is my goddess' first teaching, and find them I did.\n\nThe Waelites' Neketakan congregation was small then, as it likely remains now, and on the morning I stumbled upon them, they were lounging like so many cats in the sun on the steps above Queen's Berth, sharing between them a bottle of arrack and pipes packed with whiteleaf and ripple sponge. I knew them for Waelites not for any badge or robe or trinket they wore, not for their race or age, but for the ardor of their debate on the most benign of topics.\n\nI begged that they take me to their church and permit me to worship with them, and they laughed as one, their many voices like the howling of wild dogs. They acquiesced when I told them of my quest, and then invited me to sit and share their drink. I did, and as the arrack burned a trail of fire down my throat, they showed me the dimensions of their hall of worship. The stairs were their pews, they said, the blue sky their ceiling, and their walls the edges of the world. All of creation sits within its bounds.\n\nAs morning neared midday, they stood as one and began to climb the mountain. 'Where do you go now?' I asked. 'To worship!' They replied. A great wave of relief washed over me, for at last I would have my lesson from them. We climbed the many steps of Neketaka and arrived at last in the Sacred Stair. 'Where is your temple?' I asked, and in response they whooped like children, rushing past me in a squall of smoke and laughter. I followed as best I could, though I wet my good slippers in a stream and could hardly keep my feet on the moss-slick stones, and we surged soggy-footed and hollering into the Temple of Gaun.\n\n'To worship! To worship!' They cried. We shoved past Dawnstars bent in praise of their macabre god, laughing all the while, and came to stand before a leafless tree whose boughs were hung in lanterns too numerous too count. I had nary a moment to catch my breath before the Waelites were clambering into the great tree's branches. A young man pulled me up with one hand and handed me a pipe with the other. The priests of Gaun screeched and wailed, and all the while we squawked like birds, our smiles wide and eyes alight with arrack and lantern fire. The Mataru came soon after to chase us away, but not before we'd done our share of singing to the many-eyed, many-tongued god of dreams.\n\nWould that I could have stayed with them a while longer, but alas, I could not deny my soul its journey nor the whispers of my goddess in my ear. I took again to the road in search of churches, but I must admit, I longed always after for that tree.\"\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Book\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 80\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Magranite_Pilgrimage\n| location       = \n| guid           =a2000aa2-3275-42db-813a-e9a6f40ff72d\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "onTheFireForgedPathTheTravelsOfGjarycYltan",
  "title": "On the Fire-Forged Path: The Travels of Gjaryc Yltan"
}
