{
  "raw": "{{Infobox location poe2\n| game          = bow\n| map           = BOW Outcrop on High.png\n| caption_map   = \n| name          = Outcrop on High\n| type          = Wilderness\n| description   = \n| exits         = Harbinger's Watch;The Rimebound Temple\n| main_location = The Dead Floe\n| sub_locations = \n| merchant      = \n| expected_level= 14\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = ZN_LAX02_01_Iceberg_Dungeon\n| internalname  = AR_LAX02_0102_Iceberg_02\n| guid          = 0b404000-d119-4a60-8924-408f123cbc39\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{bow}}.\n\n==Background==\nThis stretch of desolate glacial ice overlooks the desolate Windless Waste and the ocean surrounding it. It's also home to a rather nasty branch of Rymrgand's cult.\n\n==Points of interest==\n* This area is large, but sparsely populated. The mesa in the center is occupied by the extremists under the lead of [[Champion-Ascendant Grymgaer]].\n* The mesa to the south-west is where the aforementioned extremists murdered anyone they caught, leaving them to freeze to death in the open air. You can interact with the lingering soul to get a glimpse of [[The Beast of Winter]].\n* The north-western corner contains an altar to the Beast. The trapped chest contains [[Footsteps of the Beast]].\n* Finally, in the north-eastern corner is the rope leading further into the glacier. As you descend it, you can find an object lodged in the wall with Perception 14. You can recover it by using a strong character, a fire ability, or an [[immolator]] (Explosives 10 required). Failure will send you plummeting down and netting three injuries total. At least you get [[Glacierbane]] for your trouble.\n\n==Characters==\n* [[Champion-Ascendant Grymgaer]]\n\n==Loot==\n* [[Horns of the Aurochs]]: Dropped by [[Champion-Ascendant Grymgaer]].\n* [[Footsteps of the Beast]]: In the trapped chest near the altar.\n* [[Glacierbane]]: Lodged in the wall, found during the descent to the temple.",
  "slug": "outcropOnHigh",
  "title": "Outcrop on High"
}
