{
  "markdown": "{{quote|Ah, the luxury of choosing what tangled idiocies you can be involved with. It must be nice.}}\n'''Pallegina mes Rèi''' (pronunciation: pah-lleh-DJEE-nah)<ref>[http://forums.somethingawful.com/showthread.php?threadid=3593502&pagenumber=52&perpage=40#post424464608 Forum post by Josh Sawyer]</ref> is a female [avian godlike](/avianGodlike/) [paladin](/paladin/) and one of the recruitable [companion](/companion/)s in {{poe1}}.\n\nShe can be recruited after completing the quest [At All Costs](/atAllCosts/), in [Ondra's Gift](/ondrasGift/).\n\n## Background\n\nPallegina mes Rèi is a 26 years old, thin, athletic woman with dark brown skin, brown-black hair, and a mix of avian features: Golden bird eyes and feathers growing out of her hair and limbs, a sign of godlike heritage linked to [Hylea](/hylea/), the Sky-Mother. She was born to human parents in a small ﬁshing village near Biageppe. During childbirth, her unusual body caused her mother enormous pain and internal bleeding, nearly killing her. Upon seeing the baby’s body, the midwife realized that Pallegina must be a godlike, touched by one of the deities and “blessed” with unusual features. Though she was given the name of her great-grandmother on her mother's side, she was named mes Rèi like all godlike among the Vailians.<ref name=\"PoESG\"/>\n\nDespite her status, her first six years of life were defined by hardship: Injuries sustained in childbirth prevented her mother from bearing more children, leading her father to hate her for seemingly ending his line. Although he did not throttle Pallegina at birth (a common choice among godlike parents, one few are blamed for), the resentment defined her early years. For what it was worth, her mother never blamed her for anything, but she was only a woman in the Republics. Everything changed for the young godlike when [Frermàs mes Canc Suolias](/frermasMesCancSuolias/) (Brotherhood of the Five Suns) were dispatched by the duc of Ozia to eliminate pirates plaguing her home town, Pallegina saw how people celebrated and thanked them for their service. More importantly, she saw how they were free to leave the village, leaving its dreary existence behind. Her father saw an opportunity to both get rid of his damned child and still come ahead.<ref name=\"Pallegina\">Pallegina</ref>\n\nHe traded her for back taxes owed to the duc. The recruiter accepted the godlike as a prestigious recruit. Although the Frermàs were an all-male order, Republic's laws considered all godlike to be genderless (due to their inability to sire or bear children), and so the young Pallegina was accepted. Although it raised a few eyebrows and caused no small amount of resentment among the more conservative members of the order, she quickly learned not to care and focus on her duties. The sexism and prejudice she experienced at the academy took their toll however, particularly when she started going through puberty and the godlike features manifested in full at twelve. Her only friend at the time was [Giacolo](/giacolo/), who discovered the characteristic chime of the godlike within her and even attempted to remove it when Pallegina threatened to commit suicide if she didn't. He tried the treatment, severing the connection and knocking Pallegina out for two weeks. Although the brothers expected her to die, Pallegina didn't - and through his work lost most of her feathers and started resembling ocean folk much more closely than before. She credits Giacolo with saving her life and lifting her out of intense depression. Bolstered by her newfound confidence, she passed  her final examinations at 20.<ref name=\"Pallegina\"/><ref>[http://forums.obsidian.net/topic/65115-update-72-death-godlike-and-expected-ship-date/?view=findpost&p=1417342 Forum post by Josh Sawyer]</ref><ref>[http://forums.somethingawful.com/showthread.php?threadid=3593502&pagenumber=52&perpage=40#post424464545 Forum post by Josh Sawyer]</ref>\n\n## =Service\n\n=\nAlthough rebellious, Pallegina managed to toe the line between insubordination and initiative for six long years, long enough to establish herself as a trusted operative of the ducs. Although the songretta would prefer she be just another tool in their hands, Pallegina's unique perspective and patriotism led her to believe that there are better ways to protect the Vailian Republics than pure economic domination and naval might.<ref>http://www.pcgamer.com/2014/04/18/pillars-of-eternity-interview-josh-sawyer-on-world-building-magic-psychic-warriors-and-more/</ref> When she was instructed to accompany ambassadors and merchants to [Defiance Bay](/defianceBay/), protecting them while they ensure the ports remain open for the Republics to evacuate their holdings from the city in anticipation of a popular revolt caused by [Waidwen's Legacy](/waidwensLegacy/), her doubts turned to certainty. She realized that ducal thinking in ordinary ﬁnancial terms was a tunnel-vision, focusing on the traditional resources of maritime trade and ignoring the revolutionary potential of [animancy](/animancy/) pioneered in the Dyrwood and the Republics. The ducs' short-sighted policy  would protect many of their investments, but ensure the Republics would be weakened by the loss of  inestimable wealth in animancy research and technology.<ref name=\"PoESG\"/>\n\nActing against her orders, Pallegina decided to investigate the underlying causes of revolutionary talk, shadowing ﬁgures at the ducal palace and interrogating information brokers. When she discovered that animancy itself may be a key element of the political upset, she tried placing herself closer to the attendants and courtiers of the erls and (Dyrwoodan) duc. Due to her political allegiances and striking appearance, she quickly failed at this endeavor and received an official rebuke from the Brotherhood. Rather than test their patience, Pallegina decided to lay low, executing her standing orders as a glorified bodyguard, while looking for an opportunity to restart her investigation.<ref name=\"PoESG\"/> Unfortunately for her, this meant being stuck in a holding pattern, watching over Mestre [Verzano](/verzano/) of the [Vailian Trading Company](/vailianTradingCompany/) and playing witness to his inexorable descent into abject failure and quite likely death. Something that cannot come too soon to liberate her from the burden<ref>[At All Costs](/atAllCosts/)</ref>\n\n## ={{poe1}}\n\n=\nIn encountering [the Watcher](/theWatcher/), Pallegina recognized a potential ally in her investigation. After [Verzano](/verzano/) was out of the picture, freeing her from his net of stupidity, she urged the Watcher to assist her in ﬁnding the parties who are conspiring to outlaw [animancy](/animancy/) in the [Dyrwood](/freePalatinateOfDyrwood/) – and possibly the [Vailian Republics](/vailianRepublics/). Unfortunately, her superiors did not agree, and instead ordered her to broker a trade deal between the Vailian Republics and [Eir Glanfath](/eirGlanfath/), aiming to take over Dyrwood's trade with the [Glanfathans](/glanfathans/). She had serious misgivings about her ducs' plans, keenly aware that whatever short-term profit might be gained from taking over trade with Eir Glanfath would be outweighed by the long-term losses resulting from alienating the Dyrwood. The Republics would eventually pay the price for such ruthlessness, as while the Dyrwood may have lost a generation of soldiers due to [Waidwen's Legacy](/waidwensLegacy/), it would eventually regain its power… With all that entails. But the road to [Twin Elms](/twinElms/) was long enough to allow her to mull over the choice she has to make.<ref name=\"PoESG\">''Pillars of Eternity Strategy Guide''</ref> \n\nMost importantly, her mission to Eir Glanfath is also a test of Pallegina's loyalty. Her independence was a long-standing problem by the ducs. News of her unsanctioned investigation reached the ears of the ducesa of [Biageppe](/biageppe/) and the duc of [Selona](/selona/). Pallegina's actions complicated the already volatile situation, raising concerns about her ability to fulfill her duties. Her immediate superior, ambassador [Vicent Agosti](/vicentAgosti/), shared their sentiment: Although he had sympathy for her viewpoint, he was utterly loyal to the ducs and feared what might happen if news of their insubordination reached [Spirento](/spirento/).<ref>Interactions with the ambassador and Pallegina after completing [At All Costs](/atAllCosts/).</ref>\n\n## =5 Year Interlude\n\n=\nPallegina's decision on how she delivered the trade agreement and the Watcher's choices affected Pallegina in one of five ways:\n\n<!-- n_Pallegina_Decision \n\n##  1 AND n_Ending \n\n 4 -->\n1. If Pallegina followed the ducs' orders, and the Watcher distributed the souls to the Dyrwood at the end of the events of {{poe1}}, she is honored by the ducs:\n\n{{Description|Pallegina had followed her orders from the ducs bels, helping to establish an exclusive trade arrangement between the Vailian Republics and the tribes of Eir Glanfath. Strenghened by the Watcher's gift of souls, the furious Dyrwoodans waged war against the Republics for two long years. The Republics gained a great deal of wealth in trade but suffered the loss of many vessels and thousands of lives. Several of the ducal families lost favor with their citizens. Riots in Selona claimed the life of that city's duc, and the other ducs bels were pressured into relinquishing the exclusive trade rights to end the conflict with the Dyrwood. Pallegina was honored for her service at the opening of trade. Thankfully her reputation among the ducs and within the Brotherhood was not tarnished by what followed.}}\n\n<!-- n_Pallegina_Decision == 1 AND n_Ending != 4 -->\n2. If Pallegina followed the ducs' orders, and the Watcher didn't distribute the souls to the weakened Dyrwood, she is honored and becomes personal guard to the ducess of Spireno:\n\n{{Description|Pallegina had followed her orders from the ducs bels, helping to establish an exclusive trade arrangement between the Vailian Republics and the tribes of Eir Glanfath. With the Dyrwoodans still weakened by Waidwen's Legacy, the Vailian Republics easily pushed their would-be competitors out of the market. The Dyrwood suffered as terribly from the lost trade as the Republics benefited from it. Pallegina was honored for her service by being assigned as the personal guard of the ducess Spireno. Despite her success, she regretted the choices she had made along the way.}}\n\n<!-- n_Pallegina_Decision == 0 -->\n3. If Pallegina was disgraced after her quest line wasn't resolved, she is banished from the Republics and becomes a guard:\n\n{{Description|Pallegina had gone against the ducs bels' orders by inventing a new trade arrangement with the anamenfath to accommodate the recovering Dyrwoodan market. As a result, the Dyrwood and the Vailian Republics were plunged into a trade war.\n\nFor her outrageous insubordination and audacity, Pallegina was banished from the Republics. The five suns representing the five ducs bels were scraped from the face of her breastplate, an enduring mark of her disgrace.}}\n\n:After the Watcher parted ways, she returned to the Republics to report to the ducs bels'. Having failed to complete her mission, the ducs were furious that they had lost a golden opportunity to establish exclusive trade with the Glanfathans. She was exiled from the brotherhood, and was put on a ship to [Readceras](/readceras/), forever banned from the Republic and stripped of her pride and purpose.\n\n:Pallegina will not be satisfied with what happened to her, not by a long shot. She spent five years trying to make a living as a guard, drifting from port to port until winding up in the Deadfire. \n\n<!-- n_Pallegina_Decision \n\n##  2 AND n_Ending \n\n 4 -->\n4. If Pallegina was disgraced after ignoring the ducs orders, but the Watcher distributed the souls to the Dyrwood, she is later pardoned:\n\n{{Description|Pallegina had gone against the ducs bels' orders by inventing a new trade arrangement with the anamenfath to accommodate the recovering Dyrwoodan market. As a result, the Dyrwood and the Vailian Republics were plunged into a trade war.\n\nFor her outrageous insubordination and audacity, Pallegina was banished from the Republics. The five suns representing the five ducs bels were scraped from the face of her breastplate, an enduring mark of her disgrace.}}\n\n:Pallegina's invention of new trade terms with Eir Glanfath did not go down well with the ducs. When she returned, she explained that allowing the Dyrwood to retain some trading rights with the Eir Glanfath would be beneficial for everyone in the years to come, however the damage had been done. Banished from the order, her breastplate was scoured of the five stars and she was put on a ship to [Readceras](/readceras/), forever banned from the Republics.\n\n:For almost three years, she wandered the ports looking for new work as a guard, until the Ducess of Spirento sent for her and requested her presence in Biageppe. Pallegina's wisdom was recognized after the ducs tabulated the profits from the three way trade that emerged between the Dyrwood, Eir Glanfath, and the Republics, and she was reinstated in the order with full rights accepting an official pardon from the Ducess of Biageppe.\n\n:Pallegina was later assigned to protect the VTC interests in the Deadfire, in recognition of her talents in the Dyrwood.\n\n<!-- (n_Pallegina_Decision == 2 AND n_Ending != 4) -->\n5. If Pallegina disobeys her orders, and the Dyrwood isn't strengthened by the souls, she is banished and joins the [Kind Wayfarers](/kindWayfarers/).\n\n## ={{poe2}}\n\n=\n\nThe Watcher meets Pallegina after arriving in [Neketaka](/neketaka/) at [Kahanga Palace](/kahangaPalace/) if she was not disgraced (or was disgraced and later pardoned), or in [Queen's Berth](/queensBerth/) if she was disgraced. \n\nIf Pallegina was disgraced she has a few choice words if you're not sympathetic to her status. She will launch into an epic rant:\n\n{{Description| She blinks once, her golden eyes opening wide, fixated on you. Her nostrils flare and the veins in her neck strain against her skin.\n\n\"Vu maddicche postenago! Buffan vi! Cues es malgro me fulpa med tuor! Peri chue na cracuna ve engeri! Vu tros men merla!\" [You damned idiot! Fuck yourself! This is all your fault anyway! I hope a kraken swallows you! You piece of shit!]\n\nPallegina continues to issue forth a stream of unintelligible insults. Her hands are flowing through a series of obscene gestures as she backs away from you.\n\nVailians around Queen's Berth turn their attention toward the fountain of profanity. Some are amused. A mother shields her smiling son's eyes from the vulgar pantomime. As Pallegina angrily stomps off into the distance, the pace of life returns to normal.}}\n\nIf she joins your party she will ask you to help her find the animancer [Giacolo](/giacolo/), who had severed her godlike chime as a teenager.\n\n## Interactions\n\n## ={{poe1}}\n\n=\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =[The Child of Five Suns](/theChildOfFiveSuns/)\n|quests_involved =[At All Costs](/atAllCosts/)\n|none            = \n|other           = She has unique dialog with [Hylea](/hylea/) in [Council of Stars](/councilOfStars/) when finishing [The Nest Above the Clouds](/theNestAboveTheClouds/).\n}}\n\n## \n\nCompanion\n\n## \n\n* She can be recruited in [Ondra's Gift](/ondrasGift/) after [At All Costs](/atAllCosts/).\n* Pallegina is a Republic patriot with an almost single-minded devotion to the Republics and their prosperity. She possesses a wealth of information about them and will frequently provide it when a Vailian institution or person is involved.\n* She gets on well with other companions due to her compassion. [Durance](/durance/) is perhaps the sole exception, due to his misogyny, and is frequently at the receiving end of Pallegina's sarcasm. \n* Despite being an avian godlike, she can't stand birds.<ref>Praying to Hylea during [Council of Stars](/councilOfStars/) will prompt this comment.</ref>\n\n## \n\nUnique talents and gear\n\n## \n\n* As the only [avian godlike](/avianGodlike/) in the game, she receives the following passive racial talent:\n** '''[Elusive Quarry](/elusiveQuarry/)''': +10 Deflection against ranged attacks, +10 Defense when Disengaging while Endurance below 50%, and +3 Perception while Endurance below 50%.\n*From her paladin order [Frermàs mes Canc Suolias](/frermasMesCancSuolias/) (which is unique to her) she gets the following class talents:\n** '''[Vielo Vidòrio](/vieloVidorio/)''': Gives nearby allies an attack speed bonus when Flames of Devotion is used.\n** '''[Wrath of Five Suns](/wrathOfFiveSuns/)''': Shoots out five Burn damage projectiles when Sworn Enemy is used.<ref>https://forums.obsidian.net/topic/82857-300-patch-teased-by-josh-on-sa/?p=1767163</ref>\n* She uses [Pallegina's breastplate](/palleginasBreastplate/), which is a [unique item](/uniqueItem/).<ref>[http://forums.obsidian.net/topic/60547-gratification-in-acquiring-epiclegendary-items/?view=findpost&p=1459777 forum post by J.E. Sawyer]</ref>\n\n## \n\nCompanion quest\n\n## \n\n* [The Child of Five Suns](/theChildOfFiveSuns/) is received after recruiting Pallegina, after completing [At All Costs](/atAllCosts/).\n* Pallegina is caught between honoring the wishes of the ducs bels and pursuing the leads she believes will be more beneﬁcial to her country in the long run, which involve learning about animancy.\n* The quest cannot be resolved until Act 3, when Twin Elms becomes available.\n\n## \n\nEndings\n\n## \n\nPallegina's ending depend on two events:\n# How you influence her decision during [The Child of Five Suns](/theChildOfFiveSuns/).\n# If you strengthen the Dyrwood inhabitants with the souls [Thaos](/thaosIxArkannon/) diverted at [Sun in Shadow](/sunInShadow/). The strengthened nation is more likely to fight back if the trade deal is not in their favor.\n\n## ={{poe2}}\n\n=\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =[The Man of Chimes](/theManOfChimes/)\n|quests_involved =[Family Pride](/familyPride/)<br/>[A Vote of No Confidence](/aVoteOfNoConfidence/)\n|none            = \n|other           =\n}}\n\n## \n\nCompanion\n\n## \n\n* Pallegina's location, backstory, and reaction to you is dependent on the outcome of [The Child of Five Suns](/theChildOfFiveSuns/) in {{Poe1}}.\n** If Pallegina followed her orders, or if she was disgraced and later pardoned (she is pardoned if Watcher distributed the souls to the Dyrwood at the end of the first game), she will be found at [Kahanga Palace](/kahangaPalace/) assisting Count Nichese in the argument with the RDC. She can be recruited immediately afterwards, as Queen Onekaza II sends the Watcher to investigate Hasongo.\n** If Pallegina was disgraced for not following her orders and was not pardoned, she will be encountered in [Queen's Berth](/queensBerth/), near the statue in the center of the area, where she initially denies your offer to join your party. Later, she can be found in the [Vailian Trading Company Headquarters](/vailianTradingCompanyHeadquarters/) after the argument with the RDC at [Kahanga Palace](/kahangaPalace/). With the interests of the Republics in mind, Count Nichese calls on Pallegina to assist you with your investigation.\n* Pallegina will leave permanently if the player sides with the [Huana](/huana/) during [The Coming Storm](/theComingStorm/) and Pallegina is in the player's active group (the queen asks her to leave) or if the player frames the director on the fire at the [powderhouse](/powderhouse/) (by taking the quest from the director but frame him/her in the hearing at the palace).\n*Pallegina also leaves if the player sides with the [Royal Deadfire Company](/royalDeadfireCompany/) during The Coming Storm.\n* Pellagina can also leave if you side with the Principi. She will also leave (automatically the next time you sail) if you refuse to side with the VTC after [A Vote of No Confidence](/aVoteOfNoConfidence/).\n* Pallegina will also leave your company if you kill either [Atello Valera](/atelloValera/) or [Ezzali Bardatto](/ezzaliBardatto/) during [Family Pride](/familyPride/) with her in your party.\n\n## \n\nClass\n\n## \n\n* The class options available to Pallegina are [paladin](/paladin/) ([Frermàs mes Canc Suolias](/paladinFrermC3A0SMesCancSuolias/)), [Crusader](/crusader/) (paladin + [fighter](/fighter/)), or [Herald](/herald/) (paladin + [chanter](/chanter/)).\n**[Frermàs mes Canc Suolias](/paladinFrermC3A0SMesCancSuolias/) is Pallegina's unique paladin subclass, which grants the upgraded Sworn Enemy ability [Wrath of the Five Suns](/wrathOfTheFiveSuns/).\n\n## \n\nUnique talents and gear\n\n## \n\nThe breastplate she wears depends on her {{Poe1}} ending.\n\n*If Pallegina followed her orders, and you didn't distribute the souls to the Dyrwood: [Honor Guard Breastplate (Pallegina)](/honorGuardBreastplatePallegina/)\n*If Pallegina followed her orders, and you distributed the souls to the Dyrwood: [Five Suns Breastplate](/fiveSunsBreastplate/)\n*If Pallegina disobeyed her orders, and you distributed the souls to the Dyrwood: [Five Suns Breastplate](/fiveSunsBreastplate/)\n*If Pallegina disobeyed her orders, and you didn't distribute the souls to the Dyrwood: [Desgraza Breastplate](/desgrazaBreastplate/)\n\n## \n\nCompanion quest\n\n## \n\n* [The Man of Chimes](/theManOfChimes/) is triggered when taking Pallegina near the Spire of Soul Seers in [The Sacred Stair](/theSacredStair/). She will insist on meeting [Giacolo](/giacolo/), an old friend from the past.\n* She will mention his research, giving you the opportunity to point out that he was likely building on the work of Todh Beylecg (Metaphysics 5 and History 2) and learn of the suffering she experienced as a godlike - and the way Giacolo saved her from suicide.\n* You can either save Giacolo or not, either result affects her end-game slides.\n\n## \n\nReputation\n\n## \n\n* Pallegina likes:\n** {{Topic|Antireligious}} '''Antireligious:''' Dislikes and distrusts the gods and organized religions and appreciates criticism of them.\n** {{Topic|Pro-Animancy}} '''Pro-Animancy:''' Views animancy as vital for the progress of the world and responds well to those who support its research and practice. \n** {{Topic|Dutiful}} '''Dutiful:''' Admires people who take responsibility and don't shirk the tasks presented to them.\n** {{Topic|Pro-Vailian Republics}} '''Pro-Vailian Republics:''' Believes in and supports the Vailian Republics and takes a positive view of those who do likewise.\n*Pallegina dislikes:\n** {{Topic|Pro-Godlike}} '''Pro-Godlike:''' Dislikes reverence for or admiration of godlike.\n** {{Topic|Piety}} '''Piety:''' Dislikes religious reverence and piety and has negative views towards those who express such characteristics.\n** {{Topic|Racism}} '''Racism:''' Takes a dim view of racist comments and attitudes.\n\n## \n\nRelationships\n\n## \n\n* Pallegina and [Maia Rua](/maiaRua/) will often be at odds over their differing political affiliations.\n* She will have little patience with [Tekēhu](/tekehu/), who embraces his godlike heritage.\n* She has a poor view of [Xoti](/xoti/), given Xoti's adherence to her god and faith, things which Pallegina considers naive and foolish.\n* She cannot be romanced by the Watcher.\n\n## \n\nEndings\n\n## \n\nPallegina's ending depend on three events:\n\n# Which faction you ultimately side with. Siding with the [Vailian Trading Company](/vailianTradingCompany/) is her preference.\n# Which director is leading at the end of [A Vote of No Confidence](/aVoteOfNoConfidence/).\n#Saving Giacolo (or not) during [The Man of Chimes](/theManOfChimes/).\n\n## Behind the scenes\n\n* Pallegina was written by [Joshua Sawyer](/joshSawyer/).<ref>http://forums.obsidian.net/topic/74557-companions-who-wrote-what/#entry1622138</ref>\n* She is voiced by actress [Mela Lee](/melaLee/)\n* She is not affected by the Reputations or Dispositions of the player in {{poe1}}.\n* Before PoE 1.03, Pallegina had the following attributes: Mig: 12 Con: 13 Dex: 11 Per: 14 Int: 13 Res: 15.\n\n## Gallery\n\n<gallery>\nFile:PE2 Pallegina No Armor.png| Pallegina without the armor, showing the feathers covering her entire body.\nFile:Breastplate-pallegina.jpg| Pallegina with her unique armor\nFile:Pallegina-portrait.jpg| Companion portrait in ''Pillars of Eternity''\nFile:Portrait pallegina lg PoE2.png| Companion portrait in ''Deadfire''\nFile:Portrait pallegina convo.png| Conversation portrait in ''Deadfire''\n</gallery>\n\n{{References|30em}}\n\n{{Companions navbar PoE1}}\n{{Companions navbar PoE2}}\n[Category:Ondra's Gift characters](/categoryOndrasGiftCharacters/)\n[Category:Kahanga Palace characters](/categoryKahangaPalaceCharacters/)\n[Category:Queen's Berth characters](/categoryQueensBerthCharacters/)",
  "raw": "{{Infobox npc\n|game         = poe1 \n|game2        = poe2\n|name         = Pallegina\n|image        = A1 Pallegina Composite.png\n|screenshot   = \n|race         = Godlike\n|subrace      = Avian\n|gender       = Female\n|class        = Paladin\n|deity        = \n|faction      = [[Frermàs mes Canc Suolias]]\n|location     = [[Ondra's Gift]]<hr/>[[Kahanga Palace]]\n|attributes   = Mig: 12 Con: 13 Dex: 11 Per: 14 Int: 13 Res: 15\n|culture      = [[Vailian Republics]]\n|background   = Soldier\n|companion    = Permanent\n|quests       = [[At All Costs]]<Br/>[[The Child of Five Suns]]<Br/>[[The Nest Above the Clouds]]<hr/>[[Family Pride]]<Br/>[[The Man of Chimes]]\n|sells        = \n|internalname = Companion_Pallegina\n}}\n{{quote|Ah, the luxury of choosing what tangled idiocies you can be involved with. It must be nice.}}\n'''Pallegina mes Rèi''' (pronunciation: pah-lleh-DJEE-nah)<ref>[http://forums.somethingawful.com/showthread.php?threadid=3593502&pagenumber=52&perpage=40#post424464608 Forum post by Josh Sawyer]</ref> is a female [[avian godlike]] [[paladin]] and one of the recruitable [[companion]]s in {{poe1}}.\n\nShe can be recruited after completing the quest [[At All Costs]], in [[Ondra's Gift]].\n\n==Background==\nPallegina mes Rèi is a 26 years old, thin, athletic woman with dark brown skin, brown-black hair, and a mix of avian features: Golden bird eyes and feathers growing out of her hair and limbs, a sign of godlike heritage linked to [[Hylea]], the Sky-Mother. She was born to human parents in a small ﬁshing village near Biageppe. During childbirth, her unusual body caused her mother enormous pain and internal bleeding, nearly killing her. Upon seeing the baby’s body, the midwife realized that Pallegina must be a godlike, touched by one of the deities and “blessed” with unusual features. Though she was given the name of her great-grandmother on her mother's side, she was named mes Rèi like all godlike among the Vailians.<ref name=\"PoESG\"/>\n\nDespite her status, her first six years of life were defined by hardship: Injuries sustained in childbirth prevented her mother from bearing more children, leading her father to hate her for seemingly ending his line. Although he did not throttle Pallegina at birth (a common choice among godlike parents, one few are blamed for), the resentment defined her early years. For what it was worth, her mother never blamed her for anything, but she was only a woman in the Republics. Everything changed for the young godlike when [[Frermàs mes Canc Suolias]] (Brotherhood of the Five Suns) were dispatched by the duc of Ozia to eliminate pirates plaguing her home town, Pallegina saw how people celebrated and thanked them for their service. More importantly, she saw how they were free to leave the village, leaving its dreary existence behind. Her father saw an opportunity to both get rid of his damned child and still come ahead.<ref name=\"Pallegina\">Pallegina</ref>\n\nHe traded her for back taxes owed to the duc. The recruiter accepted the godlike as a prestigious recruit. Although the Frermàs were an all-male order, Republic's laws considered all godlike to be genderless (due to their inability to sire or bear children), and so the young Pallegina was accepted. Although it raised a few eyebrows and caused no small amount of resentment among the more conservative members of the order, she quickly learned not to care and focus on her duties. The sexism and prejudice she experienced at the academy took their toll however, particularly when she started going through puberty and the godlike features manifested in full at twelve. Her only friend at the time was [[Giacolo]], who discovered the characteristic chime of the godlike within her and even attempted to remove it when Pallegina threatened to commit suicide if she didn't. He tried the treatment, severing the connection and knocking Pallegina out for two weeks. Although the brothers expected her to die, Pallegina didn't - and through his work lost most of her feathers and started resembling ocean folk much more closely than before. She credits Giacolo with saving her life and lifting her out of intense depression. Bolstered by her newfound confidence, she passed  her final examinations at 20.<ref name=\"Pallegina\"/><ref>[http://forums.obsidian.net/topic/65115-update-72-death-godlike-and-expected-ship-date/?view=findpost&p=1417342 Forum post by Josh Sawyer]</ref><ref>[http://forums.somethingawful.com/showthread.php?threadid=3593502&pagenumber=52&perpage=40#post424464545 Forum post by Josh Sawyer]</ref>\n\n===Service===\nAlthough rebellious, Pallegina managed to toe the line between insubordination and initiative for six long years, long enough to establish herself as a trusted operative of the ducs. Although the songretta would prefer she be just another tool in their hands, Pallegina's unique perspective and patriotism led her to believe that there are better ways to protect the Vailian Republics than pure economic domination and naval might.<ref>http://www.pcgamer.com/2014/04/18/pillars-of-eternity-interview-josh-sawyer-on-world-building-magic-psychic-warriors-and-more/</ref> When she was instructed to accompany ambassadors and merchants to [[Defiance Bay]], protecting them while they ensure the ports remain open for the Republics to evacuate their holdings from the city in anticipation of a popular revolt caused by [[Waidwen's Legacy]], her doubts turned to certainty. She realized that ducal thinking in ordinary ﬁnancial terms was a tunnel-vision, focusing on the traditional resources of maritime trade and ignoring the revolutionary potential of [[animancy]] pioneered in the Dyrwood and the Republics. The ducs' short-sighted policy  would protect many of their investments, but ensure the Republics would be weakened by the loss of  inestimable wealth in animancy research and technology.<ref name=\"PoESG\"/>\n\nActing against her orders, Pallegina decided to investigate the underlying causes of revolutionary talk, shadowing ﬁgures at the ducal palace and interrogating information brokers. When she discovered that animancy itself may be a key element of the political upset, she tried placing herself closer to the attendants and courtiers of the erls and (Dyrwoodan) duc. Due to her political allegiances and striking appearance, she quickly failed at this endeavor and received an official rebuke from the Brotherhood. Rather than test their patience, Pallegina decided to lay low, executing her standing orders as a glorified bodyguard, while looking for an opportunity to restart her investigation.<ref name=\"PoESG\"/> Unfortunately for her, this meant being stuck in a holding pattern, watching over Mestre [[Verzano]] of the [[Vailian Trading Company]] and playing witness to his inexorable descent into abject failure and quite likely death. Something that cannot come too soon to liberate her from the burden<ref>[[At All Costs]]</ref>\n\n==={{poe1}}===\nIn encountering [[the Watcher]], Pallegina recognized a potential ally in her investigation. After [[Verzano]] was out of the picture, freeing her from his net of stupidity, she urged the Watcher to assist her in ﬁnding the parties who are conspiring to outlaw [[animancy]] in the [[Free Palatinate of Dyrwood|Dyrwood]] – and possibly the [[Vailian Republics]]. Unfortunately, her superiors did not agree, and instead ordered her to broker a trade deal between the Vailian Republics and [[Eir Glanfath]], aiming to take over Dyrwood's trade with the [[Glanfathans]]. She had serious misgivings about her ducs' plans, keenly aware that whatever short-term profit might be gained from taking over trade with Eir Glanfath would be outweighed by the long-term losses resulting from alienating the Dyrwood. The Republics would eventually pay the price for such ruthlessness, as while the Dyrwood may have lost a generation of soldiers due to [[Waidwen's Legacy]], it would eventually regain its power… With all that entails. But the road to [[Twin Elms]] was long enough to allow her to mull over the choice she has to make.<ref name=\"PoESG\">''Pillars of Eternity Strategy Guide''</ref> \n\nMost importantly, her mission to Eir Glanfath is also a test of Pallegina's loyalty. Her independence was a long-standing problem by the ducs. News of her unsanctioned investigation reached the ears of the ducesa of [[Biageppe]] and the duc of [[Selona]]. Pallegina's actions complicated the already volatile situation, raising concerns about her ability to fulfill her duties. Her immediate superior, ambassador [[Vicent Agosti]], shared their sentiment: Although he had sympathy for her viewpoint, he was utterly loyal to the ducs and feared what might happen if news of their insubordination reached [[Spirento]].<ref>Interactions with the ambassador and Pallegina after completing [[At All Costs]].</ref>\n\n===5 Year Interlude===\nPallegina's decision on how she delivered the trade agreement and the Watcher's choices affected Pallegina in one of five ways:\n\n<!-- n_Pallegina_Decision == 1 AND n_Ending == 4 -->\n1. If Pallegina followed the ducs' orders, and the Watcher distributed the souls to the Dyrwood at the end of the events of {{poe1}}, she is honored by the ducs:\n\n{{Description|Pallegina had followed her orders from the ducs bels, helping to establish an exclusive trade arrangement between the Vailian Republics and the tribes of Eir Glanfath. Strenghened by the Watcher's gift of souls, the furious Dyrwoodans waged war against the Republics for two long years. The Republics gained a great deal of wealth in trade but suffered the loss of many vessels and thousands of lives. Several of the ducal families lost favor with their citizens. Riots in Selona claimed the life of that city's duc, and the other ducs bels were pressured into relinquishing the exclusive trade rights to end the conflict with the Dyrwood. Pallegina was honored for her service at the opening of trade. Thankfully her reputation among the ducs and within the Brotherhood was not tarnished by what followed.}}\n\n<!-- n_Pallegina_Decision == 1 AND n_Ending != 4 -->\n2. If Pallegina followed the ducs' orders, and the Watcher didn't distribute the souls to the weakened Dyrwood, she is honored and becomes personal guard to the ducess of Spireno:\n\n{{Description|Pallegina had followed her orders from the ducs bels, helping to establish an exclusive trade arrangement between the Vailian Republics and the tribes of Eir Glanfath. With the Dyrwoodans still weakened by Waidwen's Legacy, the Vailian Republics easily pushed their would-be competitors out of the market. The Dyrwood suffered as terribly from the lost trade as the Republics benefited from it. Pallegina was honored for her service by being assigned as the personal guard of the ducess Spireno. Despite her success, she regretted the choices she had made along the way.}}\n\n<!-- n_Pallegina_Decision == 0 -->\n3. If Pallegina was disgraced after her quest line wasn't resolved, she is banished from the Republics and becomes a guard:\n\n{{Description|Pallegina had gone against the ducs bels' orders by inventing a new trade arrangement with the anamenfath to accommodate the recovering Dyrwoodan market. As a result, the Dyrwood and the Vailian Republics were plunged into a trade war.\n\nFor her outrageous insubordination and audacity, Pallegina was banished from the Republics. The five suns representing the five ducs bels were scraped from the face of her breastplate, an enduring mark of her disgrace.}}\n\n:After the Watcher parted ways, she returned to the Republics to report to the ducs bels'. Having failed to complete her mission, the ducs were furious that they had lost a golden opportunity to establish exclusive trade with the Glanfathans. She was exiled from the brotherhood, and was put on a ship to [[Readceras]], forever banned from the Republic and stripped of her pride and purpose.\n\n:Pallegina will not be satisfied with what happened to her, not by a long shot. She spent five years trying to make a living as a guard, drifting from port to port until winding up in the Deadfire. \n\n<!-- n_Pallegina_Decision == 2 AND n_Ending == 4 -->\n4. If Pallegina was disgraced after ignoring the ducs orders, but the Watcher distributed the souls to the Dyrwood, she is later pardoned:\n\n{{Description|Pallegina had gone against the ducs bels' orders by inventing a new trade arrangement with the anamenfath to accommodate the recovering Dyrwoodan market. As a result, the Dyrwood and the Vailian Republics were plunged into a trade war.\n\nFor her outrageous insubordination and audacity, Pallegina was banished from the Republics. The five suns representing the five ducs bels were scraped from the face of her breastplate, an enduring mark of her disgrace.}}\n\n:Pallegina's invention of new trade terms with Eir Glanfath did not go down well with the ducs. When she returned, she explained that allowing the Dyrwood to retain some trading rights with the Eir Glanfath would be beneficial for everyone in the years to come, however the damage had been done. Banished from the order, her breastplate was scoured of the five stars and she was put on a ship to [[Readceras]], forever banned from the Republics.\n\n:For almost three years, she wandered the ports looking for new work as a guard, until the Ducess of Spirento sent for her and requested her presence in Biageppe. Pallegina's wisdom was recognized after the ducs tabulated the profits from the three way trade that emerged between the Dyrwood, Eir Glanfath, and the Republics, and she was reinstated in the order with full rights accepting an official pardon from the Ducess of Biageppe.\n\n:Pallegina was later assigned to protect the VTC interests in the Deadfire, in recognition of her talents in the Dyrwood.\n\n<!-- (n_Pallegina_Decision == 2 AND n_Ending != 4) -->\n5. If Pallegina disobeys her orders, and the Dyrwood isn't strengthened by the souls, she is banished and joins the [[Kind Wayfarers]].\n\n==={{poe2}}===\n\nThe Watcher meets Pallegina after arriving in [[Neketaka]] at [[Kahanga Palace]] if she was not disgraced (or was disgraced and later pardoned), or in [[Queen's Berth]] if she was disgraced. \n\nIf Pallegina was disgraced she has a few choice words if you're not sympathetic to her status. She will launch into an epic rant:\n\n{{Description| She blinks once, her golden eyes opening wide, fixated on you. Her nostrils flare and the veins in her neck strain against her skin.\n\n\"Vu maddicche postenago! Buffan vi! Cues es malgro me fulpa med tuor! Peri chue na cracuna ve engeri! Vu tros men merla!\" [You damned idiot! Fuck yourself! This is all your fault anyway! I hope a kraken swallows you! You piece of shit!]\n\nPallegina continues to issue forth a stream of unintelligible insults. Her hands are flowing through a series of obscene gestures as she backs away from you.\n\nVailians around Queen's Berth turn their attention toward the fountain of profanity. Some are amused. A mother shields her smiling son's eyes from the vulgar pantomime. As Pallegina angrily stomps off into the distance, the pace of life returns to normal.}}\n\nIf she joins your party she will ask you to help her find the animancer [[Giacolo]], who had severed her godlike chime as a teenager.\n\n==Interactions==\n==={{poe1}}===\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =[[The Child of Five Suns]]\n|quests_involved =[[At All Costs]]\n|none            = \n|other           = She has unique dialog with [[Hylea]] in [[Council of Stars]] when finishing [[The Nest Above the Clouds]].\n}}\n\n====Companion====\n* She can be recruited in [[Ondra's Gift]] after [[At All Costs]].\n* Pallegina is a Republic patriot with an almost single-minded devotion to the Republics and their prosperity. She possesses a wealth of information about them and will frequently provide it when a Vailian institution or person is involved.\n* She gets on well with other companions due to her compassion. [[Durance]] is perhaps the sole exception, due to his misogyny, and is frequently at the receiving end of Pallegina's sarcasm. \n* Despite being an avian godlike, she can't stand birds.<ref>Praying to Hylea during [[Council of Stars]] will prompt this comment.</ref>\n\n====Unique talents and gear====\n* As the only [[avian godlike]] in the game, she receives the following passive racial talent:\n** '''[[Elusive Quarry]]''': +10 Deflection against ranged attacks, +10 Defense when Disengaging while Endurance below 50%, and +3 Perception while Endurance below 50%.\n*From her paladin order [[Frermàs mes Canc Suolias]] (which is unique to her) she gets the following class talents:\n** '''[[Vielo Vidòrio]]''': Gives nearby allies an attack speed bonus when Flames of Devotion is used.\n** '''[[Wrath of Five Suns]]''': Shoots out five Burn damage projectiles when Sworn Enemy is used.<ref>https://forums.obsidian.net/topic/82857-300-patch-teased-by-josh-on-sa/?p=1767163</ref>\n* She uses [[Pallegina's breastplate]], which is a [[Unique item|unique item]].<ref>[http://forums.obsidian.net/topic/60547-gratification-in-acquiring-epiclegendary-items/?view=findpost&p=1459777 forum post by J.E. Sawyer]</ref>\n\n====Companion quest====\n* [[The Child of Five Suns]] is received after recruiting Pallegina, after completing [[At All Costs]].\n* Pallegina is caught between honoring the wishes of the ducs bels and pursuing the leads she believes will be more beneﬁcial to her country in the long run, which involve learning about animancy.\n* The quest cannot be resolved until Act 3, when Twin Elms becomes available.\n\n====Endings====\nPallegina's ending depend on two events:\n# How you influence her decision during [[The Child of Five Suns]].\n# If you strengthen the Dyrwood inhabitants with the souls [[Thaos ix Arkannon|Thaos]] diverted at [[Sun in Shadow]]. The strengthened nation is more likely to fight back if the trade deal is not in their favor.\n\n==={{poe2}}===\n{{Interactions\n|companion       =x\n|wares           =\n|stronghold      =\n|rest            =\n|quests_started  =[[The Man of Chimes]]\n|quests_involved =[[Family Pride]]<br/>[[A Vote of No Confidence]]\n|none            = \n|other           =\n}}\n\n====Companion====\n* Pallegina's location, backstory, and reaction to you is dependent on the outcome of [[The Child of Five Suns]] in {{Poe1}}.\n** If Pallegina followed her orders, or if she was disgraced and later pardoned (she is pardoned if Watcher distributed the souls to the Dyrwood at the end of the first game), she will be found at [[Kahanga Palace]] assisting Count Nichese in the argument with the RDC. She can be recruited immediately afterwards, as Queen Onekaza II sends the Watcher to investigate Hasongo.\n** If Pallegina was disgraced for not following her orders and was not pardoned, she will be encountered in [[Queen's Berth]], near the statue in the center of the area, where she initially denies your offer to join your party. Later, she can be found in the [[Vailian Trading Company Headquarters]] after the argument with the RDC at [[Kahanga Palace]]. With the interests of the Republics in mind, Count Nichese calls on Pallegina to assist you with your investigation.\n* Pallegina will leave permanently if the player sides with the [[Huana]] during [[The Coming Storm]] and Pallegina is in the player's active group (the queen asks her to leave) or if the player frames the director on the fire at the [[powderhouse]] (by taking the quest from the director but frame him/her in the hearing at the palace).\n*Pallegina also leaves if the player sides with the [[Royal Deadfire Company]] during The Coming Storm.\n* Pellagina can also leave if you side with the Principi. She will also leave (automatically the next time you sail) if you refuse to side with the VTC after [[A Vote of No Confidence]].\n* Pallegina will also leave your company if you kill either [[Atello Valera]] or [[Ezzali Bardatto]] during [[Family Pride]] with her in your party.\n\n====Class====\n* The class options available to Pallegina are [[paladin]] ([[Paladin#Frerm.C3.A0s_mes_Canc_Suolias|Frermàs mes Canc Suolias]]), [[Crusader]] (paladin + [[fighter]]), or [[Herald]] (paladin + [[chanter]]).\n**[[Paladin#Frerm.C3.A0s_mes_Canc_Suolias|Frermàs mes Canc Suolias]] is Pallegina's unique paladin subclass, which grants the upgraded Sworn Enemy ability [[Wrath of the Five Suns]].\n\n====Unique talents and gear====\nThe breastplate she wears depends on her {{Poe1}} ending.\n\n*If Pallegina followed her orders, and you didn't distribute the souls to the Dyrwood: [[Honor Guard Breastplate (Pallegina)]]\n*If Pallegina followed her orders, and you distributed the souls to the Dyrwood: [[Five Suns Breastplate]]\n*If Pallegina disobeyed her orders, and you distributed the souls to the Dyrwood: [[Five Suns Breastplate]]\n*If Pallegina disobeyed her orders, and you didn't distribute the souls to the Dyrwood: [[Desgraza Breastplate]]\n\n====Companion quest====\n* [[The Man of Chimes]] is triggered when taking Pallegina near the Spire of Soul Seers in [[The Sacred Stair]]. She will insist on meeting [[Giacolo]], an old friend from the past.\n* She will mention his research, giving you the opportunity to point out that he was likely building on the work of Todh Beylecg (Metaphysics 5 and History 2) and learn of the suffering she experienced as a godlike - and the way Giacolo saved her from suicide.\n* You can either save Giacolo or not, either result affects her end-game slides.\n\n====Reputation====\n* Pallegina likes:\n** {{Topic|Antireligious}} '''Antireligious:''' Dislikes and distrusts the gods and organized religions and appreciates criticism of them.\n** {{Topic|Pro-Animancy}} '''Pro-Animancy:''' Views animancy as vital for the progress of the world and responds well to those who support its research and practice. \n** {{Topic|Dutiful}} '''Dutiful:''' Admires people who take responsibility and don't shirk the tasks presented to them.\n** {{Topic|Pro-Vailian Republics}} '''Pro-Vailian Republics:''' Believes in and supports the Vailian Republics and takes a positive view of those who do likewise.\n*Pallegina dislikes:\n** {{Topic|Pro-Godlike}} '''Pro-Godlike:''' Dislikes reverence for or admiration of godlike.\n** {{Topic|Piety}} '''Piety:''' Dislikes religious reverence and piety and has negative views towards those who express such characteristics.\n** {{Topic|Racism}} '''Racism:''' Takes a dim view of racist comments and attitudes.\n\n====Relationships====\n* Pallegina and [[Maia Rua]] will often be at odds over their differing political affiliations.\n* She will have little patience with [[Tekēhu]], who embraces his godlike heritage.\n* She has a poor view of [[Xoti]], given Xoti's adherence to her god and faith, things which Pallegina considers naive and foolish.\n* She cannot be romanced by the Watcher.\n\n====Endings====\nPallegina's ending depend on three events:\n\n# Which faction you ultimately side with. Siding with the [[Vailian Trading Company]] is her preference.\n# Which director is leading at the end of [[A Vote of No Confidence]].\n#Saving Giacolo (or not) during [[The Man of Chimes]].\n\n==Behind the scenes==\n* Pallegina was written by [[Josh Sawyer|Joshua Sawyer]].<ref>http://forums.obsidian.net/topic/74557-companions-who-wrote-what/#entry1622138</ref>\n* She is voiced by actress [[Mela Lee]]\n* She is not affected by the Reputations or Dispositions of the player in {{poe1}}.\n* Before PoE 1.03, Pallegina had the following attributes: Mig: 12 Con: 13 Dex: 11 Per: 14 Int: 13 Res: 15.\n\n==Gallery==\n<gallery>\nFile:PE2 Pallegina No Armor.png| Pallegina without the armor, showing the feathers covering her entire body.\nFile:Breastplate-pallegina.jpg| Pallegina with her unique armor\nFile:Pallegina-portrait.jpg| Companion portrait in ''Pillars of Eternity''\nFile:Portrait pallegina lg PoE2.png| Companion portrait in ''Deadfire''\nFile:Portrait pallegina convo.png| Conversation portrait in ''Deadfire''\n</gallery>\n\n{{References|30em}}\n\n\n{{Companions navbar PoE1}}\n{{Companions navbar PoE2}}\n[[Category:Ondra's Gift characters]]\n[[Category:Kahanga Palace characters]]\n[[Category:Queen's Berth characters]]",
  "slug": "palleginaMesRei",
  "title": "Pallegina mes Rèi"
}
