{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Powderhouse Lower.png\n| caption_map   = Powderhouse - Lower\n| image         = PE2 Powderhouse Upper.png\n| caption       = Powderhouse - Upper\n| image2        = PE2 Powderhouse Storage.png\n| caption2      = Powderhouse Storage\n| name          = Powderhouse\n| type          = Building\n| description   = \n| exits         = \n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = Powderhouse Captain\n| main_location = The Brass Citadel\n| plants        = \n| expected_level= 6\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = no\n| zone_id       = zn_08_rauatai_district\n| internalname  = AR_0803_Rauatai_Powderhouse_Lower<br/>AR_0804_Rauatai_Powderhouse_Upper<br/>AR_0809_Rauatai_Powderhouse_Storage\n| guid          = 2a031e30-7154-4d70-a037-53e80632a941<br/>b6ce9a92-2c39-4e40-b887-43ea86b81e5a<br/>0d7c8c53-27a1-4a56-9b76-34f42eee4e40\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nThe primary store of gunpowder used by the Royal Deadfire Company in the Deadfire, providing a strategic reserve of firepower for their entire navy. As such, a single spark or the tiniest flame could unmake the proud empire's entire campaign...\n\nCurrently the powderhouse is closed off for all but Royal Deadfire Company captains.\n\n==Points of interest==\nEntering the powderhouse can be done in a number of ways:\n* Using [[Bluff]] 12, to convince the guard at the door that the [[Hazanui Karū|Hazanui]] gave you permission to enter.\n* Using [[Mechanics]] 15 to pick the lock on the door to the upper powderhouse (via the ramparts directly above the ground entrance).\n* Using [[Sleight of Hand]] 4 (and sufficient [[Stealth]]) to pickpocket the patrolling guard on the ramparts for the [[Powderhouse Key|key]] to the upper powderhouse.\n* By killing the patrolling guard and picking up said key. Unusually this does not alert nearby enemies.\n\n;Powderhouse - Lower\n* Upon entry you will be stopped by the [[Powderhouse Captain]] (assuming you aren't in [[Scouting Mode|stealth]]). She demands that you explain yourself. You can be permitted entry with Good (3) reputation with the RDC, or with 1 reputation and 12 Bluff (fails if you have a Shady disposition of 2 or more). Otherwise you'll have to attack or be escorted out.\n** If she permits you to enter, the captain warns you not to bare an open flame, and that downstairs is off limits.\n** If you've started [[Sabotage at the Brass Citadel]] or [[Taking Out the Traders]], and [[Maia]] is in the party, she'll immediately snitch on you and reveal your intentions to the RDC captain, causing her to leave the party and become hostile.\n* Upon repeated entry, you will only get two warnings from the captain before she becomes fed up and attacks.\n* Wielding a torch in this area has no effect, even on the dialogue with the captain.\n;Powderhouse - Upper\n* A small area serving as an exit to the upper part of the Brass Citadel, and the ramparts.\n* After setting the powderhouse alight, smoke and embers can be seen coming from below, and from the stairs. If you stay in this area for too long during this period (about 1 minute), the area will erupt in explosions and you will be killed.\n;Powderhouse Storage\n* Located in the basement of the powderhouse, this area serves as the main storage area of the RDC's stockpile of gunpowder, and as such is packed with guards and RDC. The tip of a luminous adra pillar can be seen jutting from the floor to the northeast, a gunpowder silo to the southwest of that, and then quality control. To the west is the overseers desk, where incoming and outgoing shipments to RDC colonies are managed.\n* This area is off limits, entering will always cause the characters to become hostile. Clearing them out should be no problem, as there's no lack of explosive barrels. Just be sure to stand clear!\n\n==Characters==\n* [[Powderhouse Captain]]\n\n==Enemies==\n;Powderhouse Lower\n* Powderhouse Guard (x2)\n* Powderhouse Mixer (x3)\n* Rauatain Chanter (x1)\n;Powderhouse Storage\n* Powderhouse Guard (x3)\n* Powderhouse Mixer (x7)\n* Rauataian Priest (x1)\n\n==Loot==\n* The powderhouse contains only minor loot, a small assortment of basic weapons, bombs, and ingredients - mainly gunpowder.\n\n==Gallery==\n<gallery mode=nolines widths=200px>\nFile:PE2 Powderhouse Exterior.png | Building exterior\n</gallery>",
  "slug": "powderhouse",
  "title": "Powderhouse"
}
