{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Sandswept Ruins.png\n| image         = PE2 Desert Island SW Sandswept Ruins.png\n| caption_map   = \n| name          = Sandswept Ruins\n| type          = Ruin\n| description   = \n| exits         = Pillars of Eternity II: Deadfire world map{{!}}World map\n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Deadfire Archipelago\n| plants        = \n| expected_level= 12\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = no\n| zone_id       = \n| internalname  = AR_2608_Desert_Ruin\n| guid          = 4ca736dd-5cc2-475c-97a5-7363ef819372\n| lsc           = \n| icon          = Icon Mountain Ridge Entrance.png\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}. It is located on the southwestern-most desert island, at the coordinates 38° 38' S 32° 25' E.\n\n==Background==\nAn ancient Huana burial temple to the far south-west of the Archipelago.\n\n==Points of interest==\n* This ruin is filled with traps, located beneath the floorplates. Each set requires a different Mechanics level to unlock. [[Thief's Putty]] is your best friend here. If you have an out-of-combat movement ability like [[Bounding Boots]]' [[Leap]], you can use it to skip the traps entirely.\n* To get to the enclosure to the southeast, you'll need Mechanics 6 to disarm all the traps - or you can carefully tiptoe around them. The lever opens a hidden room near the entrance, which contains an execution chamber with four Sigils of Death inside.\n** Entering this room without destroying the sigils will kill you very quickly, so take out the sigils from afar with a ranged weapon, or use a [[Sigil of Death Wardstone]] before entering.\n** With a very high perception, you can spot a hidden switch beyond the death sigils that disables the traps in the final room. Hit it, and you can walk in and take the stuff without any trouble.\n* The traps in the corridor to the northeast require Mechanics 7, while the set beyond needs at least Mechanics 15 to cut straight through. In this set there is a path of lower-difficulty traps that you can take, increasing in difficulty as you go along. Watch out beyond, as there's yet another trap there. And then another. And another.\n* Your final goal is the ancient chamber at the end. It's obviously a burial crypt of some sort. To disable the fire, you need to place four characters at each of the pulleys and activate them at the same time - the best way to do this is by pausing the game. Access the altar and collect the [[aumaua skull]] and the [[Last Word]] (not the other way around!). The door will seal shut and sand will start pouring in. You can bypass the security system by:\n** Holding the door open with Might 13, then Might 15. Then either with a further Might 17 to heave the door open, or with Athletics 9 to dive out of the way of the doors after the party exits. Failing the second might check will result in [[Status effects (Deadfire)#Smashed Hands|Smashed Hands]] (+20% Recovery Time). Failing the third Might check will result in a [[Status effects (Deadfire)#Wrenched Shoulder|Wrenched Shoulder]] (-3 Might).\n** Break the door down by using a a corrode ability (e.g. [[Necrotic Lance]]), a [[Grenade]], or a [[Concussion Bomb]] (it takes three of either one of these to breach the door and escape).\n** Obliterate the door with a single [[Implosion Charge]].  \n* You'll only get 8 moves before being buried alive.\n\n==Loot==\n* A bunch of [[Ruby (Deadfire)|Rubies]] in the chest to the southeast.\n* [[Aumaua skull]] and the [[Last Word]]: In the burial chamber.\n* [[Exceptional Dagger (Deadfire)|Exceptional Dagger]], [[Exceptional Hatchet (Deadfire)|Exceptional Hatchet]] and [[Exceptional Leather Armor (Deadfire)|Exceptional Leather Armor]]: On the corpse in the hidden room with the sigils.\n\n==Gallery==\n<tabber>\nGallery=\n<gallery>\n PE2 Sandswept Ruins Traps.png | Trap difficulty in the northern corridor\n PE2_Sandswept_Ruins_Fire.png | Altar room\n</gallery>\n|-|\nApproach=\n'''Approaching the ruins from the desert:'''\n<gallery mode=nolines>\n RE si desert.png\n RE si uncharted 08 desert ruin ext.png\n</gallery>\n|-|\nInteraction=\n'''Altar room scripted interaction'''\n<gallery mode=nolines>\n RE si uncharted 08 desert ruin door closed.png\n RE si uncharted 08 desert ruin door open 01.png\n RE si uncharted 08 desert ruin door open 02.png\n RE si uncharted 08 desert ruin door open 03.png\n RE si uncharted 08 desert ruin door damaged 01.png\n RE si uncharted 08 desert ruin door damaged 02.png\n RE si uncharted 08 desert ruin door damaged 03.png\n RE si uncharted 08 desert ruin sand hand.png\n</gallery>\n|-|\n</tabber>",
  "slug": "sandsweptRuins",
  "title": "Sandswept ruins"
}
