{
  "markdown": "'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "raw": "{{Infobox item poe2\n| name           = Ship's Log of the Tempest Turn\n| icon           = poe2 book_tome_green icon.png\n| description    = An excerpt from the journal of Noran, former First Mate of the Tempest Turn. It reeks of stale liquor and whiteleaf smoke.\n\n\"Day 286\n\nSuppose this is more of a diary now (though let's be honest, it was heading that course for some time now) on account of Captain Deluna kicking me from the ship. And all because I kept reminding her how she said one night over dinner she'd finally listen to my theories on that crew who went missing near some island - (what was it called, Bloodlung Island or Kazuwari or something such?) - to the north of Fort Deadlight. I don't remember. Point is, I know it wasn't the Floating Hangman what got them cause the dhow was recovered and it didn't have no blood on the deck nor even any torn sails or pockmarked wood. For that matter, it couldn't have been those trading company bastards, ship hunters, slavers, Huana savages, or aumaua military.\n\nThe crew just up and disappeared. Every last one. No bodies. No blood. Just clothes and food and grog left behind. Gods, THEY LEFT THE GROG! Every last cask.\n\nSo you tell me, Captain Deluna, just what happened to them? What new threat's out there what we ought to be spending gold and rubies and blood and sweat to prepare for?!\n\nWho took them if it wasn't a flock of overly cunning imps with the taste for pirate flesh?\n\nWell, I'm going to find out. Just as soon as I charter a ship to that island.\"\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Book\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 80\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = Lore_Book_Pirate_Log\n| location       = \n| guid           =282d6eb4-cc97-4429-9bd7-e182243be16b\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}",
  "slug": "shipsLogOfTheTempestTurn",
  "title": "Ship's Log of the Tempest Turn"
}
