{
  "markdown": "'''{{PAGENAME}}''' is a [faction quest](/pillarsOfEternityIiDeadfireQuestsFactionQuests/) in {{poe2}}.\n\n## Synopsis\n\nQueen Onekaza has asked that the Watcher aid her in a plot to destroy Rauatai's powderhouse and implicate the [Vailian Trading Company](/vailianTradingCompany/). This would debilitate Rauatai's armaments and disgrace the Vailian's colonial leadership in one fell swoop. \n\n## Walkthrough\n\n{{Note|Accepting this quest will cause [Maia](/maia/) and [Pallegina](/pallegina/) to leave the party immediately. They may be convinced to stay temporarily, but completing the quest by blowing up the powderhouse will always result in them leaving (see [consequences](/consequences/) below)}}\n* The Queen leaves the sabotage to your discretion, though you can't leave witnesses (not a big deal, given that anyone detecting you will attack). Infiltrating the powderhouse can be done either way (see [Powderhouse](/powderhouse/) for more info). \n* The sneaky way involves entering the powder house by picking the doors leading inside. The upper door can be picked with '''Mechanics 15''' or the appropriate [key](/powderhouseKey/), and you can sneak in undetected.\n* It's entirely possible to plant the explosives without detection, with a high enough Stealth skill. Consider removing your companions from the party (double back to your ship after lockpicking the door - it will stay unlocked). Five people are a lot more visible than one.\n* Make your way to the lower floor of the powder storage, and plant the explosive in the vat, located in the western part of the room.\n* Sneak out the way you came in, but be quick about it, since the powderhouse will go up around your ears if you tarry. \n* Alternatively, you can make use of the VTC questline to be teleported inside.\n* After the deed is done, make your way back to the palace.\n* During the confrontation at the palace that follows, you can lean a number of ways:\n** Either follow through with with Onekaza's plan, which results in the VTC Director being banished to the Gullet and both of the trading companies getting significant setbacks. The RDC will be given the Director's holdings as recompense.\n** Reveal yourself as the culprit, which will result in a battle where you will have to kill the Prince and the Hazanui.\n** Use the opportunity to switch over to follow the [VTC questline](/sabotageAtTheBrassCitadel/), by claiming the innocence of the VTC director.\n\n## =Alternative\n\n=\nIf you wish to save the VTC director and keep Maia, you can skip this quest and still side with the Huana by doing the following.<ref name=\"RedditMaia\">[https://www.reddit.com/r/projecteternity/comments/evokt0/refuse_hazanui_kar%C5%AB_and_maias_reaction Reddit Post: Refuse Hazanui Karū and Maia's reaction]</ref>\n* Before talking to the queen or the VTC director, first talk to [Hazanui Karū](/hazanuiKaru/). Tell her you will commit to the [Royal Deadfire Company](/royalDeadfireCompany/), but then tell her you can't go through with her plans to assassinate the queen.\n* Everyone will turn hostile and you'll have to fight your way out.\n* If you have Maia in your party she will NOT turn hostile. She will continue to stay in your party, even if you do side with the Huana afterwards. However, she will refuse to speak with you anymore. \n* Then speak with the queen. She will tell you she had plans for the trading company, but because you took action first, she will offer you aid right away after committing to the Huana. \n\n## Consequences\n\n* Completing this quest will make you lose both [Maia](/maiaRua/) and [Pallegina](/palleginaMesRei/) as a companion, and force you to side with [Queen Onekaza II](/queenOnekazaIi/) for the final attack on [Eothas](/eothas/).\n<!-- Look into Pallegina dialogue and put here, perhaps add sub-sections -->\n* When accepting this quest with Maia as a companion in your party, the Queen will be hesitant to give you the details of the mission. Maia will leave the party after accepting the quest, as the Queen's plan conflicts with Maia's duty.\n* However, when accepting this quest with Maia as a companion in your party, she will have additional dialogue before leaving, giving you the chance to convince her otherwise. This will allow you to <u>temporarily</u> keep Maia on board, instead of having her leave immediately, giving you the chance to continue adventuring before proceeding with the quest. Keep in mind that after destroying the powderhouse, Maia will leave regardless of the checks passed here. There is no way to avoid this without using console commands, unless you resort to other means of completing the quest (see the [alternative](/alternative/) route above). All of the following checks are required to keep Maia on your team for the duration of the quest.<ref name=\"maia_stay_talk\">[Talk:Taking Out the Traders](/talkTakingOutTheTraders/)</ref>\n** Pass one of the following checks in conversation:\n*** [Diplomacy](/diplomacy/) 5 or [Insight](/insight/) 4: ''\"You want to stay. You'll hate yourself if you don't.\"''\n*** [Bluff](/bluff/) 6: ''\"Whatever we do, you only have to worry about it if we get caught.\"''\n*** Be in any level of relationship with Maia: ''\"I need you to stay. You're a constant in my life, and I'm afraid of losing you.\"''\n** Learn Maia is an assassin during [The Courier's Calling](/theCouriersCalling/), with [Tuaha](/tuaha/) and [Harama](/harama/) still alive (i.e. complete The Courier's Calling with the best possible outcome).\n** Tell Maia \"You're an assassin. Let the company hire another\" '''OR''' \"They have enough rifles and cannons to punch a hole in the Deadfire without you\".\n** Be currently at full romance with Maia.\n** Pass a silent [disposition](/disposition/) check where [Diplomatic](/diplomatic/) and [Shady](/shady/) is NOT rank 2 or above.\n** If you're successful, Maia will say ''\"Whatever you're planning, just... try and leave me out of it? You're holding the rifle. Don't make me pull the trigger.\"''\n: Another opportunity to convince Maia arises upon approaching the entrance to the Powderhouse in [The Brass Citadel](/theBrassCitadel/), via either the ramparts or the main gate. This only occurs if you did not speak to the Queen with Maia in the party in the conversation above (and therefore didn't get the chance to convince her):\n:* She will say: ''\"I've gone this far with you, but I'm thinking this is where we part ways.\"'' After which you can pass a subset of the above checks to achieve the same outcome as if you had succeeded earlier:\n:** Be currently at full romance with Maia and say ''\"Stay with me. [Player Ship] needs you and I do as well.\"''\n:** [Tuaha](/tuaha/) and [Harama](/harama/) still alive during the quest [The Courier's Calling](/theCouriersCalling/).\n:** Have a \"very positive\" [companion relationship](/companionRelationship/) with Maia (shown as \"2\" in the Reputations tab of the character sheet).\n:* Interestingly, a bit of dialogue exists for if you already convinced Maia, though since the conversation is only triggered if you didn't speak to or convince her, it will never be shown. In the case it happens to trigger, all dialogue options lead to: ''\"I suppose I'm with you for the long haul. Not that it gives me any peace of mind.\"''\n: Later you will need to ensure that Maia is NOT in the party upon entering the [Powderhouse](/powderhouse/), as she will snitch on you if you are spotted, or will turn on you as soon as you enter the [Powderhouse Storage](/powderhouseStorage/), causing her to become hostile.\n* If you are successful and convince her to stay, she will turn a blind eye and will later leave on good terms. This influences Maia's [endings](/pillarsOfEternityIiDeadfireEndingsMaia/), causing her to voluntarily leave the RDC in her end-game slides.\n* By using the in-game [console](/console/), Maia can be forced to stay permanently even after blowing up the powderhouse. Naturally, this counts as cheating and will invalidate achievements.\n** If Maia has not yet left the party, and you haven't had a chance to convince her otherwise, you can force all the \"convincing\" conditions to be met prior to the conversation (assuming you don't already meet these conditions):\n*** If you have yet to speak with Maia at the start of the quest during your conversation with the Queen (or [Director Castol](/directorCastol/) / [Lueva Alvari](/luevaAlvari/) if doing the VTC equivalent quest), use: <code>SetGlobalValue n_Maia_Romance_State 4 & SetGlobalValue n_Quest_Harama_State 2 & SetGlobalValue n_Quest_Tuaha_State 3 & SetGlobalValue n_Maia_Quest_State 5</code> before starting the conversation. After this, proceed to \"THEN\" below.\n*** If you have spoken with the Queen without Maia in the party, but haven't yet blown up the powderhouse, you still have the pre-powderhouse chat to convince her. You'll have to use a slightly different set of commands before approaching the entrance to the Powderhouse with Maia in tow:\n***# <code>SetGlobalValue n_Maia_Romance_State 4 & SetGlobalValue n_Quest_Harama_State 2 & SetGlobalValue n_Quest_Tuaha_State 3</code>\n***# <code>CompanionAddRelationship Companion_Maia(Clone) Player_VS(Clone) Positive Major false & CompanionAddRelationship Companion_Maia(Clone) Player_VS(Clone) Positive Major false & CompanionAddRelationship Companion_Maia(Clone) Player_VS(Clone) Positive Major false & CompanionAddRelationship Companion_Maia(Clone) Player_VS(Clone) Positive Major false</code>\n***# <code>RepeatCommands 1 & RepeatCommands 1 & RepeatCommands 1 & RepeatCommands 1 & RepeatCommands 1</code>\n***# Proceed below.\n** '''THEN''' If you just (or have already) convinced Maia to stay in the party and she has not already left, continue as normal with the quest and sabotage the powderhouse (boot her from the party first of course). Any time after placing the explosive, but prior to travelling on the world map (with 1 hour of leeway after leaving port), run {{cmd|SetGlobalValue|b_Maia_Exit 0}}, then optionally {{cmd|SetGlobalValue|n_Maia_Romance_State 4}} to maintain the romance state. This will cause the missive condition to fail, and will prevent Maia from leaving.\n** If Maia has already left the party (either via missive or in person) she will have to be re-added to the party. Do so after blowing up the powderhouse, otherwise she will leave again:\n*** If she left the party on the world map (via missive), if you have left a zone (a collection of areas), or if you have left the immediate map and reloaded (any of which would clear the character from the cache), a new instance will need to be added. Only run this if {{cmd|PrintInstance|b1a7e802-0000-0000-0000-000000000000}} returns null: {{cmd|SpawnPrefabAtMouse|Companion_Maia}}, then continue below.\n*** If an instance of Maia still exists, use {{cmd|AddToParty|Companion_Maia(Clone)}}, then run <code>AISetScriptedUseObject b1a7e802-0000-0000-0000-000000000000 00000000-0000-0000-0000-000000000000 & AISetScriptedBehavior b1a7e802-0000-0000-0000-000000000000 None & ActivateObject b1a7e802-0000-0000-0000-000000000000 true & SetGlobalValue b_Maia_Left 0 & SetGlobalValue b_Maia_Exit 0 & SetGlobalValue n_Maia_Romance_State 4</code>\n* Even if you switch Maia and Pallegina out before accepting the quest from the queen or don't bring them along, you won't be able to keep either in the party. You will later receive a letter from each (while sailing), explaining that as a result of your actions they cannot follow you any longer.\n** [Pallegina's Farewell](/palleginasFarewell/).\n** [Maia's Farewell](/maiasFarewellPostPowderhouse/), if you don't include her in the party when accepting the quest, and leave \"on good terms\" with her.\n* The [Royal Deadfire Company](/royalDeadfireCompany/)'s opinion of you changes depending on whether you chose the stealth or violent route while sabotaging the powderhouse:\n**'''Stealth:''' If you planted the explosives without being seen by anyone, you are still friendly with the people in the Brass Citadel and can go back there, though they will ask you to leave since someone sabotaged their powderhouse, and they're busy cleaning it up. If you try going past them , they'll attack.\n**'''Violence:''' If you killed anyone during your infiltration, the rauatai in the Brass Citadel will attack you on sight if you show your face there.\n\n## Trivia\n\n* The powderhouse explosion sequence occurs in real time. Standing around or engaging in combat for too long will run down the clock, bringing the building down around your head.\n* If you speak to Maia after blowing up the powderhouse but before leaving port, she refuses to speak to you: ''Maia simply glares at you.''\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/XX_Huana_Faction_Questline/FCT_QST_05_Destroying_Rivals.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''Taking Out the Traders'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Queen Onekaza</b> has asked that I aid her in a plot to destroy <b>Rauatai's powderhouse</b> and implicate the <b>Vailian Trading Company</b>. This would debilitate Rauatai's armaments and disgrace the Vailian's colonial leadership in one fell swoop.\n|-\n| rowspan=\"6\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Infiltrate the <b>Royal Deadfire Company's powderhouse</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| The queen leaves the infiltration of the <b>powderhouse</b> to my discretion, but there should be no witnesses to contradict the cover story. If my tampering goes undetected, then the explosion itself will take care of any evidence.\n\nThe powderhouse lies <b>east of the Brass Citadel's dock</b>. \n|-\n| style=\"vertical-align:text-top\" | 20001\n| My connections with the <b>Vailian Trading Company</b> may aid in carrying out the destruction of the <b>powderhouse</b>. The queen only asks that I remember my allegiance to the <b>Huana</b>.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I planted the explosive in the <b>powderhouse</b>. Time to get out before the whole place blows up.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I've made it to the <b>powderhouse</b>. All that remains is to find a discreet and suitable place to plant the explosive in the <b>lowest level</b>.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| I handed over the explosive to <b>Hazanui Karū</b> and revealed the queen's plan to destroy the powderhouse.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Return to the <b>palace</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| The powderhouse has been reduced to smoldering rubble. <b>Queen Onekaza</b> will want to hear of this.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| A clerk at the <b>Vailian Trading Company headquarters</b> informed me that <b>Director Castol</b> has been summoned to the <b>palace</b> in <b>Serpent's Crown</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Survive.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| I let the faction heads know that I was the culprit behind the explosion at the powderhouse. \n\nIt didn't go over very well.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Follow up with <b>Queen Onekaza</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| Director Castol has been implicated in the explosion and banished to the Gullet. I can meet with the <b>queen</b> privately in <b>Kahanga Palace</b> to discuss our success.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Return to the <b>palace</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I took a more direct approach in dealing with the trading companies. There's no chance of going about this in a subtle fashion now.\n\n|-\n! colspan=\"3\" | Unused strings\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''-'''\n| style=\"vertical-align:text-top\" | 40001\n| Now that his position within the Vailian Trading Company is secure, <b>Director Castol</b> has outlined a plan to cripple Rauatai by destroying their <b>powderhouse</b>. To keep anyone from suspecting the Company's involvement, he has suggested working with animancers to find a more clandestine means of executing the plan.\n|-\n| style=\"vertical-align:text-top\" | 40002\n| Now that her position within the Vailian Trading Company is secure, <b>Governor Alvari</b> has outlined a plan to cripple Rauatai by destroying their <b>powderhouse</b>. To keep anyone from suspecting the Company's involvement, she has suggested working with animancers to find a more clandestine means of executing the plan.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30000\n| Someone vital to the completion of this quest has been killed\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| The Vailian Trading Company leadership has taken the fall for the destruction of the powderhouse, and the Royal Deadfire Company is none the wiser. Queen Onekaza has promised me her support.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30002\n| I decided not to play along with Queen Onekaza's scheme, and informed the gathered participants that I destroyed the powderhouse. Neither the queen nor the Rauataian leadership took kindly to my betrayal. It is doubtful that any of the trading companies or the Huana will welcome my presence. \n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30003\n| I decided not to play along with Queen Onekaza's scheme and insisted upon Director Castol's innocence. \n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30004\n| I decided not to play along with Queen Onekaza's scheme and revealed my loyalty to the Príncipi. The queen and the Rauataian leadership did not take kindly to my betrayal. Having declared my allegiance, I doubt I will be welcome among the trading companies or the Huana.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30005\n| I informed the hazanui of the plan to destroy Rauatai's powderhouse and gave her the explosive. She disabled it.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30006\n| I solved Queen Onekaza's problem with violence, dispensing with any need for subtlety or schemes. \n|}\n{{references}}",
  "raw": "{{Infobox quest poe2\n| name         = Taking Out the Traders\n| image        = PE2 Taking Out the Traders.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Faction quest\n| quest_region = Deadfire - The Brass Citadel\n| quest_level  = 14\n| faction      = Huana\n| locations    = Kahanga Palace;The Brass Citadel;Powderhouse\n| main_npcs    = Queen Onekaza II\n| companion    = Tekēhu\n| quest_giver  = Queen Onekaza II\n| xp_amount    = 6000\n| xp_type      = Normal\n| xp_level     = 14\n| xp_weights   = 1;1;1;1;1\n| rewardname1  = Destroy the powderhouse\n| reward1      =  \n| rewardname2  = \n| reward2      =  \n| rewardname3  = \n| reward3      =  \n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = Fruitful Alliance\n| conc         = The Coming Storm;Sabotage at the Brass Citadel\n| next         = \n| internalname = FCT_QST_05_Destroying_Rivals\n| guid         = 189a5426-1670-42ca-aff2-dd7a0d795f1e\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests#Faction quests|faction quest]] in {{poe2}}.\n\n==Synopsis==\nQueen Onekaza has asked that the Watcher aid her in a plot to destroy Rauatai's powderhouse and implicate the [[Vailian Trading Company]]. This would debilitate Rauatai's armaments and disgrace the Vailian's colonial leadership in one fell swoop. \n\n==Walkthrough==\n{{Note|Accepting this quest will cause [[Maia]] and [[Pallegina]] to leave the party immediately. They may be convinced to stay temporarily, but completing the quest by blowing up the powderhouse will always result in them leaving (see [[#Consequences|consequences]] below)}}\n* The Queen leaves the sabotage to your discretion, though you can't leave witnesses (not a big deal, given that anyone detecting you will attack). Infiltrating the powderhouse can be done either way (see [[Powderhouse]] for more info). \n* The sneaky way involves entering the powder house by picking the doors leading inside. The upper door can be picked with '''Mechanics 15''' or the appropriate [[Powderhouse Key|key]], and you can sneak in undetected.\n* It's entirely possible to plant the explosives without detection, with a high enough Stealth skill. Consider removing your companions from the party (double back to your ship after lockpicking the door - it will stay unlocked). Five people are a lot more visible than one.\n* Make your way to the lower floor of the powder storage, and plant the explosive in the vat, located in the western part of the room.\n* Sneak out the way you came in, but be quick about it, since the powderhouse will go up around your ears if you tarry. \n* Alternatively, you can make use of the VTC questline to be teleported inside.\n* After the deed is done, make your way back to the palace.\n* During the confrontation at the palace that follows, you can lean a number of ways:\n** Either follow through with with Onekaza's plan, which results in the VTC Director being banished to the Gullet and both of the trading companies getting significant setbacks. The RDC will be given the Director's holdings as recompense.\n** Reveal yourself as the culprit, which will result in a battle where you will have to kill the Prince and the Hazanui.\n** Use the opportunity to switch over to follow the [[Sabotage at the Brass Citadel|VTC questline]], by claiming the innocence of the VTC director.\n\n===Alternative===\nIf you wish to save the VTC director and keep Maia, you can skip this quest and still side with the Huana by doing the following.<ref name=\"RedditMaia\">[https://www.reddit.com/r/projecteternity/comments/evokt0/refuse_hazanui_kar%C5%AB_and_maias_reaction Reddit Post: Refuse Hazanui Karū and Maia's reaction]</ref>\n* Before talking to the queen or the VTC director, first talk to [[Hazanui Karū]]. Tell her you will commit to the [[Royal Deadfire Company]], but then tell her you can't go through with her plans to assassinate the queen.\n* Everyone will turn hostile and you'll have to fight your way out.\n* If you have Maia in your party she will NOT turn hostile. She will continue to stay in your party, even if you do side with the Huana afterwards. However, she will refuse to speak with you anymore. \n* Then speak with the queen. She will tell you she had plans for the trading company, but because you took action first, she will offer you aid right away after committing to the Huana. \n\n==Consequences==\n* Completing this quest will make you lose both [[Maia Rua|Maia]] and [[Pallegina mes Rèi|Pallegina]] as a companion, and force you to side with [[Queen Onekaza II]] for the final attack on [[Eothas]].\n<!-- Look into Pallegina dialogue and put here, perhaps add sub-sections -->\n* When accepting this quest with Maia as a companion in your party, the Queen will be hesitant to give you the details of the mission. Maia will leave the party after accepting the quest, as the Queen's plan conflicts with Maia's duty.\n* However, when accepting this quest with Maia as a companion in your party, she will have additional dialogue before leaving, giving you the chance to convince her otherwise. This will allow you to <u>temporarily</u> keep Maia on board, instead of having her leave immediately, giving you the chance to continue adventuring before proceeding with the quest. Keep in mind that after destroying the powderhouse, Maia will leave regardless of the checks passed here. There is no way to avoid this without using console commands, unless you resort to other means of completing the quest (see the [[#alternative|alternative]] route above). All of the following checks are required to keep Maia on your team for the duration of the quest.<ref name=\"maia_stay_talk\">[[Talk:Taking Out the Traders]]</ref>\n** Pass one of the following checks in conversation:\n*** [[Diplomacy]] 5 or [[Insight]] 4: ''\"You want to stay. You'll hate yourself if you don't.\"''\n*** [[Bluff]] 6: ''\"Whatever we do, you only have to worry about it if we get caught.\"''\n*** Be in any level of relationship with Maia: ''\"I need you to stay. You're a constant in my life, and I'm afraid of losing you.\"''\n** Learn Maia is an assassin during [[The Courier's Calling]], with [[Tuaha]] and [[Harama]] still alive (i.e. complete The Courier's Calling with the best possible outcome).\n** Tell Maia \"You're an assassin. Let the company hire another\" '''OR''' \"They have enough rifles and cannons to punch a hole in the Deadfire without you\".\n** Be currently at full romance with Maia.\n** Pass a silent [[disposition]] check where [[Diplomatic]] and [[Shady]] is NOT rank 2 or above.\n** If you're successful, Maia will say ''\"Whatever you're planning, just... try and leave me out of it? You're holding the rifle. Don't make me pull the trigger.\"''\n: Another opportunity to convince Maia arises upon approaching the entrance to the Powderhouse in [[The Brass Citadel]], via either the ramparts or the main gate. This only occurs if you did not speak to the Queen with Maia in the party in the conversation above (and therefore didn't get the chance to convince her):\n:* She will say: ''\"I've gone this far with you, but I'm thinking this is where we part ways.\"'' After which you can pass a subset of the above checks to achieve the same outcome as if you had succeeded earlier:\n:** Be currently at full romance with Maia and say ''\"Stay with me. [Player Ship] needs you and I do as well.\"''\n:** [[Tuaha]] and [[Harama]] still alive during the quest [[The Courier's Calling]].\n:** Have a \"very positive\" [[companion relationship]] with Maia (shown as \"2\" in the Reputations tab of the character sheet).\n:* Interestingly, a bit of dialogue exists for if you already convinced Maia, though since the conversation is only triggered if you didn't speak to or convince her, it will never be shown. In the case it happens to trigger, all dialogue options lead to: ''\"I suppose I'm with you for the long haul. Not that it gives me any peace of mind.\"''\n: Later you will need to ensure that Maia is NOT in the party upon entering the [[Powderhouse]], as she will snitch on you if you are spotted, or will turn on you as soon as you enter the [[Powderhouse Storage]], causing her to become hostile.\n* If you are successful and convince her to stay, she will turn a blind eye and will later leave on good terms. This influences Maia's [[Pillars of Eternity II: Deadfire endings#Maia|endings]], causing her to voluntarily leave the RDC in her end-game slides.\n* By using the in-game [[console]], Maia can be forced to stay permanently even after blowing up the powderhouse. Naturally, this counts as cheating and will invalidate achievements.\n** If Maia has not yet left the party, and you haven't had a chance to convince her otherwise, you can force all the \"convincing\" conditions to be met prior to the conversation (assuming you don't already meet these conditions):\n*** If you have yet to speak with Maia at the start of the quest during your conversation with the Queen (or [[Director Castol]] / [[Lueva Alvari]] if doing the VTC equivalent quest), use: <code>SetGlobalValue n_Maia_Romance_State 4 & SetGlobalValue n_Quest_Harama_State 2 & SetGlobalValue n_Quest_Tuaha_State 3 & SetGlobalValue n_Maia_Quest_State 5</code> before starting the conversation. After this, proceed to \"THEN\" below.\n*** If you have spoken with the Queen without Maia in the party, but haven't yet blown up the powderhouse, you still have the pre-powderhouse chat to convince her. You'll have to use a slightly different set of commands before approaching the entrance to the Powderhouse with Maia in tow:\n***# <code>SetGlobalValue n_Maia_Romance_State 4 & SetGlobalValue n_Quest_Harama_State 2 & SetGlobalValue n_Quest_Tuaha_State 3</code>\n***# <code>CompanionAddRelationship Companion_Maia(Clone) Player_VS(Clone) Positive Major false & CompanionAddRelationship Companion_Maia(Clone) Player_VS(Clone) Positive Major false & CompanionAddRelationship Companion_Maia(Clone) Player_VS(Clone) Positive Major false & CompanionAddRelationship Companion_Maia(Clone) Player_VS(Clone) Positive Major false</code>\n***# <code>RepeatCommands 1 & RepeatCommands 1 & RepeatCommands 1 & RepeatCommands 1 & RepeatCommands 1</code>\n***# Proceed below.\n** '''THEN''' If you just (or have already) convinced Maia to stay in the party and she has not already left, continue as normal with the quest and sabotage the powderhouse (boot her from the party first of course). Any time after placing the explosive, but prior to travelling on the world map (with 1 hour of leeway after leaving port), run {{cmd|SetGlobalValue|b_Maia_Exit 0}}, then optionally {{cmd|SetGlobalValue|n_Maia_Romance_State 4}} to maintain the romance state. This will cause the missive condition to fail, and will prevent Maia from leaving.\n** If Maia has already left the party (either via missive or in person) she will have to be re-added to the party. Do so after blowing up the powderhouse, otherwise she will leave again:\n*** If she left the party on the world map (via missive), if you have left a zone (a collection of areas), or if you have left the immediate map and reloaded (any of which would clear the character from the cache), a new instance will need to be added. Only run this if {{cmd|PrintInstance|b1a7e802-0000-0000-0000-000000000000}} returns null: {{cmd|SpawnPrefabAtMouse|Companion_Maia}}, then continue below.\n*** If an instance of Maia still exists, use {{cmd|AddToParty|Companion_Maia(Clone)}}, then run <code>AISetScriptedUseObject b1a7e802-0000-0000-0000-000000000000 00000000-0000-0000-0000-000000000000 & AISetScriptedBehavior b1a7e802-0000-0000-0000-000000000000 None & ActivateObject b1a7e802-0000-0000-0000-000000000000 true & SetGlobalValue b_Maia_Left 0 & SetGlobalValue b_Maia_Exit 0 & SetGlobalValue n_Maia_Romance_State 4</code>\n* Even if you switch Maia and Pallegina out before accepting the quest from the queen or don't bring them along, you won't be able to keep either in the party. You will later receive a letter from each (while sailing), explaining that as a result of your actions they cannot follow you any longer.\n** [[Pallegina's Farewell]].\n** [[Maia's Farewell (post-Powderhouse)|Maia's Farewell]], if you don't include her in the party when accepting the quest, and leave \"on good terms\" with her.\n* The [[Royal Deadfire Company]]'s opinion of you changes depending on whether you chose the stealth or violent route while sabotaging the powderhouse:\n**'''Stealth:''' If you planted the explosives without being seen by anyone, you are still friendly with the people in the Brass Citadel and can go back there, though they will ask you to leave since someone sabotaged their powderhouse, and they're busy cleaning it up. If you try going past them , they'll attack.\n**'''Violence:''' If you killed anyone during your infiltration, the rauatai in the Brass Citadel will attack you on sight if you show your face there.\n\n==Trivia==\n* The powderhouse explosion sequence occurs in real time. Standing around or engaging in combat for too long will run down the clock, bringing the building down around your head.\n* If you speak to Maia after blowing up the powderhouse but before leaving port, she refuses to speak to you: ''Maia simply glares at you.''\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/XX_Huana_Faction_Questline/FCT_QST_05_Destroying_Rivals.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''Taking Out the Traders'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Queen Onekaza</b> has asked that I aid her in a plot to destroy <b>Rauatai's powderhouse</b> and implicate the <b>Vailian Trading Company</b>. This would debilitate Rauatai's armaments and disgrace the Vailian's colonial leadership in one fell swoop.\n|-\n| rowspan=\"6\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Infiltrate the <b>Royal Deadfire Company's powderhouse</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| The queen leaves the infiltration of the <b>powderhouse</b> to my discretion, but there should be no witnesses to contradict the cover story. If my tampering goes undetected, then the explosion itself will take care of any evidence.\n\nThe powderhouse lies <b>east of the Brass Citadel's dock</b>. \n|-\n| style=\"vertical-align:text-top\" | 20001\n| My connections with the <b>Vailian Trading Company</b> may aid in carrying out the destruction of the <b>powderhouse</b>. The queen only asks that I remember my allegiance to the <b>Huana</b>.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I planted the explosive in the <b>powderhouse</b>. Time to get out before the whole place blows up.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I've made it to the <b>powderhouse</b>. All that remains is to find a discreet and suitable place to plant the explosive in the <b>lowest level</b>.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| I handed over the explosive to <b>Hazanui Karū</b> and revealed the queen's plan to destroy the powderhouse.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Return to the <b>palace</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| The powderhouse has been reduced to smoldering rubble. <b>Queen Onekaza</b> will want to hear of this.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| A clerk at the <b>Vailian Trading Company headquarters</b> informed me that <b>Director Castol</b> has been summoned to the <b>palace</b> in <b>Serpent's Crown</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Survive.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| I let the faction heads know that I was the culprit behind the explosion at the powderhouse. \n\nIt didn't go over very well.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Follow up with <b>Queen Onekaza</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| Director Castol has been implicated in the explosion and banished to the Gullet. I can meet with the <b>queen</b> privately in <b>Kahanga Palace</b> to discuss our success.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Return to the <b>palace</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I took a more direct approach in dealing with the trading companies. There's no chance of going about this in a subtle fashion now.\n\n|-\n! colspan=\"3\" | Unused strings\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''-'''\n| style=\"vertical-align:text-top\" | 40001\n| Now that his position within the Vailian Trading Company is secure, <b>Director Castol</b> has outlined a plan to cripple Rauatai by destroying their <b>powderhouse</b>. To keep anyone from suspecting the Company's involvement, he has suggested working with animancers to find a more clandestine means of executing the plan.\n|-\n| style=\"vertical-align:text-top\" | 40002\n| Now that her position within the Vailian Trading Company is secure, <b>Governor Alvari</b> has outlined a plan to cripple Rauatai by destroying their <b>powderhouse</b>. To keep anyone from suspecting the Company's involvement, she has suggested working with animancers to find a more clandestine means of executing the plan.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30000\n| Someone vital to the completion of this quest has been killed\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| The Vailian Trading Company leadership has taken the fall for the destruction of the powderhouse, and the Royal Deadfire Company is none the wiser. Queen Onekaza has promised me her support.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30002\n| I decided not to play along with Queen Onekaza's scheme, and informed the gathered participants that I destroyed the powderhouse. Neither the queen nor the Rauataian leadership took kindly to my betrayal. It is doubtful that any of the trading companies or the Huana will welcome my presence. \n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30003\n| I decided not to play along with Queen Onekaza's scheme and insisted upon Director Castol's innocence. \n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30004\n| I decided not to play along with Queen Onekaza's scheme and revealed my loyalty to the Príncipi. The queen and the Rauataian leadership did not take kindly to my betrayal. Having declared my allegiance, I doubt I will be welcome among the trading companies or the Huana.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30005\n| I informed the hazanui of the plan to destroy Rauatai's powderhouse and gave her the explosive. She disabled it.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30006\n| I solved Queen Onekaza's problem with violence, dispensing with any need for subtlety or schemes. \n|}\n{{references}}",
  "slug": "takingOutTheTraders",
  "title": "Taking Out the Traders"
}
