{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Tangaloa's Maw.png\n| image         = PE2 Tangaloa's Maw Swamp.png\n| caption_map   = \n| name          = Tangaloa's Maw\n| type          = Scripted interaction\n| description   = \n| exits         = \n| sub_locations = Swamp\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = Deadfire Archipelago\n| plants        = \n| internalname  = \n| lsc           = \n| icon          = Icon Bog.png\n}}\n'''{{Pagename nd}}''' is a scripted interaction an uncharted island, southeast of [[Neketaka]]. It is located at the coordinates 21° 2' S, 51° 34' E.\n\nTo the west lies the [[Forgotten catacomb]], and a [[Ruined tower]] to the east.\n\n== Background ==\nTangaloa's Maw is a large span of swampland, making up a good portion of the island.\n\n{{Description|The fetid, vegetal smell of decay alerts you to the swamp before you stumble upon it. It extends far into the distance, overgrown with ancient trees and vines. Solid patches of ground are few and far between. Crossing the morass will likely demand many miles of arduous travel.}}\n\n== Interaction ==\n* As you come across the swamp, it is immediately apparent that crossing it will take some effort. Use Athletics 4 to forge ahead, keeping yourself on dry ground, otherwise you can turn back and retreat. Beyond this, you come across a particularly boggy stretch of swamp, enclosed by dense trees, and with no way around it seems to be the only way through the area.\n* 5 hours will pass, when you suddenly are startled by a group of moaning voices. You spot a narrow trail that seems to exit the bog, but there's no telling where it leads. Use Survival 10 to head for the path, or stand your ground.\n** If you stand your ground, you will be attacked by a group of [[Skeletons]] and [[Rotghasts]], and will be thrown into combat, taking place in the [[Swamp]] staging area. While initially it seems like an easy fight, more enemies will spawn to attack you as you kill them - making for a fairly interesting fight. Remember that while in the water, you'll have the debuff [[Status effects (Deadfire)#Slog Zone|Slog Zone]], slowing your movement and making you unable to run.\n** If you instead head for the path, 4 hours will pass and you'll still be attacked. However, this time you'll start out of the water, making the fight a little easier. Additionally, some of the enemies will not be spawned - including the Skeleton archer, brigand and sorcerer.\n* Once you've killed all the enemies, you'll be left with the usual collection of loot. Sadly there's nothing of note here at all.\n\n== Enemies ==\n;Vessels\n* [[Skeletons]]\n** [[Skeleton (Deadfire)|Skeleton]] (x8): 3 initially, 3 spawn later, 2 more later\n** [[Skeletal warrior]]: From the west.\n** [[Skeletal archer]]: From the north.\n** [[Skeletal brigand]]: Central\n** [[Skeletal sorcerer]]: From the west\n* [[Rotghasts]]\n** [[Rotghast]] (x3): 3 initially.\n** [[Rotghast ravager]] (x2): Central, one from the northeast.\n** [[Rotghast slinger]] (x2): One from the southeast, one from the north.\n\n== Gallery ==\n<gallery>\n RE_si_swamp.png | SI graphic\n PE2 Tangaloa's Maw Island.png | The island\n</gallery>",
  "slug": "tangaloasMaw",
  "title": "Tangaloa's Maw"
}
