{
  "raw": "{{Infobox location poe2\n| game          = bow\n| map           = BOW Temple of Decline.png\n| caption_map   = \n| name          = Temple of Decline\n| type          =\n| description   = \n| exits         = \n| main_location = The Rimebound Temple\n| sub_locations = \n| merchant      = \n| expected_level= 14\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = ZN_LAX02_01_Iceberg_Dungeon\n| internalname  = AR_LAX02_0107_Iceberg_07\n| guid          = 8e06c065-3f1b-4b8b-bf6f-8bfacbb0e76b\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{bow}}.\n\n==Background==\nThis was once the heart of the Rimebound Temple, now little more than ruins surrounding the Vydmath, a portal to Rymrgand's domain.\n\n==Points of interest==\n* This is a straightforward affair. Head straight on to witness the dracolich being consumed by the Vydmath, thrown back into the White Void. Your job, as usual, is to do the illogical and pursue the beast inside. \n* By the portal is a special dead body. You can examine it closely and require Perception 13/Insight 12 to figure out that the corpse was probably reaching for something in its last moments - and that something or someone clawed at its gauntlet to get at the item the dead one was clutching. History 14 and Religion 11 allowed for a detailed examination of just where the armor comes from and that it bears the iconography of Rymrgand. Seems like the elf was frozen solid here for a good two centuries. Remove the headgear to identify the owner as a Glamfellen and gain [[Helm of the White Void]].\n\n==Characters==\n* [[Rymrgand]]\n\n==Loot==\n* [[Helm of the White Void]]: Looted from the frozen elf.\n*[[Guardian's Plate]]: Salvaged from the frozen elf by the gate. With '''Sleight of Hands 13''' and a '''prybar''', you can remove the armor without shattering its previous owner.",
  "slug": "templeOfDecline",
  "title": "Temple of Decline"
}
