{
  "raw": "{{Infobox location poe2\n| game          = lax3\n| map           = LAX3 The Central Stacks.png\n| caption_map   = \n| name          = The Central Stacks\n| type          = Temple\n| description   = \n| exits         = Temple of Revelation\n| sub_locations = The Restricted Section;The Quarantined Section;Oratory of Wael\n| merchant      = \n| innkeeper     = \n| inhabitants   = \n| main_location = The Black Isles\n| plants        = \n| expected_level= 18\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = ZN_LAX03_03_College\n| internalname  = AR_LAX03_0304_Basement\n| guid          = 5a5c54dd-5509-42dd-b0f6-bfb7afeae894\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{lax3}}.\n\n==Background==\nThis massive library is the heart of the archives of the gigantic temple of Wael built atop the god's titanic body. The Archives themselves are maintained by the [[Hand Occult]] and the [[Librarian]]s, kith transformed into the tireless servants of Wael and keepers of his vast library of mysteries.\n\n==Points of interest==\n* The Central Stacks act as the hub of the Archives, divided into three distinct sections. The central one contains the stairway that leads to the oratory of Wael and is locked behind a door marked with the symbol of the Hand Occult ('''History 13''') and an impossibly complex mechanism. It can be picked with '''Mechanics 26''' or by acquiring the [[Incantations of the Hand]] and using them on the lock. This leads to the [[The Oratory of Wael|Oratory of Wael]].\n* The western wing leads to the Restricted Section and contains the majority of the books. The shelves are lined with many books that can be stolen (taking them outright will incur the wrath of the Librarians). To distract the drones from their work, you can topple the book stacks. The books are required to gain access to the restricted section.\n* The restricted section is accessed by placing the correct books on the lectern and activating the device in front of the door. The correct books are [[The History of Eora, Volume II: The Tribe of the People of the Deer]] on the right (''Born of a word and shared like a secret'') and [[The History of Eora, Volume IV: The Founding of Readceras]] on the left (''Scions of forest and adra'' references the delemgan and adragan; invaders are the Readcerans).\n* The eastern wing has suffered from an invasion of spores and fungi and is marked for cleanup in five to fifteen years. Compared to the rest of the stacks, it's a rather combat heavy area that leads to the quarantined section. Just before the entrance is a mass of spore tendrils that acts as the hub for the spore infestation.\n* The central area, which winds around the stairs to the oratory, has two parts, the western, and eastern, joined by a concourse to the north with the Chief Librarian statue. The eastern section contains a sealed door and the area beyond is accessible only through the quarantined section. It contains more dank spores and a chest with [[Aretezzo's Cane]]. The western part contains a small locked laboratory with an uninfested cat ([[Boras]]), plenty of traps, and  [[Catalog Record: Illuminated Manuscript]]. Curiously, the area is also decorated with artefacts that belonged to Watchers prominent in recent centuries, including the remnants of your steward.\n\n==Loot==\n* [[The History of Eora, Volume I: The Collapse of Grand Vailia]] and other tomes: On the shelves in the western section.\n*[[Log: Subject K-1121's Confiscated Possessions]], [[The Annals of Llengrath, Volume I of V]]: Dropped by the infested librarians in the quarantined section.\n;Central\n* [[Aretezzo's Cane]]: In the chest in the eastern, sealed-off section.\n* [[Catalog Record: Illuminated Manuscript]], [[Catalog Record: Memoirs of Heldr]], [[Catalog Record: Incantations of the Hand]], [[Catalog Record: Warden Contract]], [[Catalog Record: Bekarna's Celestial Grimoire]], [[Catalog Record: Maintenance Log - Flesh Construct Controller]]: In the Catalog Room with the cat.\n* [[Boras]]: [[Uninfested Cat]], found in the Catalog Room.\n\n[[Category:Pillars of Eternity II: Deadfire dungeons]]",
  "slug": "theCentralStacks",
  "title": "The Central Stacks"
}
