{
  "markdown": "'''{{PAGENAME}}''' is a [side quest](/pillarsOfEternityIiDeadfireQuestsSideQuests/) in {{poe2}}.\n\n## Synopsis\n\n \nDereo the Lean, a crime lord in the Gullet, seeks a valuable artifact known as the Cornett of Waves. However, it's only a part of a bigger effort to find one of Neketaka's long-lost treasures.\n\n## Overview\n\n# Talk to [Dereo the Lean](/dereoTheLean/) in [the Narrows](/theNarrows/), or be visited by the [Cloaked Messenger](/cloakedMessenger/) (after completing [Harsh Medicine](/harshMedicine/)) to begin the quest.\n# Acquire the [Cornett of Waves](/cornettOfWaves/) from [Takano's estate](/takanosEstate/) in [Serpent's Crown](/serpentsCrown/), either by stealing it, paying for it, or with a series of other checks.\n# Return to Dereo, and deal with [Ateira](/ateira/) and her gang on the way over.\n# Head to the [Old City](/oldCity/), either:\n#* Via the [Undercroft](/undercroft/) - speaking to [Gwenfin](/gwenfin/) to open the door leading to the [Old City Ruins](/oldCityRuins/) using the shell.\n#* Via the lift in [the Gullet](/theGullet/), leading to the [Old City Overlook](/oldCityOverlook/) itself.\n# '''Optionally:''' Dive down into the pool in the center of the Old City Overlook (area with the lift) to retrieve the [Cornett of Depths](/cornettOfDepths/).\n# Open the Temple of Ondra (located in the northwestern section of the Old City proper) using the shell, kill or avoid the [giant cave grub](/giantCaveGrub/) inside. If you have both shells, you can access the hidden room.\n# Inspect the mosaic on the rear wall of the temple, then return to Dereo to complete the quest.\n\n## Walkthrough\n\n## =Cornett of Waves\n\n=\n* Upon meeting Dereo, you will be asked for a favor: retrieve the [Cornett of Waves](/cornettOfWaves/) from [Takano](/takano/) at his estate. While talking to him, you can notice him wanting the artifact badly with [Perception](/perception/) 16 and can pursue the matter with [Insight](/insight/) 6 - though he will not reveal any more.\n** If you have already obtained it, you can also show him the [Cornett of Depths](/cornettOfDepths/) to trigger the next phase of the quest. Otherwise, acquiring the Cornett of Waves is simple enough.\n** If you already have the [Cornett of Depths](/cornettOfDepths/) '''and''' you inspected the mosaic before talking to Dereo, you can immediately complete the quest without getting the other shell, but you will miss out on some loot and experience. Dereo will compliment the Watcher on their wondrous abilities.\n* Head to [Takano's estate](/takanosEstate/) in [Serpent's Crown](/serpentsCrown/).\n** [Moon godlike](/moonGodlike/) - Simply ask Takano for it and he will give it to you with no fuss.\n** '''Steal the cornett yourself''' - It is found in a locked chest (difficulty 5) at the end of [Takano's estate](/takanosEstate/), next to the staircase. The [key](/takanosKey/) can be found in the wardrobe upstairs. Time the theft with the movement of the guard in this area.\n** '''Play on Takano's materialism''' - Takano will decline an offer to pay him directly for the shell, saying that he already has everything that he could want. Reading his soul reveals otherwise, and allows you to suggest that he could use the money to spruce the manor up, perhaps add a new window. This will set you back {{cp2|2500}}, or {{cp2|2150}} with [Bluff](/bluff/) 3, suggesting that Takano's neighbors boast of bigger houses, and that he should out-do them.\n** '''Convince Takano that the cornett deserves a better keeper'''\n**# Ask ''\"Why is the Cornett of Waves so special?\"'' to discover a bit of the cornett's history, imparting a bit of your own knowledge upon Takano (with an optional, [History](/history/) 1 + [Island aumaua](/islandAumaua/) + [Deadfire Archipelago](/deadfireArchipelago/), [Arcana](/arcana/) 5 or [Religion](/religion/) 5 check).\n**# Then tell him ''\"The Cornett of Waves is no mere trophy. It deserves a keeper who knows its history.\"''.\n**# Finally, warn him that ''\"Ondra punishes those who refuse to let go\"'' with [Religion](/religion/) 3, otherwise Takano will be reluctant to part with it and you'll have to pay {{cp2|750}}.\n** [Bluff](/bluff/) 5 - '''Lie to Takano'''\n**# ''\"I shouldn't say this, but I'm on a mission from the palace. A symbol as important as the cornett would help.\"''\n**# Then pay {{cp2|500}}, or pass either a [History](/history/) 7 or [Diplomacy](/diplomacy/) 4 check.\n** '''Threaten Takano's life''' - Requires at least [Intimidate](/intimidate/) 6 to avoid combat, resulting in Moderate Negative reputation with the Huana. Otherwise the other options will start combat with everyone in the estate.\n** '''Hire an assassin''' - [Rust](/rust/), an assassin in [Delver's Row](/delversRow/) can fetch the artifact for you. He'll ask for {{cp2|800}}, or {{cp2|1000}} if you want to keep Takano alive and a day for him to do the deed. You can use the wait function to skip the time. Curiously, even if you only pay {{cp2|800}} for his services, Takano will still be alive and well at his estate after you fetch the cornett from Rust, and a second Cornett of Waves will still exist in the Takano estate chest. This is probably a bug.\n** [Cornett of Depths](/cornettOfDepths/) - '''Show Takano that you have a special shell too''' - This won't get you anywhere, [Aloth](/aloth/) and [Tekēhu](/tekehu/) will react to this: [Pride](/pride/).\n* Return to Dereo.\n* If you have the [Cornett of Waves](/cornettOfWaves/) in your stash while travelling to or from [Serpent's Crown](/serpentsCrown/), there's a chance you'll encounter [Ateira](/ateira/), and her group of thugs. Ateira is the one Dereo originally hired to retrieve the cornett. She'll want the '''Cornett of Waves''', and will be adamant to fight for it. There's no option to give her the shell without a fight, but you can convince her otherwise with one of the following:\n**[Diplomacy](/diplomacy/) 4, [Diplomacy](/diplomacy/) 6, then [Bluff](/bluff/) 3 or reputation [Rational](/rational/) 2 - The cornett is just a worthless shell, and Dereo is just using it to frame someone. Picking any of the other checks will cause her to attack.\n** [Intimidate](/intimidate/) 4, then [Intimidate](/intimidate/) 6 - The thugs will make easy pickings. Note that this fails if you have [Benevolent](/benevolent/) 4 or a paladin of [The Shieldbearers of St. Elcga](/theShieldbearersOfStElcga/), with one the thugs calling you \"the softest sap in the Deadfire.\"\n** [Bluff](/bluff/) 4, then [Bluff](/bluff/) 6 - Dereo sent you to tie up some loose ends.\n*** With Positive reputation (2) with the [Príncipi sen Patrena](/principiSenPatrena/), the thugs recognize that you're in with the Príncipi, and that it's likely that Dereo would send you to clean up.\n*** Having reputation [Honest](/honest/) 2 will likewise result in them believing you.\n** Or you could just attack her, and get Minor Positive Reputation with Delver's Row Criminals.\n* Returning to Dereo with the '''Cornett of Waves''' will gain you Minor Positive reputation with Delver's Row Criminals, and {{cp2|300}}. If you encountered Ateira, you can tell him about it to gain further Minor reputation. At this point you can also push him further about his true motives regarding the cornett with [Intellect](/intellect/) 12, but to no avail. You're then instructed to take it to the [Undercroft](/undercroft/) below [Delver's Row](/delversRow/).\n\n## =Cornett of Depths (optional)\n\n=\n* If you wish to access the hidden room in Ondra temple, make sure to detour by the [Old City Overlook](/oldCityOverlook/) and grab the [Cornett of Depths](/cornettOfDepths/) from the sunken statue near the center of the area.\n** With [Perception](/perception/) 13, you can hear the calls of the cornett from the pool.\n** With [Survival](/survival/) 6, you'll notice the suspicious bones clustered around the water's edge.\n** This scripted interaction requires a character with at least [Constitution](/constitution/) 16 to retrieve the conch unharmed - otherwise the character will become [Fatigued](/statusEffectsDeadfireFatigue/).\n** After obtaining the conch, you'll be attacked by a bunch of skeletons.\n\n## =Old City Ruins\n\n=\n* Find [Gwenfin](/gwenfin/) in the [Undercroft](/undercroft/) near the entrance to the ancient Huana temple in the northern part, overlooking the bay. With [Athletics](/athletics/) 4 you can safely take the skiff shortcut on the main dock. Enter the chamber and inspect the statue. Place the cornett in the statue's hand to open the door. The Temple of Ondra isn't where it should be, so guess who's going to look for it inside? Head deeper into the [Old City](/oldCity/), north through the ruins. The temple you want is in the northwestern corner of the [Old City](/oldCity/) proper. Note that while Gwenfin says she is a bruiser, her health is low and she will not fight back if enemies are lured to her so low level parties cannot count on using her for aid. She will die quite rapidly but it does not result in quest failure.\n* Either the [Cornett of Waves](/cornettOfWaves/) or the [Cornett of Depths](/cornettOfDepths/) can open the way to the temple, which is guarded by a [giant cave grub](/giantCaveGrub/). Killing it is a major challenge, but you can always sneak by and accomplish your objective.\n** The giant grub is tough, with lots of health, and has strong but very slow attacks. It also summons other grubs to assist it. The trick to killing it is having a [cipher](/cipher/) cast [Tenuous Grasp](/tenuousGraspDeadfire/) on it. The giant grub will be charmed, and start killing the other grubs it summoned, reducing your burden. Similarly, the cipher spell [Pain Block](/painBlockDeadfire/) can help healing your frontline during the long fight.\n**If you take out the Grub Burrow in the Northernmost corner either before or shortly after the fight begins no grubs will spawn and you only have to deal with the giant grub.\n* If you obtained both conchs, place them inside the mural to open the secret wall. This leads to a hidden room containing the unique large shield [Cadhu Scalth](/cadhuScalth/) in the locked and trapped sarcophagus (difficulty 7) on the left, and the unique pollaxe [Wahai Pōraga](/wahaiPoraga/) in the sarcophagus on the right.\n* To complete the quest, inspect the [Ukaizo](/ukaizo/) mosaic at the back of the temple. Sneak around the giant cave grub if you didn't kill it.\n* Return to Gwenfin and then to Dereo to collect your rewards.\n\n## = Collect your rewards \n\n=\n* While talking to Dereo, you can use [Bluff](/bluff/) 6 or [History](/history/) 7 to find out that Ukaizo is sought by the Consuaglo mes Casitas of the Príncipi as a way to provide for themselves, as one of the richest and most fertile lands in the Deadfire. Dereo will dodge the question if you ask with [Insight](/insight/) 4. Uncovering this information allows you to ask for {{cp2|500}} hush money.\n* Dereo will then reward you with the unique blunderbuss [Kitchen Stove](/kitchenStove/). You can push him further and ask for a bonus:\n** [Streetwise](/streetwise/) 4 or [Diplomacy](/diplomacy/) 4 - An additional {{cp2|200}} and Minor Positive reputation with Delver's Row Criminals.\n** Uncovering Dereo's interest in Ukaizo - An additional {{cp2|500}} and Minor Positive reputation with Delver's Row Criminals.\n* Before leaving, he'll give you [Príncipi Colors](/principiColors/) - presumably handmade by Dereo himself over the course of the quest, as well as the [Triumph of Dereo the Lean](/triumphOfDereoTheLean/), the only triumph not given to you for defeating an enemy ship.\n\n## Gallery\n\n<tabber>\nInteraction 1=\n'''Obtaining the Cornett of Depths:'''\n<gallery mode=nolines>\n 06 SI Old City Water 01.png\n 06 SI Old City Water 02.png\n 06 SI Old City Water 03.png\n 06 SI Old City Water 04.png\n 06 SI Old City Water 05.png\n</gallery>\n|-|\nInteraction 2=\n'''Interacting with either of the statues of Ondra:'''\n<gallery mode=nolines>\n 06 SI Old City Statue 01.png\n 06 SI Old City Statue 02.png\n 06 SI Old City Hand 01.png\n 06 SI Old City Hand 02.png\n</gallery>\n|-|\nInteraction 3=\n'''Opening the secret chamber in the Old Temple of Ondra:'''\n<gallery mode=nolines>\n 06 SI Old City Ondra Mural 1.png\n 06 SI Old City Ondra Mural 2.png\n 06 SI Old City Ondra Mural 3.png\n</gallery>\n|-|\n</tabber>\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/06_Neketaka_Slums_District/06_QST_Treasure_Hunt.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"5\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Cornett's Call'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Dereo the Lean</b>, a crime lord in the <b>Gullet</b>, seeks a valuable artifact known as the <b>Cornett of Waves</b>.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| <b>Dereo</b> is looking for a mosaic in the <b>Old City</b>. The cornett will lead me to it.\n|-\n| style=\"vertical-align:text-top\" | 40002\n| A person of influence has taken an interest in me. I've been asked to meet him in the <b>Narrows</b>.\n|-\n| rowspan=\"8\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Get the <b>Cornett of Waves</b> from <b>Takano's villa</b> in Serpent's Crown.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| Dereo asked me to get an artifact called the <b>Cornett of Waves</b> from the Mataru, <b>Takano</b>, who owns it.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| <b>Dereo</b> wants the cornett more badly than he lets on. He said it's valuable, but he didn't elaborate.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| I'm not the first to attempt this job. <b>Dereo</b> originally hired someone else, but she didn't come through.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| <b>Dereo</b> said a related artifact, the <b>Cornett of Depths</b>, was lost when the <b>Old City</b> sank.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| I've hired <b>Rust</b> to acquire the <b>Cornett of Waves</b> for me. The assassin will need a full day to get the job done.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| According to <b>Takano</b>, a similar conch was lost when the <b>Old City</b> sank. Several Ondrites perished alongside it, doomed never to rise unless the shell did.\n|-\n| style=\"vertical-align:text-top\" | 20016\n| <b>Takano</b> isn't especially attached to the <b>Cornett of Waves</b>, and he's short on coin. Perhaps he'd be willing to sell it.\n|-\n| rowspan=\"6\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Meet <b>Gwenfin</b> in the <b>Undercroft</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| <b>Gwenfin</b> waits for me - and the cornett - in the <b>Undercroft</b>, near an ancient, Huana-style door.\n\nDereo told me to reach her via a <b>lift</b> in <b>Delver's Row</b>, which is separate from the Gullet.\n|-\n| style=\"vertical-align:text-top\" | 20015\n| Specifically, the lift is next to <b>Ernezzo's shop</b> in <b>Delver's Row</b>.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| <b>Gwenfin</b> is outside an ancient Huana ruin in the <b>Undercroft</b>, near the fort there.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| <b>Gwenfin</b> thinks I can use the cornett to open a door by the Ondrite statue.\n|-\n| style=\"vertical-align:text-top\" | 20017\n| I've killed <b>Gwenfin</b>. It's up to me to figure out how to use the cornett and get what <b>Dereo</b> wants.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Find a <b>temple of Ondra</b> in the <b>Old City</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| Apparently, the mosaic Dereo's looking for is in an <b>old temple</b> somewhere in the <b>ruins</b>. \n\n<b>Gwenfin</b> asked me to tell her where it is once I find it.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| There's a mural in the <b>Old City</b> ruins depicting two conch shells.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I found a conch inscribed with Ondrite symbols in the <b>Old City</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Report back to <b>Gwenfin</b> at the entrance to the <b>Undercroft</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| I found the temple of Ondra and saw an elaborate mosaic of a place called Ukaizo embedded in the wall. This must be what <b>Dereo</b> was looking for.\n\n<b>Gwenfin</b> waits to hear from me at the passage between the <b>Undercroft</b> and the <b>Old City</b>.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| In the temple, I found a wall carving with two sockets. Each was the right size and shape to fit the cornett.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Return to <b>Dereo</b> in the <b>Narrows</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| Gwenfin is on her way to secure the temple. She asked me to give <b>Dereo</b> the good news.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Meet a mysterious figure in the <b>Narrows</b> of the Gullet.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| A messenger told me that someone important wants to see me. \n\nI was told to head into the <b>Narrows</b>, turn right, turn right again, and go left at the bend, looking for signs of svef use. If I meet resistance, I can say <b>Dereo</b> sent for me.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Return the cornett to <b>Dereo</b> in the <b>Narrows</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| I acquired a conch instrument carved with symbols of Ondra - this seems like the \"cornett\" <b>Dereo</b> wants. \n\nHe's waiting for it in the <b>Narrows</b>, the tunnels that surround the Gullet.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| <b>Ateira</b>, the mercenary <b>Dereo</b> originally hired, ambushed me on the way back from <b>Takano's</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''8'''\n| colspan=\"2\" | '''Return to <b>Dereo</b> in the <b>Narrows</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10008\n| I found the temple of Ondra and saw an elaborate mosaic of a place called <b>Ukaizo</b> embedded in the wall. This must be what <b>Dereo</b> was looking for.\n\nHe promised a reward once I find it.\n|-\n| style=\"vertical-align:text-top\" | 20014\n| In the temple, I found a wall carving with two sockets. Each was the right size and shape to fit the cornett.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''9'''\n| colspan=\"2\" | '''Find the mosaic <b>Dereo</b> seeks in the <b>Old City</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10009\n| Dereo wants me to find a mosaic in the <b>Old City</b>. Now that Gwenfin's gone, I'll have to hope I know it when I see it.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| Dereo was pleased when I told him about the mosaic of Ukaizo. He warned me to keep my findings a secret.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30001\n| Someone critical to this quest has died.\n|}",
  "raw": "{{Infobox quest poe2\n| name         = The Cornett's Call\n| image        = PE2 The Cornett's Call.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Side quest\n| quest_region = Neketaka - The Gullet\n| quest_level  = 8\n| faction      = \n| locations    = Dereo's Lair;Takano's Estate;Undercroft;Old City\n| main_npcs    = Cloaked Messenger;Dereo the Lean;Takano;Ateira;Gwenfin\n| quest_giver  = Dereo the Lean;Cloaked Messenger\n| xp_amount    = 600\n| xp_type      = Normal\n| xp_level     = 8\n| xp_weights   = 1;1;1;1;1;1;1;1;1\n| rewardname1  = Find the mural\n| reward1      = [[Kitchen Stove]];[[Príncipi Colors]];[[Triumph of Dereo the Lean]];10% discount at [[Ernezzo|Ernezzo's Supplies]]\n| rewardname2  = \n| reward2      =  \n| rewardname3  = \n| reward3      =  \n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         =\n| internalname = 06_QST_Treasure_Hunt\n| guid         = 5827ef09-f91e-432d-a8c0-f55e3c981417\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests#Side quests|side quest]] in {{poe2}}.\n\n==Synopsis== \nDereo the Lean, a crime lord in the Gullet, seeks a valuable artifact known as the Cornett of Waves. However, it's only a part of a bigger effort to find one of Neketaka's long-lost treasures.\n\n==Overview==\n# Talk to [[Dereo the Lean]] in [[the Narrows]], or be visited by the [[Cloaked Messenger]] (after completing [[Harsh Medicine]]) to begin the quest.\n# Acquire the [[Cornett of Waves]] from [[Takano's estate]] in [[Serpent's Crown]], either by stealing it, paying for it, or with a series of other checks.\n# Return to Dereo, and deal with [[Ateira]] and her gang on the way over.\n# Head to the [[Old City]], either:\n#* Via the [[Undercroft]] - speaking to [[Gwenfin]] to open the door leading to the [[Old City Ruins]] using the shell.\n#* Via the lift in [[the Gullet]], leading to the [[Old City Overlook]] itself.\n# '''Optionally:''' Dive down into the pool in the center of the Old City Overlook (area with the lift) to retrieve the [[Cornett of Depths]].\n# Open the Temple of Ondra (located in the northwestern section of the Old City proper) using the shell, kill or avoid the [[giant cave grub]] inside. If you have both shells, you can access the hidden room.\n# Inspect the mosaic on the rear wall of the temple, then return to Dereo to complete the quest.\n\n==Walkthrough==\n===Cornett of Waves===\n* Upon meeting Dereo, you will be asked for a favor: retrieve the [[Cornett of Waves]] from [[Takano]] at his estate. While talking to him, you can notice him wanting the artifact badly with [[Perception]] 16 and can pursue the matter with [[Insight]] 6 - though he will not reveal any more.\n** If you have already obtained it, you can also show him the [[Cornett of Depths]] to trigger the next phase of the quest. Otherwise, acquiring the Cornett of Waves is simple enough.\n** If you already have the [[Cornett of Depths]] '''and''' you inspected the mosaic before talking to Dereo, you can immediately complete the quest without getting the other shell, but you will miss out on some loot and experience. Dereo will compliment the Watcher on their wondrous abilities.\n* Head to [[Takano's estate]] in [[Serpent's Crown]].\n** [[Moon godlike]] - Simply ask Takano for it and he will give it to you with no fuss.\n** '''Steal the cornett yourself''' - It is found in a locked chest (difficulty 5) at the end of [[Takano's estate]], next to the staircase. The [[Takano's Key|key]] can be found in the wardrobe upstairs. Time the theft with the movement of the guard in this area.\n** '''Play on Takano's materialism''' - Takano will decline an offer to pay him directly for the shell, saying that he already has everything that he could want. Reading his soul reveals otherwise, and allows you to suggest that he could use the money to spruce the manor up, perhaps add a new window. This will set you back {{cp2|2500}}, or {{cp2|2150}} with [[Bluff]] 3, suggesting that Takano's neighbors boast of bigger houses, and that he should out-do them.\n** '''Convince Takano that the cornett deserves a better keeper'''\n**# Ask ''\"Why is the Cornett of Waves so special?\"'' to discover a bit of the cornett's history, imparting a bit of your own knowledge upon Takano (with an optional, [[History]] 1 + [[Island aumaua]] + [[Deadfire Archipelago]], [[Arcana]] 5 or [[Religion]] 5 check).\n**# Then tell him ''\"The Cornett of Waves is no mere trophy. It deserves a keeper who knows its history.\"''.\n**# Finally, warn him that ''\"Ondra punishes those who refuse to let go\"'' with [[Religion]] 3, otherwise Takano will be reluctant to part with it and you'll have to pay {{cp2|750}}.\n** [[Bluff]] 5 - '''Lie to Takano'''\n**# ''\"I shouldn't say this, but I'm on a mission from the palace. A symbol as important as the cornett would help.\"''\n**# Then pay {{cp2|500}}, or pass either a [[History]] 7 or [[Diplomacy]] 4 check.\n** '''Threaten Takano's life''' - Requires at least [[Intimidate]] 6 to avoid combat, resulting in Moderate Negative reputation with the Huana. Otherwise the other options will start combat with everyone in the estate.\n** '''Hire an assassin''' - [[Rust]], an assassin in [[Delver's Row]] can fetch the artifact for you. He'll ask for {{cp2|800}}, or {{cp2|1000}} if you want to keep Takano alive and a day for him to do the deed. You can use the wait function to skip the time. Curiously, even if you only pay {{cp2|800}} for his services, Takano will still be alive and well at his estate after you fetch the cornett from Rust, and a second Cornett of Waves will still exist in the Takano estate chest. This is probably a bug.\n** [[Cornett of Depths]] - '''Show Takano that you have a special shell too''' - This won't get you anywhere, [[Aloth]] and [[Tekēhu]] will react to this: [[Pride]].\n* Return to Dereo.\n* If you have the [[Cornett of Waves]] in your stash while travelling to or from [[Serpent's Crown]], there's a chance you'll encounter [[Ateira]], and her group of thugs. Ateira is the one Dereo originally hired to retrieve the cornett. She'll want the '''Cornett of Waves''', and will be adamant to fight for it. There's no option to give her the shell without a fight, but you can convince her otherwise with one of the following:\n**[[Diplomacy]] 4, [[Diplomacy]] 6, then [[Bluff]] 3 or reputation [[Rational]] 2 - The cornett is just a worthless shell, and Dereo is just using it to frame someone. Picking any of the other checks will cause her to attack.\n** [[Intimidate]] 4, then [[Intimidate]] 6 - The thugs will make easy pickings. Note that this fails if you have [[Benevolent]] 4 or a paladin of [[The Shieldbearers of St. Elcga]], with one the thugs calling you \"the softest sap in the Deadfire.\"\n** [[Bluff]] 4, then [[Bluff]] 6 - Dereo sent you to tie up some loose ends.\n*** With Positive reputation (2) with the [[Príncipi sen Patrena]], the thugs recognize that you're in with the Príncipi, and that it's likely that Dereo would send you to clean up.\n*** Having reputation [[Honest]] 2 will likewise result in them believing you.\n** Or you could just attack her, and get Minor Positive Reputation with Delver's Row Criminals.\n* Returning to Dereo with the '''Cornett of Waves''' will gain you Minor Positive reputation with Delver's Row Criminals, and {{cp2|300}}. If you encountered Ateira, you can tell him about it to gain further Minor reputation. At this point you can also push him further about his true motives regarding the cornett with [[Intellect]] 12, but to no avail. You're then instructed to take it to the [[Undercroft]] below [[Delver's Row]].\n\n===Cornett of Depths (optional)===\n* If you wish to access the hidden room in Ondra temple, make sure to detour by the [[Old City Overlook]] and grab the [[Cornett of Depths]] from the sunken statue near the center of the area.\n** With [[Perception]] 13, you can hear the calls of the cornett from the pool.\n** With [[Survival]] 6, you'll notice the suspicious bones clustered around the water's edge.\n** This scripted interaction requires a character with at least [[Constitution]] 16 to retrieve the conch unharmed - otherwise the character will become [[Status effects (Deadfire)#Fatigue|Fatigued]].\n** After obtaining the conch, you'll be attacked by a bunch of skeletons.\n\n===Old City Ruins===\n* Find [[Gwenfin]] in the [[Undercroft]] near the entrance to the ancient Huana temple in the northern part, overlooking the bay. With [[Athletics]] 4 you can safely take the skiff shortcut on the main dock. Enter the chamber and inspect the statue. Place the cornett in the statue's hand to open the door. The Temple of Ondra isn't where it should be, so guess who's going to look for it inside? Head deeper into the [[Old City]], north through the ruins. The temple you want is in the northwestern corner of the [[Old City]] proper. Note that while Gwenfin says she is a bruiser, her health is low and she will not fight back if enemies are lured to her so low level parties cannot count on using her for aid. She will die quite rapidly but it does not result in quest failure.\n* Either the [[Cornett of Waves]] or the [[Cornett of Depths]] can open the way to the temple, which is guarded by a [[giant cave grub]]. Killing it is a major challenge, but you can always sneak by and accomplish your objective.\n** The giant grub is tough, with lots of health, and has strong but very slow attacks. It also summons other grubs to assist it. The trick to killing it is having a [[cipher]] cast [[Tenuous Grasp (Deadfire)|Tenuous Grasp]] on it. The giant grub will be charmed, and start killing the other grubs it summoned, reducing your burden. Similarly, the cipher spell [[Pain Block (Deadfire)|Pain Block]] can help healing your frontline during the long fight.\n**If you take out the Grub Burrow in the Northernmost corner either before or shortly after the fight begins no grubs will spawn and you only have to deal with the giant grub.\n* If you obtained both conchs, place them inside the mural to open the secret wall. This leads to a hidden room containing the unique large shield [[Cadhu Scalth]] in the locked and trapped sarcophagus (difficulty 7) on the left, and the unique pollaxe [[Wahai Pōraga]] in the sarcophagus on the right.\n* To complete the quest, inspect the [[Ukaizo]] mosaic at the back of the temple. Sneak around the giant cave grub if you didn't kill it.\n* Return to Gwenfin and then to Dereo to collect your rewards.\n\n=== Collect your rewards ===\n* While talking to Dereo, you can use [[Bluff]] 6 or [[History]] 7 to find out that Ukaizo is sought by the Consuaglo mes Casitas of the Príncipi as a way to provide for themselves, as one of the richest and most fertile lands in the Deadfire. Dereo will dodge the question if you ask with [[Insight]] 4. Uncovering this information allows you to ask for {{cp2|500}} hush money.\n* Dereo will then reward you with the unique blunderbuss [[Kitchen Stove]]. You can push him further and ask for a bonus:\n** [[Streetwise]] 4 or [[Diplomacy]] 4 - An additional {{cp2|200}} and Minor Positive reputation with Delver's Row Criminals.\n** Uncovering Dereo's interest in Ukaizo - An additional {{cp2|500}} and Minor Positive reputation with Delver's Row Criminals.\n* Before leaving, he'll give you [[Príncipi Colors]] - presumably handmade by Dereo himself over the course of the quest, as well as the [[Triumph of Dereo the Lean]], the only triumph not given to you for defeating an enemy ship.\n\n==Gallery==\n<tabber>\nInteraction 1=\n'''Obtaining the Cornett of Depths:'''\n<gallery mode=nolines>\n 06 SI Old City Water 01.png\n 06 SI Old City Water 02.png\n 06 SI Old City Water 03.png\n 06 SI Old City Water 04.png\n 06 SI Old City Water 05.png\n</gallery>\n|-|\nInteraction 2=\n'''Interacting with either of the statues of Ondra:'''\n<gallery mode=nolines>\n 06 SI Old City Statue 01.png\n 06 SI Old City Statue 02.png\n 06 SI Old City Hand 01.png\n 06 SI Old City Hand 02.png\n</gallery>\n|-|\nInteraction 3=\n'''Opening the secret chamber in the Old Temple of Ondra:'''\n<gallery mode=nolines>\n 06 SI Old City Ondra Mural 1.png\n 06 SI Old City Ondra Mural 2.png\n 06 SI Old City Ondra Mural 3.png\n</gallery>\n|-|\n</tabber>\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/06_Neketaka_Slums_District/06_QST_Treasure_Hunt.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"5\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Cornett's Call'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Dereo the Lean</b>, a crime lord in the <b>Gullet</b>, seeks a valuable artifact known as the <b>Cornett of Waves</b>.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| <b>Dereo</b> is looking for a mosaic in the <b>Old City</b>. The cornett will lead me to it.\n|-\n| style=\"vertical-align:text-top\" | 40002\n| A person of influence has taken an interest in me. I've been asked to meet him in the <b>Narrows</b>.\n|-\n| rowspan=\"8\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Get the <b>Cornett of Waves</b> from <b>Takano's villa</b> in Serpent's Crown.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| Dereo asked me to get an artifact called the <b>Cornett of Waves</b> from the Mataru, <b>Takano</b>, who owns it.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| <b>Dereo</b> wants the cornett more badly than he lets on. He said it's valuable, but he didn't elaborate.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| I'm not the first to attempt this job. <b>Dereo</b> originally hired someone else, but she didn't come through.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| <b>Dereo</b> said a related artifact, the <b>Cornett of Depths</b>, was lost when the <b>Old City</b> sank.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| I've hired <b>Rust</b> to acquire the <b>Cornett of Waves</b> for me. The assassin will need a full day to get the job done.\n|-\n| style=\"vertical-align:text-top\" | 20013\n| According to <b>Takano</b>, a similar conch was lost when the <b>Old City</b> sank. Several Ondrites perished alongside it, doomed never to rise unless the shell did.\n|-\n| style=\"vertical-align:text-top\" | 20016\n| <b>Takano</b> isn't especially attached to the <b>Cornett of Waves</b>, and he's short on coin. Perhaps he'd be willing to sell it.\n|-\n| rowspan=\"6\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Meet <b>Gwenfin</b> in the <b>Undercroft</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| <b>Gwenfin</b> waits for me - and the cornett - in the <b>Undercroft</b>, near an ancient, Huana-style door.\n\nDereo told me to reach her via a <b>lift</b> in <b>Delver's Row</b>, which is separate from the Gullet.\n|-\n| style=\"vertical-align:text-top\" | 20015\n| Specifically, the lift is next to <b>Ernezzo's shop</b> in <b>Delver's Row</b>.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| <b>Gwenfin</b> is outside an ancient Huana ruin in the <b>Undercroft</b>, near the fort there.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| <b>Gwenfin</b> thinks I can use the cornett to open a door by the Ondrite statue.\n|-\n| style=\"vertical-align:text-top\" | 20017\n| I've killed <b>Gwenfin</b>. It's up to me to figure out how to use the cornett and get what <b>Dereo</b> wants.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Find a <b>temple of Ondra</b> in the <b>Old City</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| Apparently, the mosaic Dereo's looking for is in an <b>old temple</b> somewhere in the <b>ruins</b>. \n\n<b>Gwenfin</b> asked me to tell her where it is once I find it.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| There's a mural in the <b>Old City</b> ruins depicting two conch shells.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I found a conch inscribed with Ondrite symbols in the <b>Old City</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Report back to <b>Gwenfin</b> at the entrance to the <b>Undercroft</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| I found the temple of Ondra and saw an elaborate mosaic of a place called Ukaizo embedded in the wall. This must be what <b>Dereo</b> was looking for.\n\n<b>Gwenfin</b> waits to hear from me at the passage between the <b>Undercroft</b> and the <b>Old City</b>.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| In the temple, I found a wall carving with two sockets. Each was the right size and shape to fit the cornett.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Return to <b>Dereo</b> in the <b>Narrows</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| Gwenfin is on her way to secure the temple. She asked me to give <b>Dereo</b> the good news.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Meet a mysterious figure in the <b>Narrows</b> of the Gullet.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| A messenger told me that someone important wants to see me. \n\nI was told to head into the <b>Narrows</b>, turn right, turn right again, and go left at the bend, looking for signs of svef use. If I meet resistance, I can say <b>Dereo</b> sent for me.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Return the cornett to <b>Dereo</b> in the <b>Narrows</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| I acquired a conch instrument carved with symbols of Ondra - this seems like the \"cornett\" <b>Dereo</b> wants. \n\nHe's waiting for it in the <b>Narrows</b>, the tunnels that surround the Gullet.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| <b>Ateira</b>, the mercenary <b>Dereo</b> originally hired, ambushed me on the way back from <b>Takano's</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''8'''\n| colspan=\"2\" | '''Return to <b>Dereo</b> in the <b>Narrows</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10008\n| I found the temple of Ondra and saw an elaborate mosaic of a place called <b>Ukaizo</b> embedded in the wall. This must be what <b>Dereo</b> was looking for.\n\nHe promised a reward once I find it.\n|-\n| style=\"vertical-align:text-top\" | 20014\n| In the temple, I found a wall carving with two sockets. Each was the right size and shape to fit the cornett.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''9'''\n| colspan=\"2\" | '''Find the mosaic <b>Dereo</b> seeks in the <b>Old City</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10009\n| Dereo wants me to find a mosaic in the <b>Old City</b>. Now that Gwenfin's gone, I'll have to hope I know it when I see it.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| Dereo was pleased when I told him about the mosaic of Ukaizo. He warned me to keep my findings a secret.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30001\n| Someone critical to this quest has died.\n|}",
  "slug": "theCornettsCall",
  "title": "The Cornett's Call"
}
