{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 The Hanging Sepulchers.png\n| caption_map   = Main area\n| image         = PE2 The Forgotten Mausoleum.png\n| caption       = Mausoleum\n| name          = The Hanging Sepulchers\n| type          = Dungeon\n| description   = \n| exits         =\n| sub_locations = Forgotten Mausoleum\n| merchant      = \n| innkeeper     = \n| inhabitants   = Yseyr the Berathian\n| main_location = The Sacred Stair\n| plants        = \n| expected_level= 6\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_07_temple_district\n| internalname  = AR_0709_Temple_Sepulchers<br/>AR_0707_Temple_Mausoleum\n| guid          = 8b33271a-1cbe-46bc-a564-1fd9942181be<br/>fd13cb9d-ec7d-492d-8ca8-8c1531da9413\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\nAn ancient network of catacombs carved in a time long before [[Neketaka]] was even founded, the catacombs are the ceremonial resting place of ancient and contemporary Huana chieftains, tightly guarded by [[Berath]]'s champions.\n\n==Points of interest==\n* The Hanging Sepulchers can be accessed in two ways: Either by accepting [[Eulogy for the Dead]] or by interacting with the tree near the entrance and using a rope and grappling hook to rappel down.\n* The interior is a fairly confusing maze of tunnels and chambers. You start in the south if entering by way of the main door. Follow the corridor east. The relief at the door has a hidden switch (requires 14 Perception to find) that opens a secret chamber with plenty of loot in the sarcophagus. The pull chain opens the door, allowing you to explore further. The corridor beyond contains one of the risen soldiers that patrol the corridors, with exceptional gear. This gear alone is why this dungeon is best done at a low level, as it truly helps outfit your team for later.\n* Continue past the bend and a trip wire. Once you attack the risen armsman, four more enemies will spawn, making fighting a dangerous proposal. After dispatching them, inspect the torch on the wall to find a hidden switch that opens the nearby chamber with the [[Azure Blade]]. The switch on the wall offers a shortcut to the northeastern part of the map, filled with Darguls. This allows you to shorten the distance and dispatch the dargul shooter without attracting the nearby rotghast. The chamber itself contains the first part of the Eulogy: [[Eulogy to Yseyr - The Vigil]].\n* The central chamber consists of a single platform in the middle surrounded by hanging platforms with buried dead (the sepulchers). Circumnavigate it around the northern end to reach the middle platform. From there, you can head southwest, to reach the entrypoint if you used a rope, and a lever that opens the exit to the Sacred Stair. Farther to the southwest is the Forgotten Mausoleum with a truckload of skeletons and risen in front of it. To the northwest is the final crypt with the last piece of the eulogy, but you need the two other pieces first to know what to say to open the massive doors.\n;Forgotten Mausoleum\n* This small chamber contains the ancient mausoleum with the second part: [[Eulogy to Yseyr - The Gate]]. Loot the place and don't miss [[Effigy's Husk]] above the tomb, in the hidden alcove. Once you pick the tablet up, risen spawn, so pick your battle or just sneak out.\n;Crypt\n* A part of the main chamber. After speaking the names of the people on the other tablets (you'll need to read the tablets first), open the chamber doors to meet [[Yseyr the Berathian]] (be sure to bring [[Aloth]] along). Now, Yseyr is a particularly nasty encounter as a death guard, but you can talk him down, first mentioning that Berath sent you, then using Religion 6 to explain you're not after what he protects or History 6 to appeal to his pride. Religion is a sure-fire way to make him peaceful. The final tablet [[Eulogy to Yseyr - The Sword]] is in the sarcophagus behind Yseyr.\n* If you are a Death Godlike or pass a 20 Perception/8 Religion check, you can persuade him to give you the [[Engoliero do Espirs (quest item)|Engoliero do Espirs]] so that you can keep using it in the name of Berath. You'll have to sworn an oath to return it and you'll receive the sword as a quest item.\n** Alternatively, you may simply pickpocket it from him. On normal difficulty, unscaled, this requires at least 3 [[Sleight of Hand]] (and good enough [[Stealth]] to approach him unnoticed).\n* Note that the sword you receive is a quest item variant of the [[Engoliero do Espirs]]. The actual weapon only becomes available during the quest [[A Dance with Death]].\n\n==Characters==\n* [[Yseyr the Berathian]]\n\n==Loot==\n* [[Azure Blade]]: Hidden room in the south-eastern part of the area.\n* [[Effigy's Husk]]: In the hidden alcove above the tomb in the Mausoleum.\n* {{s3}} [[The Matron's Skull]]: In the northernmost central part of the area, only during the associated [[The Surviving Face's Hunt for the Matron's Skull|quest]].\n\n==Gallery==\n<tabber>\nGallery=\n<gallery mode=nolines widths=200px>\nPE2_Temple_of_Berath_Exterior.png | Building exterior\n</gallery>\n|-|\nInteraction 1=\n'''Main entrance:'''\n<gallery mode=nolines>\n 07 si hs sepulcherdoor 01.png\n</gallery>\n|-|\nInteraction 2=\n'''Exterior entrance (both when descending and ascending):'''\n<gallery mode=nolines>\n 07 si hs sepulcher descent 01 a.png\n 07 si hs sepulcher descent 01 b.png\n 07 si tunnels 01 rope fail.png\n 07 si tunnels 01 rope success.png\n 07 si hs sepulcher descent 01 c.png\n 07 si hs sepulcher descent 01 d.png\n 07 si hs sepulcher descent tunnel down.png\n 07 si hsdescent catacomb.png\n 07 si hs sepulcher descent tunnel up.png\n</gallery>\n|-|\nInteraction 3=\n'''Activating the Lord of Heldengate and Lady of Vigils, respectively:'''\n<gallery mode=nolines>\n 07 si hs yseyrchampion 01.png\n 07 si hs yseyrchampion 02.png\n 07 si hs yseyrchampion 03.png\n 07 si hs yseyrchampion 04.png\n</gallery>\n|-|\n</tabber>",
  "slug": "theHangingSepulchers",
  "title": "The Hanging Sepulchers"
}
