{
  "markdown": "{{DisambigMsg|the [book](/booksAndDocuments/) in {{poe2}}|the book in {{poe1}}|The Iroccian Calendar|the actual calendar|Anni Iroccio}}\n\n'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n##  Description \n\n{{Description |{{#var:description}}}}\n\n##  Acquisition \n\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}\n{{DEFAULTSORT:Iroccian Calendar (Deadfire), The}}",
  "raw": "{{DisambigMsg|the [[Books and documents|book]] in {{poe2}}|the book in {{poe1}}|The Iroccian Calendar|the actual calendar|Anni Iroccio}}\n{{Infobox item poe2\n| name           = The Iroccian Calendar\n| icon           = poe2 book box blue icon.png\n| description    = Anni Iroccio: The New Year\n\nWhile only 150 years old (and of Vailian origin as well), the Iroccian calendar is currently used throughout most of the Dyrwood and the surrounding areas. While the Dyrwood was using the Aedyran calendar until recently, they gave it up in favor of the Iroccian calendar. The transition was easy to get people to make because the Aedyran calendar was hopelessly inaccurate.\n\nIroccio calculated that it takes the planet approximately 334 days to orbit the sun, so he took the nine months from the Aedyran calendar and broke them into sixteen months of twenty days each, with each season consisting of four months. The length of each month corresponds to how long it takes Belafa (one of our moons) to circle the planet. At the end of each season, three days - not part of either season - are set aside for people to celebrate the transitions. Lastly, the final two days of the year - New Year and Mid Year - are used to observe the beginning and midpoint of the year.\n\nTo prevent any confusion for the transition from the old calendar to the new, Iroccio kept the year the same. So, although the calendar has only been in existence for 150 years, it is currently 2823 AI (Anni Iroccio).\n\nIroccio gave the months Vailian names, but in the Dyrwood and surrounding areas, they call them by their translated names.\n\nThe year is broken down in the following way -\n\nNew Year - A day to celebrate the arrival of the new year. Of all the holidays, this one is celebrated by most people around the Dyrwood and the Vailian Republics. Each new year is greeted with a fervent zeal to begin things anew and start with a fresh slate.\n\nWinter Months (Two at the beginning of the year and two at the end)\n\nDeep Winter - Fonivèrno \nLate Winter - Tarivèrno \n\nSpring Dawn (3 days) - Inprima - Used to celebrate the transition of the world, rebirth, and Spring. Eothasian festivals are especially prevalent at this time, or were, prior to the Saint’s War. \n \nSpring Months\n\nEarly Spring - Préprima\nMid Spring - Majprima\nDeep Spring - Fonprima\nLate Spring - Tarprima\n\nSummer Rising (3 days) - Inestu - A period of transition from birth to growth. Many ceremonies designed to usher children into adulthood take place during Summer Rising.\n\nSummer Months (and Mid Year)\n\nEarly Summer - Préëstu\nMid Summer - Majestu\n\nMid Year - A day of reflection and introspection. The year is half over. People who made promises on New Year use Mid Year to assess their progress and renew their oaths.\n\nDeep Summer - Fonestu\nLate Summer - Tarestu\n\nAutumn Falling (3 days) - Inauton - Harvest celebrations happen during Autumn Falling if the crops were particularly bountiful. If the harvest was small, supplication is given to the gods asking for a better harvest the following year.\n\nAutumn Months\n\nEarly Autumn - Préauton\nMid Autumn - Majauton\nDeep Autumn - Fonauton\nLate Autumn - Tarauton\n\nWinter Dusk (3 days) - Inivèrno (ihn-ih-VEHR-no) - Winter Dusk is filled with celebrations of life and vigils for the dead. The world is returning to sleep, plants die, and those still alive raise a toast to another year.\n\nWinter Months\n\nEarly Winter - Préïvèrno (pree-ih-VEHR-no)\nMid Winter - Majivèrno (mahzh-ih-VEHR-no)\n| added_in       = poe2\n| equipment_slot = Unequippable\n| item_type      = Book\n| item_category  = Other item\n| requirements   = \n| is_soulbound   = no\n| is_unique      = \n| value          = 80\n| range          = \n| level1_spells  = \n| level2_spells  = \n| level3_spells  = \n| level4_spells  = \n| level5_spells  =\n| level6_spells  = \n| level7_spells  = \n| level8_spells  = \n| item_bonuses   = \n| enchantments   = \n| rel_quests     = \n| rel_items      = \n| rel_abilities  = \n| rel_talents    = \n| internalname   = \n| location       = * [[Queen's Berth]]: Sold by [[Sanza]] of [[Sanza's Map Emporium]].\n| guid           =\n\n}}\n'''{{Pagename nd}}''' is a {{lc:Book }} in {{poe2}}.\n\n== Description ==\n{{Description |{{#var:description}}}}\n\n== Acquisition ==\n{{#arraymap: {{#var:location}}|;|x|x|\\n}}\n{{DEFAULTSORT:Iroccian Calendar (Deadfire), The}}",
  "slug": "theIroccianCalendarDeadfire",
  "title": "The Iroccian Calendar (Deadfire)"
}
