{
  "markdown": "###### Major Positive reputation with the [Huana](/huana/)\n\n| rewardname2  = Deliver the rubbing to the RDC\n| reward2      = \n| rewardname3  = \n| reward3      =  \n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = Trade Secrets\n| conc         =\n| internalname = FCT_QST_02_Huana_Ruins\n| guid         = ba656a38-983f-4f8b-a4e2-f54f765933fb\n}}\n'''{{PAGENAME}}''' is a [faction quest](/pillarsOfEternityIiDeadfireQuestsFactionQuests/) in {{poe2}}.\n\n## Synopsis\n\n \nPrince Aruihi sent an expedition to investigate Motare o Kōzi, an island once used for shelter and sanctuary in the days of Ukaizo.\n\nAruihi believes the location of lost Ukaizo might be recorded somewhere on the island, but his expedition has not returned. \n\nHe needs someone to learn the fate of the expedition and find the information they sought. The trading companies are doubtless sending their own forces to do the same.\n\n## Walkthrough\n\n* This is a straightforward quest. Acquire the [Huana Chart](/huanaChart/) needed by the prince, then return.\n* To access [Motare o Kōzi](/motareOKozi/), you must first get past the Wahaki tribesmen on the beach at Matekau Landing. The script choices that work are Diplomacy 4 or Intimidate 5, then you must either have Intimidate 7, a Druid class, a Good 3 reputation with the Huana, ''or'' have completed [A Shrewd Proposition](/aShrewdProposition/) and [Cruel Cargo](/cruelCargo/) by siding with the Wahaki.\n* Although not essential to the quest, saving [Baltia](/baltia/) gets you a pure 2-star cannoneer, worth a lot if you plan to sail a galleon or junk. Baltia, a survivor of the second Vailian expedition trapped by a crushing vine, is located to the north-northeast of the arch where you enter the grove.  Saving her requires either a druid or Might 16.  If you have neither, and you might want Baltia later, avoid interacting with her. If she spots you she cries out \"Help! . . . please!\" -- don't let that happen.  You can return later when you have a druid or Might 16 in your party. \n\n###### Healing the grove\n\nThe key to easiest completion of the quest is healing the corrupted grove by healing the three [delemgan](/delemgans/) daughters of [the Rotted Lady](/theRottedLady/), who guards the area, and healing the Rotted Lady herself. A violent course of action gains you nothing substantial for your effort.\n\n*There are three corrupted trees around the grove, each tied to one of the Rotted Lady's daughters: one to the northwest, one to the south-southwest, and one to the east.\n**For the peaceful path, interact with each tree '''without killing''' the enemies around it. Simply stealth up to the tree and interact with it. [Sparkcrackers](/sparkcrackers/) come in handy to distract the guardians of the southernmost tree.\n**You will get a scripted encounter by clicking on the blue field at each tree. You can either use a druid character (e.g. [Tekēhu](/tekehu/)) or the weapon [The Spine of Thicket Green](/theSpineOfThicketGreen/) to drain the corruption from the trees. Or you may destroy the trees, which will make the Rotted Lady hostile.\n**Restoring the trees will make two of the daughters friendly, and they'll promise to help you in confronting their mother.  The third daughter, to the northwest nearest her mother, at first acts angry with you because she felt strong before you healed her, and tells you what her mother will do to you.  But when you approach the Rotted Lady, this daughter also tries to convince her mother to listen to you.\n*After restoring the daughters, you can talk to the Rotted Lady, in the northwestern part of the ruins, by a fourth corrupted tree growing around an adra pillar.\n**You can restore her and the grove if during the initial conversation you ask if it's possible to heal her.\n***If you have The Spine of Thicket Green you'll get the option to offer it as a way to cleanse the grove. She'll refer to it as her cousin's limb, and you get the option to have Tekehu talk to her (though nothing will come of it) which in turn gives you a different set of lines to convince her that she and the grove are corrupted. ''I.e. nothing of conequence, except flavour.''\n**Use Diplomacy 8 or Alchemy 6. \n**She'll claim the grove is green, healthy, full of life, a thing of beauty. Honesty will make her attack, while a Rational or [Lie]Benevolent reply will make her realize that her grove has fallen to corruption.\n**You can offer Tekehu or her cousin, [The Spine of Thicket Green](/theSpineOfThicketGreen/), as help, or offer to restore the adra pillar yourself. Then you start a scripted interaction where you can either destroy the tree or investigate, and heal, the corruption.\n**To heal the tree, you have three alternatives:\n***Whisper to the adra that is at its core and feed it soul essence to restore it.\n***Use the Spine of Thicket Green to drain the corruption.\n***Have a druid whisper to the tree and convince it to give up the corruption within. Here you will have to react to a presence within the tree, either embracing or rejecting the temptation of what the presence offers.\n**After driving the corrupting presence out of the tree, the Rotted Lady will turn into the Green Lady.\n***The Green Lady will bless you with nature's mark, identifying you as an ally of earth and nature.  All remaining creatures in the area become friendly and you can easily explore the rest of the map.\n*There are three souls around the ruins, revealing the fate of the last Vailian expedition and info about the disc. If [Xoti](/xoti/) is in the party, she'll harvest these for her quest, [The Lantern of Gaun](/theLanternOfGaun/), though only one entry will appear in the Journal.\n\n###### Activating the disc\n\n*The ruin in the center contains the ancient Huana map disc containing the information you need for the prince. You can use Mechanics 4 to identify the workings of the mechanism. The inscription gives a rough idea of the machine's function, but you need to find the correct parts to make it work. The parts are to the northeast, in the den of the corrupted tigers, and in the northwest, by the Rotted Lady / Green Lady tree.\n* Once you place the parts, you need to activate the mechanism. You will be given four inscriptions in order of the combination :\n** ''Though their roots grow from Rikuhu's lightless bowels, their yield is a welcome reprieve.'' (koiki fruit)\n** ''Our covenant to safeguard. Those petrified limbs are the health and safety of the Deadfire.'' (luminous adra)\n** ''Ngati gifted her chosen people with dominion over her dark and turbulent kingdom.'' (watershaping)\n** ''Our origin, our destination, our home. Wherever we go, she is the horizon.'' ([Ukaizo](/ukaizo/))\n* The emerging image is not exactly a map, but an index of islands and coordinates organized in relation to each other. You recognize several of the cited locations as containing nothing but open water. Charting a path by this obsolete system would be impossible now.  The word 'Ukaizo' stands out from the other named islands. By choosing the option to take a rubbing, you gain the [Huana Chart](/huanaChart/), which will be instrumental in finding Ukaizo. If you destroy the disc and tell Prince Aruihi, you will suffer a Major reputation loss with the Huana.  There appears to be no reason to destroy the disc; it seems that other factions make no use of it later.\n\n###### Turn in the quest\n\n*When you leave Motare o Kōzi, you will be pursued at sea by [Captain Pai](/captainPai/) of the [Royal Deadfire Company](/royalDeadfireCompany/), who wants the Huana Map for the Rauatai Empire. If he catches you, and you have Good 2 reputation with the RDC, he'll acknowledge you as a peer and will leave you alone. Look for him before you sail; with a fast ship you can slip past and outrun him instead of having a confrontation. Once you get back to [Neketaka](/neketaka/) and turn in the quest to the prince, you will not be bothered by Captain Pai again.\n* Return to [Prince Aruihi](/princeAruihi/) for your reward. You can diplomatically ask for more cash, getting {{cp2|250}} on top of the payout if you have at least Good 2 reputation with the Huana.\n* Plan to return to Motare o Kozi if you still need to save Baltia.\n\n## Notes\n\n* There is an occasional bug when you are carrying [The Spine of Thicket Green](/theSpineOfThicketGreen/) and the options for it fail to appear in the scripted interactions with the daughters' trees. You can try leaving the script, then clicking on the blue field of the tree again.  Or you can change weapon sets and change back again. A third fix is to save and reload and try again.  If none of this works, return to a previous save and go again.\n*  [The Spine of Thicket Green](/theSpineOfThicketGreen/) can be stolen from [The Dark Cupboard](/theDarkCupboard/) with enough stealth, good position, and good timing. (Mechanics is not needed.) There are no further special uses for it after this quest, so if you don't need it as a weapon, sell it.\n\n## Loot\n\n* [Nerian's Ward](/neriansWard/): Found within the Rotten Lady's / Green Lady's tree.\n* [Wooden Spider Figurine](/woodenSpiderFigurine/): Wooden chest to the northwest of that tree.\n* [Lil' Babs](/lilBabs/): Needs rescuing in the southwest.\n* [Rotward Amulet](/rotwardAmulet/)s: One or more scattered across the grove.\n{{-}}\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/XX_Huana_Faction_Questline/FCT_QST_02_Huana_Ruins.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Last Sanctuary'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Prince Aruihi</b> sent an expedition to investigate <b>Motare o Kōzi</b>, an island once used for shelter and sanctuary in the days of <b>Ukaizo</b>.\n\nAruihi believes that the location of lost Ukaizo might be recorded somewhere on the island, but his expedition has not returned. \n\nHe needs someone to learn the fate of the expedition and find the information they sought. The trading companies are doubtless sending their own forces to do the same. \n|-\n| rowspan=\"8\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Travel to the <b>ruins</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Motare o Kōzi</b> is nestled in the <b>Kua o Rikuhu</b> chain of islands, a long journey <b>northeast of Neketaka</b> in the midst of a landmass shaped like a storm.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| A local cartographer discovered this island. <b>Atēpu</b> can be found by a statue of <b>Hylea</b>, west of the throne room of the palace.\n|-\n| style=\"vertical-align:text-top\" | 20026\n| I killed <b>Atēpu</b>. He won't be telling anyone else about <b>Motare o Kōzi</b>.\n|-\n| style=\"vertical-align:text-top\" | 20017\n| According to <b>Atēpu</b>, the <b>Wahaki</b> are fiercely protective of the sanctuary isles.\n|-\n| style=\"vertical-align:text-top\" | 20014\n| <b>Embeta</b> of the <b>Wahaki</b> tribe was the one who warned the prince not to send anyone else to <b>Motare o Kōzi</b>.\n|-\n| style=\"vertical-align:text-top\" | 20025\n| <b>Embeta</b>, a <b>Wahaki</b> warrior, sent the prince a scrap of the expedition leader's garb as a warning.\n|-\n| style=\"vertical-align:text-top\" | 20030\n| A detachment of the <b>Wahaki</b> tribe was guarding <b>Motare o Kōzi</b>. They wouldn't let me pass without a fight.\n|-\n| rowspan=\"12\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Search the ruins of <b>Motare o Kōzi</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| Somewhere among the ancient structures, knowledge of <b>Ukaizo</b> is waiting to be discovered. The deeper jungle and overgrown ruins await.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| The ruins are infested with pŵgra and other unsavory creatures. Whatever lies at the heart of this corruption could be related to my search.\n|-\n| style=\"vertical-align:text-top\" | 20024\n| The <b>pŵgra</b> who guard <b>Motare o Kōzi</b> are protective over their trees. There might be a way to use that to my advantage.\n|-\n| style=\"vertical-align:text-top\" | 20022\n| A very powerful woman commands the corrupted beasts and fauna. She sounds like the root of Motare o Kōzi's problems.\n|-\n| style=\"vertical-align:text-top\" | 20023\n| <b>Baltia</b> didn't seem to think the jungle could be healed. I am not so quick to doubt.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| The soul of a dead Huana expeditioner recalled a golden disc that could be manipulated using a combination of wheels and panels. \n|-\n| style=\"vertical-align:text-top\" | 20011\n| The soul of a dead Vailian explorer referenced a golden wheel hidden in a cave.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| A dead member of the Huana expedition was carrying a large, golden ring when he died. Something very tall looped it around the branch of a gnarled tree. \n|-\n| style=\"vertical-align:text-top\" | 20006\n| It seems the Huana were not the only ones seeking the island. A Vailian expedition landed there soon after, though only <b>Baltia</b> survived to tell of it. Among other things, she recalled an ornate, golden ring taken from the <b>ruins</b> by a member of her crew.\n|-\n| style=\"vertical-align:text-top\" | 20027\n| By removing the corruption from her tree, I transformed a pŵgra back into a <b>delemgan</b>. It's unclear if she's an ally, but at least I have one less potential enemy.\n|-\n| style=\"vertical-align:text-top\" | 20029\n| I restored the <b>Green Lady</b> and earned her gratitude. I'm free to search her treasure cache for anything to might prove useful to me.\n|-\n| rowspan=\"7\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Replace the missing parts of the <b>stone disc</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I've located a <b>stone disc</b> that bears unusual engravings. The disc is missing two parts - without them, I won't be able to make sense of the inscription. The pieces may be somewhere in the <b>ruins of Motare o Kōzi</b>.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| I've found a golden wheel that should fit along the outer circumference of the disc.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I've found an engraved wheel that should fit around the rim of the stone disc. \n|-\n| style=\"vertical-align:text-top\" | 20015\n| Now that I've acquired both wheels, I need to place them on the stone disc.\n|-\n| style=\"vertical-align:text-top\" | 20027\n| By removing the corruption from her tree, I transformed a pŵgra back into a <b>delemgan</b>. It's unclear if she's an ally, but at least I have one less potential enemy.\n|-\n| style=\"vertical-align:text-top\" | 20029\n| I restored the <b>Green Lady</b> and earned her gratitude. I'm free to search her treasure cache for anything to might prove useful to me.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Decode the <b>stone disc</b> on <b>Motare o Kōzi</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| Now that both of the missing wheels are reattached to the stone disc, the meaning of the inscriptions can be deciphered. The engravings on the disc are very old and it might take some effort to interpret them.\n|-\n| style=\"vertical-align:text-top\" | 20021\n| An inscription on the golden disc suggests that knowledge contained in the ruins can unlock its secrets.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Return to <b>Prince Aruihi</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| <b>Prince Aruihi</b> will be interested in my findings. I can find him in Neketaka at the palace in <b>Serpent's Crown</b>.\n|-\n| style=\"vertical-align:text-top\" | 20028\n| I handed the Huana chart over to <b>Captain Pai</b> of the Royal Deadfire Company. Even if the chart turns out to be useless to them, <b>Prince Aruihi</b> won't be happy to hear of my actions.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30000\n| Somebody critical to this quest has been killed\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I reported my findings to the prince and delivered a rubbing of the ancient Huana navigational chart.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I reported my findings to the prince, but I was not able to deliver a copy of the navigational chart. He was less than pleased.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| I lied to the prince about my findings. He does not know that I found anything of value at <b>Motare o Kōzi.</b>\n|}",
  "raw": "{{Infobox quest poe2\n| name         = The Last Sanctuary\n| image        = Icon Motare o Kozi.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Faction quest\n| quest_region = Deadfire - Northeast\n| quest_level  = 8\n| faction      = Huana\n| locations    = Neketaka;Motare o Kōzi\n| main_npcs    = Prince Aruihi\n| companion    = Tekēhu\n| quest_giver  = \n| xp_amount    = 1500\n| xp_type      = Normal\n| xp_level     = 8\n| xp_weights   = 1;1;1;3;5\n| rewardname1  = Deliver the rubbing to the prince\n| reward1      = {{cp2|1700}};Major Positive reputation with the [[Huana]]\n| rewardname2  = Deliver the rubbing to the RDC\n| reward2      = \n| rewardname3  = \n| reward3      =  \n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = Trade Secrets\n| conc         =\n| internalname = FCT_QST_02_Huana_Ruins\n| guid         = ba656a38-983f-4f8b-a4e2-f54f765933fb\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests#Faction quests|faction quest]] in {{poe2}}.\n\n==Synopsis== \nPrince Aruihi sent an expedition to investigate Motare o Kōzi, an island once used for shelter and sanctuary in the days of Ukaizo.\n\nAruihi believes the location of lost Ukaizo might be recorded somewhere on the island, but his expedition has not returned. \n\nHe needs someone to learn the fate of the expedition and find the information they sought. The trading companies are doubtless sending their own forces to do the same.\n\n==Walkthrough==\n\n* This is a straightforward quest. Acquire the [[Huana Chart]] needed by the prince, then return.\n* To access [[Motare o Kōzi]], you must first get past the Wahaki tribesmen on the beach at Matekau Landing. The script choices that work are Diplomacy 4 or Intimidate 5, then you must either have Intimidate 7, a Druid class, a Good 3 reputation with the Huana, ''or'' have completed [[A Shrewd Proposition]] and [[Cruel Cargo]] by siding with the Wahaki.\n* Although not essential to the quest, saving [[Baltia]] gets you a pure 2-star cannoneer, worth a lot if you plan to sail a galleon or junk. Baltia, a survivor of the second Vailian expedition trapped by a crushing vine, is located to the north-northeast of the arch where you enter the grove.  Saving her requires either a druid or Might 16.  If you have neither, and you might want Baltia later, avoid interacting with her. If she spots you she cries out \"Help! . . . please!\" -- don't let that happen.  You can return later when you have a druid or Might 16 in your party. \n\n;Healing the grove\nThe key to easiest completion of the quest is healing the corrupted grove by healing the three [[Delemgans|delemgan]] daughters of [[the Rotted Lady]], who guards the area, and healing the Rotted Lady herself. A violent course of action gains you nothing substantial for your effort.\n\n*There are three corrupted trees around the grove, each tied to one of the Rotted Lady's daughters: one to the northwest, one to the south-southwest, and one to the east.\n**For the peaceful path, interact with each tree '''without killing''' the enemies around it. Simply stealth up to the tree and interact with it. [[Sparkcrackers]] come in handy to distract the guardians of the southernmost tree.\n**You will get a scripted encounter by clicking on the blue field at each tree. You can either use a druid character (e.g. [[Tekēhu]]) or the weapon [[The Spine of Thicket Green]] to drain the corruption from the trees. Or you may destroy the trees, which will make the Rotted Lady hostile.\n**Restoring the trees will make two of the daughters friendly, and they'll promise to help you in confronting their mother.  The third daughter, to the northwest nearest her mother, at first acts angry with you because she felt strong before you healed her, and tells you what her mother will do to you.  But when you approach the Rotted Lady, this daughter also tries to convince her mother to listen to you.\n*After restoring the daughters, you can talk to the Rotted Lady, in the northwestern part of the ruins, by a fourth corrupted tree growing around an adra pillar.\n**You can restore her and the grove if during the initial conversation you ask if it's possible to heal her.\n***If you have The Spine of Thicket Green you'll get the option to offer it as a way to cleanse the grove. She'll refer to it as her cousin's limb, and you get the option to have Tekehu talk to her (though nothing will come of it) which in turn gives you a different set of lines to convince her that she and the grove are corrupted. ''I.e. nothing of conequence, except flavour.''\n**Use Diplomacy 8 or Alchemy 6. \n**She'll claim the grove is green, healthy, full of life, a thing of beauty. Honesty will make her attack, while a Rational or [Lie]Benevolent reply will make her realize that her grove has fallen to corruption.\n**You can offer Tekehu or her cousin, [[The Spine of Thicket Green]], as help, or offer to restore the adra pillar yourself. Then you start a scripted interaction where you can either destroy the tree or investigate, and heal, the corruption.\n**To heal the tree, you have three alternatives:\n***Whisper to the adra that is at its core and feed it soul essence to restore it.\n***Use the Spine of Thicket Green to drain the corruption.\n***Have a druid whisper to the tree and convince it to give up the corruption within. Here you will have to react to a presence within the tree, either embracing or rejecting the temptation of what the presence offers.\n**After driving the corrupting presence out of the tree, the Rotted Lady will turn into the Green Lady.\n***The Green Lady will bless you with nature's mark, identifying you as an ally of earth and nature.  All remaining creatures in the area become friendly and you can easily explore the rest of the map.\n*There are three souls around the ruins, revealing the fate of the last Vailian expedition and info about the disc. If [[Xoti]] is in the party, she'll harvest these for her quest, [[The Lantern of Gaun]], though only one entry will appear in the Journal.\n\n;Activating the disc\n*The ruin in the center contains the ancient Huana map disc containing the information you need for the prince. You can use Mechanics 4 to identify the workings of the mechanism. The inscription gives a rough idea of the machine's function, but you need to find the correct parts to make it work. The parts are to the northeast, in the den of the corrupted tigers, and in the northwest, by the Rotted Lady / Green Lady tree.\n* Once you place the parts, you need to activate the mechanism. You will be given four inscriptions in order of the combination :\n** ''Though their roots grow from Rikuhu's lightless bowels, their yield is a welcome reprieve.'' (koiki fruit)\n** ''Our covenant to safeguard. Those petrified limbs are the health and safety of the Deadfire.'' (luminous adra)\n** ''Ngati gifted her chosen people with dominion over her dark and turbulent kingdom.'' (watershaping)\n** ''Our origin, our destination, our home. Wherever we go, she is the horizon.'' ([[Ukaizo]])\n* The emerging image is not exactly a map, but an index of islands and coordinates organized in relation to each other. You recognize several of the cited locations as containing nothing but open water. Charting a path by this obsolete system would be impossible now.  The word 'Ukaizo' stands out from the other named islands. By choosing the option to take a rubbing, you gain the [[Huana Chart]], which will be instrumental in finding Ukaizo. If you destroy the disc and tell Prince Aruihi, you will suffer a Major reputation loss with the Huana.  There appears to be no reason to destroy the disc; it seems that other factions make no use of it later.\n\n;Turn in the quest\n*When you leave Motare o Kōzi, you will be pursued at sea by [[Captain Pai]] of the [[Royal Deadfire Company]], who wants the Huana Map for the Rauatai Empire. If he catches you, and you have Good 2 reputation with the RDC, he'll acknowledge you as a peer and will leave you alone. Look for him before you sail; with a fast ship you can slip past and outrun him instead of having a confrontation. Once you get back to [[Neketaka]] and turn in the quest to the prince, you will not be bothered by Captain Pai again.\n* Return to [[Prince Aruihi]] for your reward. You can diplomatically ask for more cash, getting {{cp2|250}} on top of the payout if you have at least Good 2 reputation with the Huana.\n* Plan to return to Motare o Kozi if you still need to save Baltia.\n\n==Notes==\n* There is an occasional bug when you are carrying [[The Spine of Thicket Green]] and the options for it fail to appear in the scripted interactions with the daughters' trees. You can try leaving the script, then clicking on the blue field of the tree again.  Or you can change weapon sets and change back again. A third fix is to save and reload and try again.  If none of this works, return to a previous save and go again.\n*  [[The Spine of Thicket Green]] can be stolen from [[The Dark Cupboard]] with enough stealth, good position, and good timing. (Mechanics is not needed.) There are no further special uses for it after this quest, so if you don't need it as a weapon, sell it.\n\n==Loot==\n* [[Nerian's Ward]]: Found within the Rotten Lady's / Green Lady's tree.\n* [[Wooden Spider Figurine]]: Wooden chest to the northwest of that tree.\n* [[Lil' Babs]]: Needs rescuing in the southwest.\n* [[Rotward Amulet]]s: One or more scattered across the grove.\n{{-}}\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/XX_Huana_Faction_Questline/FCT_QST_02_Huana_Ruins.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Last Sanctuary'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Prince Aruihi</b> sent an expedition to investigate <b>Motare o Kōzi</b>, an island once used for shelter and sanctuary in the days of <b>Ukaizo</b>.\n\nAruihi believes that the location of lost Ukaizo might be recorded somewhere on the island, but his expedition has not returned. \n\nHe needs someone to learn the fate of the expedition and find the information they sought. The trading companies are doubtless sending their own forces to do the same. \n|-\n| rowspan=\"8\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Travel to the <b>ruins</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Motare o Kōzi</b> is nestled in the <b>Kua o Rikuhu</b> chain of islands, a long journey <b>northeast of Neketaka</b> in the midst of a landmass shaped like a storm.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| A local cartographer discovered this island. <b>Atēpu</b> can be found by a statue of <b>Hylea</b>, west of the throne room of the palace.\n|-\n| style=\"vertical-align:text-top\" | 20026\n| I killed <b>Atēpu</b>. He won't be telling anyone else about <b>Motare o Kōzi</b>.\n|-\n| style=\"vertical-align:text-top\" | 20017\n| According to <b>Atēpu</b>, the <b>Wahaki</b> are fiercely protective of the sanctuary isles.\n|-\n| style=\"vertical-align:text-top\" | 20014\n| <b>Embeta</b> of the <b>Wahaki</b> tribe was the one who warned the prince not to send anyone else to <b>Motare o Kōzi</b>.\n|-\n| style=\"vertical-align:text-top\" | 20025\n| <b>Embeta</b>, a <b>Wahaki</b> warrior, sent the prince a scrap of the expedition leader's garb as a warning.\n|-\n| style=\"vertical-align:text-top\" | 20030\n| A detachment of the <b>Wahaki</b> tribe was guarding <b>Motare o Kōzi</b>. They wouldn't let me pass without a fight.\n|-\n| rowspan=\"12\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Search the ruins of <b>Motare o Kōzi</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| Somewhere among the ancient structures, knowledge of <b>Ukaizo</b> is waiting to be discovered. The deeper jungle and overgrown ruins await.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| The ruins are infested with pŵgra and other unsavory creatures. Whatever lies at the heart of this corruption could be related to my search.\n|-\n| style=\"vertical-align:text-top\" | 20024\n| The <b>pŵgra</b> who guard <b>Motare o Kōzi</b> are protective over their trees. There might be a way to use that to my advantage.\n|-\n| style=\"vertical-align:text-top\" | 20022\n| A very powerful woman commands the corrupted beasts and fauna. She sounds like the root of Motare o Kōzi's problems.\n|-\n| style=\"vertical-align:text-top\" | 20023\n| <b>Baltia</b> didn't seem to think the jungle could be healed. I am not so quick to doubt.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| The soul of a dead Huana expeditioner recalled a golden disc that could be manipulated using a combination of wheels and panels. \n|-\n| style=\"vertical-align:text-top\" | 20011\n| The soul of a dead Vailian explorer referenced a golden wheel hidden in a cave.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| A dead member of the Huana expedition was carrying a large, golden ring when he died. Something very tall looped it around the branch of a gnarled tree. \n|-\n| style=\"vertical-align:text-top\" | 20006\n| It seems the Huana were not the only ones seeking the island. A Vailian expedition landed there soon after, though only <b>Baltia</b> survived to tell of it. Among other things, she recalled an ornate, golden ring taken from the <b>ruins</b> by a member of her crew.\n|-\n| style=\"vertical-align:text-top\" | 20027\n| By removing the corruption from her tree, I transformed a pŵgra back into a <b>delemgan</b>. It's unclear if she's an ally, but at least I have one less potential enemy.\n|-\n| style=\"vertical-align:text-top\" | 20029\n| I restored the <b>Green Lady</b> and earned her gratitude. I'm free to search her treasure cache for anything to might prove useful to me.\n|-\n| rowspan=\"7\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Replace the missing parts of the <b>stone disc</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I've located a <b>stone disc</b> that bears unusual engravings. The disc is missing two parts - without them, I won't be able to make sense of the inscription. The pieces may be somewhere in the <b>ruins of Motare o Kōzi</b>.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| I've found a golden wheel that should fit along the outer circumference of the disc.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I've found an engraved wheel that should fit around the rim of the stone disc. \n|-\n| style=\"vertical-align:text-top\" | 20015\n| Now that I've acquired both wheels, I need to place them on the stone disc.\n|-\n| style=\"vertical-align:text-top\" | 20027\n| By removing the corruption from her tree, I transformed a pŵgra back into a <b>delemgan</b>. It's unclear if she's an ally, but at least I have one less potential enemy.\n|-\n| style=\"vertical-align:text-top\" | 20029\n| I restored the <b>Green Lady</b> and earned her gratitude. I'm free to search her treasure cache for anything to might prove useful to me.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Decode the <b>stone disc</b> on <b>Motare o Kōzi</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| Now that both of the missing wheels are reattached to the stone disc, the meaning of the inscriptions can be deciphered. The engravings on the disc are very old and it might take some effort to interpret them.\n|-\n| style=\"vertical-align:text-top\" | 20021\n| An inscription on the golden disc suggests that knowledge contained in the ruins can unlock its secrets.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Return to <b>Prince Aruihi</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| <b>Prince Aruihi</b> will be interested in my findings. I can find him in Neketaka at the palace in <b>Serpent's Crown</b>.\n|-\n| style=\"vertical-align:text-top\" | 20028\n| I handed the Huana chart over to <b>Captain Pai</b> of the Royal Deadfire Company. Even if the chart turns out to be useless to them, <b>Prince Aruihi</b> won't be happy to hear of my actions.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30000\n| Somebody critical to this quest has been killed\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I reported my findings to the prince and delivered a rubbing of the ancient Huana navigational chart.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I reported my findings to the prince, but I was not able to deliver a copy of the navigational chart. He was less than pleased.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| I lied to the prince about my findings. He does not know that I found anything of value at <b>Motare o Kōzi.</b>\n|}",
  "slug": "theLastSanctuary",
  "title": "The Last Sanctuary"
}
