{
  "markdown": "Ogne;Gaderian Bosc\n| companion    = Edér\n| quest_giver  = Edér\n| xp_amount    = \n| xp_type      = Normal\n| xp_level     = 9\n| rewardname1  = Fail to stop the Partisans\n| reward1      =  \n| rewardname2  = Save Bearn - Convince him not to drink the poison\n| reward2      = [Edér](/eder/) gains [Candlebearer](/statusEffectsDeadfirePermanentEffects/) (+5 [Will](/will/))\n| rewardname3  = Save Bearn - Resuscitate him after he drinks the poison\n| reward3      = * [Edér](/eder/) gains [Inner Glow](/statusEffectsDeadfirePermanentEffects/) (+1 [Resolve](/resolve/))\n| rewardname4  = Fail to stop Bearn from drinking the poison\n| reward4      = * [Edér](/eder/) gains [Inner Glow](/statusEffectsDeadfirePermanentEffects/) (+1 [Resolve](/resolve/))\n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         =\n| internalname = companion_qst_eder\n| guid         = c4a3128a-e364-4de2-91c2-cf2ba6c7067b\n}}\n'''{{PAGENAME}}''' is a [quest](/pillarsOfEternityIiDeadfireQuests/) in {{poe2}}.\n\n## Synopsis\n\n \nEdér is interested in reconnecting with a woman he used to know who supposedly settled in Deadfire with the Children of the Dawnstars.\n\n## Walkthrough\n\nEdér will ask you to find his former flame, Elafa, who supposedly settled in the Deadfire. Head to the [Temple of Gaun](/templeOfGaun/) in [Neketaka](/neketaka/) and talk to [Nordagand](/nordagand/), who will reveal that she settled near [Hasongo](/hasongo/).\n\n## =Partisans of the Lighted Path\n\n=\n* Complete [A Distant Light](/aDistantLight/) before continuing, which has you exploring every area in Hasongo.\n** When you first arrive in Hasongo, Edér will be concerned with the destruction caused by [Eothas](/eothas/), despite the fact there was a Dawnstar settlement on the island.\n** How you answer his questions affects his feelings on faith, and helps decides his [end-game slides](/pillarsOfEternityIiDeadfireEndingsEdC3A9R/). See [Faith dialogue](/theLightedPathFaithDialogue/).\n* [Bearn](/bearn/) appears at the docks, amongst a group of farmers bowing down to the great, muddy footprints left in Eothas' wake. Talk to him to ask if he's seen or heard about Elafa (his mother), though he doesn't seem to react or show interest.\n* You'll learn that Bearn's father was lost to the Purges, and that his mother died to the flu a few years prior. In the years following, Bearn has now become a follower of the [Partisans of the Lighted Path](/partisansOfTheLightedPath/), a Dawnstars sect/cult led by [Gaderian Bosc](/gaderianBosc/) with some strange militaristic views on Eothas' passing through the Deadfire. The sect encourages its followers to avoid non-believers, friends and family alike. Bearn shows no sadness or grief regarding his mothers death, but is seemingly happy, considering it as a blessing as she is now \"marching beside the Shining God\". Edér is understandably distraught to learn of her death, that Elafa's own son didn't recognize her description, and that the closest link to Elafa is more concerned with following Bosc than upholding her memory. Before you leave, Edér asks where he can meet this \"Bosc\".\n* Bearn then points you to [Ogne](/ogneDeadfire/) who initiates new Partisans at the [Temple of Eothas](/templeOfGaun/) in Neketaka, where they often gather.\n* Talk to Edér to get his thoughts. He's upset that Bearn has turned into someone who is nothing like his mother or father, someone who's seemingly been talked out of their own personality. Despite this, he thinks that it's a matter of circumstance, as he's alone in the Deadfire and perhaps he needed someone to replace the void left from his parents' deaths.\n\n## =The Vanguard\n\n=\n* Head to the [Temple of Gaun](/templeOfGaun/) and talk to Ogne. She'll tell you that the cult indeed intends to follow Eothas by boat, and as suicidal as that is, she believes that their followers must be willing to make the ultimate sacrifice. You learn that there is a sub-group of the Partisans, the Vanguards, led by Gaderian Bosc himself, and will be \"...the first to join the ranks of Eothas, the first to charge at his call.\" Edér recognizes that Bearn said something about the Vanguard, and thinks that he might be looking to join them - which indeed he is.\n* Keen on tracking down Bosc, you can convince Ogne to allow you to join the Vanguards with [Bluff](/bluff/) 7, [Diplomacy](/diplomacy/) 7, [Religion](/religion/) 7, or as a Priest of Eothas.\n** If you pass the check, she says that it's too late to join the vanguard, but she'll tell you that their ship is docked in Neketaka and is set to depart at any moment.\n** If you don't, Edér will be honest and tell Ogne that he's concerned about Bearn being unable to truely understand what he's doing - to no avail. Upon travelling from The Sacred Stair, you'll come across Ogne again, this time with a few Partisans with her, adamant to stop you from attempting to \"corrupt\" the members of the Partisans. A fight ensues, after which you'll be pointed in the direction of the ship.\n* Head to the docks at [Queen's Berth](/queensBerth/). Unfortunately, you're too late and the ship has left port. Deflated, but determined to reach Bearn, Edér asks you to promise him that you'll chase after him as soon as possible (if you deny him entirely, the quest will fail and Edér will leave the party permanently).\n[thumb](/filePe2TheLightedPathShipDeckPng/)\n* At this point you'll have to chase down the vanguards, in a Children of the Dawnstars sloop ''[Eothas' Vanguard](/eothasVanguard/)'' as it heads north out of Neketaka towards Eothas. They travel relatively slowly, so catching up is no issue. The ship starts a small distance east of [Neketaka Island](/neketakaIsland/), heads directly north towards [Magran's Teeth](/magransTeeth/), travelling northwest along the coast up to [Razai Passage](/razaiPassage/), then southeast to [The Burning Shoals](/theBurningShoals/), anchoring at a point along the route.\n** You don't have to leave port immediately, and can spend up to 8 days in Neketaka after speaking with [Ogne](/ogne/) at the temple before the Partisans reach their destination.\n** The ship will only start moving once you leave port, and will always start in the same position assuming the 8 days isn't up. The remainder of the 8 days (from when the player enters the world map) is how long the ship spends travelling its route, meaning that the ship will not always stop in the same position, depending on how much time you spend on dry land.\n** The exact coordinates are listed on the page [Eothas' Vanguard](/eothasVanguard/), and is a looping route (though one that cannot be completed in under 8 days). Given the average amount of time it takes for a player to leave Neketaka from the Temple of Gaun, the ship typically stops somewhere between Razai Passage and the Magran's Teeth label on the world map.\n** Note that if you enter another location on the world map after leaving Neketaka, the partisans' route will reset (though the timer will not), and they will start over from Neketaka.\n* If you are too slow, and get to the ship after they anchor, you'll find that the Partisans have already taken their own lives. After you head belowdecks, you discover Bearn, already dead, along with the bodies of Bosc and the rest of the Partisans.\n* If you get to the ship before they anchor, you'll have to fight the Partisans on deck. Once they're dead, head belowdecks. Gaderian Bosc is mid-sentence, coaxing a hesitant, nervous Bearn into drinking the poison vial which hangs from his neck. Edér quickly intervenes, resulting in a rather tense standoff involving a number of checks in order to convince Bearn not to give in to Bosc. This requires you to pass 3 checks (over 5 checks) before Bearn gives in. If you fail 3 checks, or do not manage to pass 3 checks in time, Bearn will proceed to drink the vial.\n** [Bluff](/bluff/) 7, [Diplomacy](/diplomacy/) 7 or [Insight](/insight/) 7.\n** [Metaphysics](/metaphysics/) 7, [Religion](/religion/) 7, [Diplomacy](/diplomacy/) 8, or Priest of Eothas .\n** [Resolve](/resolve/) 14, [Intellect](/intellect/) 14, or Philosopher.\n** [Intimidate](/intimidate/) 6, Priest of Eothas, Mercenary or [Perception](/perception/) 14.\n** Ask your party for some helping words, [Aloth](/aloth/) has some particularly inspirational dialogue here. This always counts as a success.\n* If all else fails, he will proceed to drink the vial - but you still have a chance to save him, if you're quick:\n** [Survival](/survival/) 6, followed by Survival 6: Induce vomiting.\n** [Alchemy](/alchemy/) 6\n** [Alchemy](/alchemy/) 4 (with [Taru Turu Chew](/taruTuruChew/) and [Ripple Sponge](/rippleSponge/)): Craft an antidote that can help mitigate the poisons absorption and counteract some of its effects.\n** As a [Priest](/priest/) you can plea for divine intervention.\n\n## =Endings\n\n=\n\n######  If you save Bearn\n\n<!-- n_bearn_fate 2 -->\n* If you manage to resuscitate Bearn after he drinks the poison, he'll be upset and confused that he's still living even though he had made the choice to sacrifice himself. His beliefs will not change.\n<!-- n_bearn_fate 3 -->\n* If you successfully convince Bearn to drop the vial, Bearn will be left shocked at what he was about to do - however he still feels he has wronged Eothas. His beliefs will eventually change.\n* After the ordeal, Edér feels that the most appropriate thing to do would be to take him back to Hasongo. Upon returning, Bearn is lost and confused - wondering what to say to Eothas when he meets him one day. Edér explains that it is Eothas who owes him an explanation, not the other way around - ending the quest.\n\n###### If you cannot save Bearn:\n\n<!-- n_bearn_fate <2 -->\n* Bearn dies and Edér is left wondering; were the Partisans the creation of a raving madman, or a divine plan from Eothas himself?\n\n## =Rewards\n\n=\n* If Bearn consumed the poison and was resuscitated, or if he consumes the poison and dies, Edér will gain the boon [Inner Glow](/statusEffectsDeadfirePermanentEffects/), giving him a permanent +1 [Resolve](/resolve/).\n* If Edér successfully talks him out of drinking the poison, Edér will instead gain the boon [Candlebearer](/statusEffectsDeadfirePermanentEffects/), giving him a permanent +5 Will.\n\n## Faith dialogue\n\nThese conversations will influence Edér's feelings of faith, which affects his [endings](/ederTeylecgDeadfireEndings/).\n<!-- variable is n_eder_p2_arc -->\n<div style=\"width:100%;max-width:700px;\">\n{| class=\"wikitable\" style=\"width:100%;\"\n|-\n! colspan=\"2\" | After arriving in [Hasongo](/hasongo/) during [A Distant Light](/aDistantLight/).\n|-\n| <b>\"I don't get this at all. There was a Dawnstar settlement on Hasongo. Place got trampled all the same.\"</b> || style=\"width:50px; | <small>Faith</small>\n|-\n| &nbsp;&nbsp; → \"It doesn't seem to matter who he hurts, he does as he pleases.\" || -1\n|-\n| &nbsp;&nbsp; → \"What he's doing must be so important that he was willing to sacrifice his own.\" || 1\n|-\n| &nbsp;&nbsp; → \"This is a vile betrayal.\" || -1\n|-\n| &nbsp;&nbsp; → \"I would hear it from him before passing judgment.\" || 1\n|}\n{| class=\"wikitable\" style=\"width:100%;\"\n! colspan=\"2\" | After reviving Bearn if he drinks the poison.\n|-\n| <b>\"Why-why am I still here?\"</b> || style=\"width:50px; | <small>Faith</small>\n|-\n| &nbsp;&nbsp; → \"Whatever Eothas had in store, it was cold and destructive. It wasn't for you.\" || -2 \n|-\n| &nbsp;&nbsp; → \"Eothas' cause may have been worth joining. But you're too young to make that choice.\" || 2\n|-\n| &nbsp;&nbsp; → \"You were conflicted. Eothas deserves soldiers who are sure of themselves.\" || 2 \n|-\n| &nbsp;&nbsp; → \"We saved you, ungrateful child.\" ||\n|-\n|}\n{| class=\"wikitable\" style=\"width:100%;\"\n! colspan=\"2\" | If Bearn dies.\n|-\n| <b>\"What was this?\"</b> || style=\"width:50px; | <small>Faith</small>\n|-\n| &nbsp;&nbsp; → \"He gave his life for something he believed in.\" || -1 \n|-\n| &nbsp;&nbsp; → \"He was the victim of a madman.\" || -1\n|-\n| &nbsp;&nbsp; → \"Eothas used him.\" || -1 \n|-\n| &nbsp;&nbsp; → \"Maybe he really is going to help Eothas achieve something worthwhile.\" || 1\n|-\n|}\n</div>\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/Companions/companion_qst_eder.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Lighted Path'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Edér</b> is interested in reconnecting with a woman he used to know who supposedly settled in <b>Deadfire</b> with the <b>Children of the Dawnstars</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Find someone who might know <b>Edér's</b> friend.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| It is likely that someone in the <b>Children of the Dawnstars</b> knows her.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| I was told to speak with a Dawnstar elder named <b>Nordagand</b> at the <b>Temple of Gaun</b> in Neketaka.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Look for <b>Elafa</b> in <b>Hasongo</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| A Dawnstar we met seemed to think <b>Elafa</b> had settled on <b>Hasongo</b> with her son.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Investigate the <b>Partisans of the Lighted Path</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| We met Elafa's son <b>Bearn</b> and learned that Elafa had passed away some time ago. \n\nHe seems to have fallen in with a Dawnstar sect called the <b>Partisans of the Lighted Path</b>, led by a man named <b>Gaderian Bosc</b>, who have some unusual, militaristic views about Eothas' passage through Deadfire.\n\nDespite the news of Elafa, <b>Edér</b> seems concerned now for her son, and wants to investigate this sect.\n\nBearn referred us to a woman named <b>Ogne</b> in the <b>Temple of Gaun</b> in Neketaka, who recruits new members to the Lighted Path.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| <b>Ogne</b> was carrying some crumpled documents. They may be of interest.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Get to the \"vanguard\" ship.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| It became clear in speaking with Ogne that the Partisans of the Lighted Path intend to join Eothas by dying in close proximity to him.\n\n<b>Bearn</b> said he intended to be in their vanguard - the first wave to join Eothas. Their ship is docked in Neketaka.\n\nWe have to get there before it departs.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| Documents Ogne was carrying seem to suggest that the <b>Partisans of the Lighted Path</b> might intend to join Eothas by dying in close proximity to him.\n\n<b>Bearn</b> said he intended to be in their vanguard - the first wave to join Eothas. Their ship was most recently docked in <b>Neketaka</b>.\n\nWe have to get there before it departs.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Pursue the Lighted Path ship.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| We were too late to board the Lighted Path ship while it was docked in Neketaka.\n\nI've promised <b>Edér</b> that we will chase down the ship and rescue <b>Bearn</b> if he's aboard. \n\nThey are tracking <b>Eothas</b> - surely they will head north and follow his path of destruction.\n\nGiven their intentions, time is of the essence.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Rescue <b>Bearn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| I need to find <b>Bearn</b> and get him off of the ship before it's too late.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''14'''\n| colspan=\"2\" | '''Return <b>Bearn</b> to <b>Hasongo</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10014\n| After <b>Bearn's</b> ordeal, <b>Edér</b> feels that the most appropriate thing to do for him at this point would be to take him back to <b>Hasongo</b>.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| We were able to convince Bearn not to drink the poison that the other members of his sect took. He's survived the ordeal, though he doesn't appear to be convinced it was for the best.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| Bearn consumed poison in front of us, but we were fortunately able to resuscitate him. He's survived the ordeal, though he doesn't appear to be convinced it was for the best.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| We were unable to stop Bearn from taking his own life with the rest of the members of the Partisans of the Lighted Path.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30003\n| Someone critical to the completion of this quest has been killed.\n|}",
  "raw": "{{Infobox quest poe2\n| name         = The Lighted Path\n| image        = PE2 The Lighted Path.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Companion quest\n| quest_region = Unknown\n| quest_level  = -\n| faction      = \n| locations    = The Sacred Stair;Temple of Gaun;Hasongo;Queen's Berth;Deadfire Archipelago\n| main_npcs    = Edér;Nordagand;Bearn;Ogne (Deadfire){{!}}Ogne;Gaderian Bosc\n| companion    = Edér\n| quest_giver  = Edér\n| xp_amount    = \n| xp_type      = Normal\n| xp_level     = 9\n| rewardname1  = Fail to stop the Partisans\n| reward1      =  \n| rewardname2  = Save Bearn - Convince him not to drink the poison\n| reward2      = [[Edér]] gains [[Status effects (Deadfire)#Permanent effects|Candlebearer]] (+5 [[Will]])\n| rewardname3  = Save Bearn - Resuscitate him after he drinks the poison\n| reward3      = * [[Edér]] gains [[Status effects (Deadfire)#Permanent effects|Inner Glow]] (+1 [[Resolve]])\n| rewardname4  = Fail to stop Bearn from drinking the poison\n| reward4      = * [[Edér]] gains [[Status effects (Deadfire)#Permanent effects|Inner Glow]] (+1 [[Resolve]])\n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         =\n| internalname = companion_qst_eder\n| guid         = c4a3128a-e364-4de2-91c2-cf2ba6c7067b\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests|quest]] in {{poe2}}.\n\n==Synopsis== \nEdér is interested in reconnecting with a woman he used to know who supposedly settled in Deadfire with the Children of the Dawnstars.\n\n==Walkthrough==\nEdér will ask you to find his former flame, Elafa, who supposedly settled in the Deadfire. Head to the [[Temple of Gaun]] in [[Neketaka]] and talk to [[Nordagand]], who will reveal that she settled near [[Hasongo]].\n\n===Partisans of the Lighted Path===\n* Complete [[A Distant Light]] before continuing, which has you exploring every area in Hasongo.\n** When you first arrive in Hasongo, Edér will be concerned with the destruction caused by [[Eothas]], despite the fact there was a Dawnstar settlement on the island.\n** How you answer his questions affects his feelings on faith, and helps decides his [[Pillars_of_Eternity_II:_Deadfire_endings#Ed.C3.A9r|end-game slides]]. See [[The_Lighted_Path#Faith dialogue|Faith dialogue]].\n* [[Bearn]] appears at the docks, amongst a group of farmers bowing down to the great, muddy footprints left in Eothas' wake. Talk to him to ask if he's seen or heard about Elafa (his mother), though he doesn't seem to react or show interest.\n* You'll learn that Bearn's father was lost to the Purges, and that his mother died to the flu a few years prior. In the years following, Bearn has now become a follower of the [[Partisans of the Lighted Path]], a Dawnstars sect/cult led by [[Gaderian Bosc]] with some strange militaristic views on Eothas' passing through the Deadfire. The sect encourages its followers to avoid non-believers, friends and family alike. Bearn shows no sadness or grief regarding his mothers death, but is seemingly happy, considering it as a blessing as she is now \"marching beside the Shining God\". Edér is understandably distraught to learn of her death, that Elafa's own son didn't recognize her description, and that the closest link to Elafa is more concerned with following Bosc than upholding her memory. Before you leave, Edér asks where he can meet this \"Bosc\".\n* Bearn then points you to [[Ogne (Deadfire)|Ogne]] who initiates new Partisans at the [[Temple of Gaun|Temple of Eothas]] in Neketaka, where they often gather.\n* Talk to Edér to get his thoughts. He's upset that Bearn has turned into someone who is nothing like his mother or father, someone who's seemingly been talked out of their own personality. Despite this, he thinks that it's a matter of circumstance, as he's alone in the Deadfire and perhaps he needed someone to replace the void left from his parents' deaths.\n\n===The Vanguard===\n* Head to the [[Temple of Gaun]] and talk to Ogne. She'll tell you that the cult indeed intends to follow Eothas by boat, and as suicidal as that is, she believes that their followers must be willing to make the ultimate sacrifice. You learn that there is a sub-group of the Partisans, the Vanguards, led by Gaderian Bosc himself, and will be \"...the first to join the ranks of Eothas, the first to charge at his call.\" Edér recognizes that Bearn said something about the Vanguard, and thinks that he might be looking to join them - which indeed he is.\n* Keen on tracking down Bosc, you can convince Ogne to allow you to join the Vanguards with [[Bluff]] 7, [[Diplomacy]] 7, [[Religion]] 7, or as a Priest of Eothas.\n** If you pass the check, she says that it's too late to join the vanguard, but she'll tell you that their ship is docked in Neketaka and is set to depart at any moment.\n** If you don't, Edér will be honest and tell Ogne that he's concerned about Bearn being unable to truely understand what he's doing - to no avail. Upon travelling from The Sacred Stair, you'll come across Ogne again, this time with a few Partisans with her, adamant to stop you from attempting to \"corrupt\" the members of the Partisans. A fight ensues, after which you'll be pointed in the direction of the ship.\n* Head to the docks at [[Queen's Berth]]. Unfortunately, you're too late and the ship has left port. Deflated, but determined to reach Bearn, Edér asks you to promise him that you'll chase after him as soon as possible (if you deny him entirely, the quest will fail and Edér will leave the party permanently).\n[[File:PE2 The Lighted Path Ship Deck.png|thumb|right|Partisans on the deck of their ship]]\n* At this point you'll have to chase down the vanguards, in a Children of the Dawnstars sloop ''[[Eothas' Vanguard]]'' as it heads north out of Neketaka towards Eothas. They travel relatively slowly, so catching up is no issue. The ship starts a small distance east of [[Neketaka Island]], heads directly north towards [[Magran's Teeth]], travelling northwest along the coast up to [[Razai Passage]], then southeast to [[The Burning Shoals]], anchoring at a point along the route.\n** You don't have to leave port immediately, and can spend up to 8 days in Neketaka after speaking with [[Ogne]] at the temple before the Partisans reach their destination.\n** The ship will only start moving once you leave port, and will always start in the same position assuming the 8 days isn't up. The remainder of the 8 days (from when the player enters the world map) is how long the ship spends travelling its route, meaning that the ship will not always stop in the same position, depending on how much time you spend on dry land.\n** The exact coordinates are listed on the page [[Eothas' Vanguard]], and is a looping route (though one that cannot be completed in under 8 days). Given the average amount of time it takes for a player to leave Neketaka from the Temple of Gaun, the ship typically stops somewhere between Razai Passage and the Magran's Teeth label on the world map.\n** Note that if you enter another location on the world map after leaving Neketaka, the partisans' route will reset (though the timer will not), and they will start over from Neketaka.\n* If you are too slow, and get to the ship after they anchor, you'll find that the Partisans have already taken their own lives. After you head belowdecks, you discover Bearn, already dead, along with the bodies of Bosc and the rest of the Partisans.\n* If you get to the ship before they anchor, you'll have to fight the Partisans on deck. Once they're dead, head belowdecks. Gaderian Bosc is mid-sentence, coaxing a hesitant, nervous Bearn into drinking the poison vial which hangs from his neck. Edér quickly intervenes, resulting in a rather tense standoff involving a number of checks in order to convince Bearn not to give in to Bosc. This requires you to pass 3 checks (over 5 checks) before Bearn gives in. If you fail 3 checks, or do not manage to pass 3 checks in time, Bearn will proceed to drink the vial.\n** [[Bluff]] 7, [[Diplomacy]] 7 or [[Insight]] 7.\n** [[Metaphysics]] 7, [[Religion]] 7, [[Diplomacy]] 8, or Priest of Eothas .\n** [[Resolve]] 14, [[Intellect]] 14, or Philosopher.\n** [[Intimidate]] 6, Priest of Eothas, Mercenary or [[Perception]] 14.\n** Ask your party for some helping words, [[Aloth]] has some particularly inspirational dialogue here. This always counts as a success.\n* If all else fails, he will proceed to drink the vial - but you still have a chance to save him, if you're quick:\n** [[Survival]] 6, followed by Survival 6: Induce vomiting.\n** [[Alchemy]] 6\n** [[Alchemy]] 4 (with [[Taru Turu Chew]] and [[Ripple Sponge]]): Craft an antidote that can help mitigate the poisons absorption and counteract some of its effects.\n** As a [[Priest]] you can plea for divine intervention.\n\n===Endings===\n; If you save Bearn\n<!-- n_bearn_fate 2 -->\n* If you manage to resuscitate Bearn after he drinks the poison, he'll be upset and confused that he's still living even though he had made the choice to sacrifice himself. His beliefs will not change.\n<!-- n_bearn_fate 3 -->\n* If you successfully convince Bearn to drop the vial, Bearn will be left shocked at what he was about to do - however he still feels he has wronged Eothas. His beliefs will eventually change.\n* After the ordeal, Edér feels that the most appropriate thing to do would be to take him back to Hasongo. Upon returning, Bearn is lost and confused - wondering what to say to Eothas when he meets him one day. Edér explains that it is Eothas who owes him an explanation, not the other way around - ending the quest.\n;If you cannot save Bearn:\n<!-- n_bearn_fate <2 -->\n* Bearn dies and Edér is left wondering; were the Partisans the creation of a raving madman, or a divine plan from Eothas himself?\n\n===Rewards===\n* If Bearn consumed the poison and was resuscitated, or if he consumes the poison and dies, Edér will gain the boon [[Status effects (Deadfire)#Permanent effects|Inner Glow]], giving him a permanent +1 [[Resolve]].\n* If Edér successfully talks him out of drinking the poison, Edér will instead gain the boon [[Status effects (Deadfire)#Permanent effects|Candlebearer]], giving him a permanent +5 Will.\n\n==Faith dialogue==\nThese conversations will influence Edér's feelings of faith, which affects his [[Edér_Teylecg#Deadfire_endings|endings]].\n<!-- variable is n_eder_p2_arc -->\n<div style=\"width:100%;max-width:700px;\">\n{| class=\"wikitable\" style=\"width:100%;\"\n|-\n! colspan=\"2\" | After arriving in [[Hasongo]] during [[A Distant Light]].\n|-\n| <b>\"I don't get this at all. There was a Dawnstar settlement on Hasongo. Place got trampled all the same.\"</b> || style=\"width:50px; | <small>Faith</small>\n|-\n| &nbsp;&nbsp; → \"It doesn't seem to matter who he hurts, he does as he pleases.\" || -1\n|-\n| &nbsp;&nbsp; → \"What he's doing must be so important that he was willing to sacrifice his own.\" || 1\n|-\n| &nbsp;&nbsp; → \"This is a vile betrayal.\" || -1\n|-\n| &nbsp;&nbsp; → \"I would hear it from him before passing judgment.\" || 1\n|}\n{| class=\"wikitable\" style=\"width:100%;\"\n! colspan=\"2\" | After reviving Bearn if he drinks the poison.\n|-\n| <b>\"Why-why am I still here?\"</b> || style=\"width:50px; | <small>Faith</small>\n|-\n| &nbsp;&nbsp; → \"Whatever Eothas had in store, it was cold and destructive. It wasn't for you.\" || -2 \n|-\n| &nbsp;&nbsp; → \"Eothas' cause may have been worth joining. But you're too young to make that choice.\" || 2\n|-\n| &nbsp;&nbsp; → \"You were conflicted. Eothas deserves soldiers who are sure of themselves.\" || 2 \n|-\n| &nbsp;&nbsp; → \"We saved you, ungrateful child.\" ||\n|-\n|}\n{| class=\"wikitable\" style=\"width:100%;\"\n! colspan=\"2\" | If Bearn dies.\n|-\n| <b>\"What was this?\"</b> || style=\"width:50px; | <small>Faith</small>\n|-\n| &nbsp;&nbsp; → \"He gave his life for something he believed in.\" || -1 \n|-\n| &nbsp;&nbsp; → \"He was the victim of a madman.\" || -1\n|-\n| &nbsp;&nbsp; → \"Eothas used him.\" || -1 \n|-\n| &nbsp;&nbsp; → \"Maybe he really is going to help Eothas achieve something worthwhile.\" || 1\n|-\n|}\n</div>\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/Companions/companion_qst_eder.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Lighted Path'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Edér</b> is interested in reconnecting with a woman he used to know who supposedly settled in <b>Deadfire</b> with the <b>Children of the Dawnstars</b>.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Find someone who might know <b>Edér's</b> friend.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| It is likely that someone in the <b>Children of the Dawnstars</b> knows her.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| I was told to speak with a Dawnstar elder named <b>Nordagand</b> at the <b>Temple of Gaun</b> in Neketaka.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Look for <b>Elafa</b> in <b>Hasongo</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| A Dawnstar we met seemed to think <b>Elafa</b> had settled on <b>Hasongo</b> with her son.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Investigate the <b>Partisans of the Lighted Path</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| We met Elafa's son <b>Bearn</b> and learned that Elafa had passed away some time ago. \n\nHe seems to have fallen in with a Dawnstar sect called the <b>Partisans of the Lighted Path</b>, led by a man named <b>Gaderian Bosc</b>, who have some unusual, militaristic views about Eothas' passage through Deadfire.\n\nDespite the news of Elafa, <b>Edér</b> seems concerned now for her son, and wants to investigate this sect.\n\nBearn referred us to a woman named <b>Ogne</b> in the <b>Temple of Gaun</b> in Neketaka, who recruits new members to the Lighted Path.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| <b>Ogne</b> was carrying some crumpled documents. They may be of interest.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Get to the \"vanguard\" ship.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| It became clear in speaking with Ogne that the Partisans of the Lighted Path intend to join Eothas by dying in close proximity to him.\n\n<b>Bearn</b> said he intended to be in their vanguard - the first wave to join Eothas. Their ship is docked in Neketaka.\n\nWe have to get there before it departs.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| Documents Ogne was carrying seem to suggest that the <b>Partisans of the Lighted Path</b> might intend to join Eothas by dying in close proximity to him.\n\n<b>Bearn</b> said he intended to be in their vanguard - the first wave to join Eothas. Their ship was most recently docked in <b>Neketaka</b>.\n\nWe have to get there before it departs.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Pursue the Lighted Path ship.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| We were too late to board the Lighted Path ship while it was docked in Neketaka.\n\nI've promised <b>Edér</b> that we will chase down the ship and rescue <b>Bearn</b> if he's aboard. \n\nThey are tracking <b>Eothas</b> - surely they will head north and follow his path of destruction.\n\nGiven their intentions, time is of the essence.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Rescue <b>Bearn</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| I need to find <b>Bearn</b> and get him off of the ship before it's too late.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''14'''\n| colspan=\"2\" | '''Return <b>Bearn</b> to <b>Hasongo</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10014\n| After <b>Bearn's</b> ordeal, <b>Edér</b> feels that the most appropriate thing to do for him at this point would be to take him back to <b>Hasongo</b>.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| We were able to convince Bearn not to drink the poison that the other members of his sect took. He's survived the ordeal, though he doesn't appear to be convinced it was for the best.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| Bearn consumed poison in front of us, but we were fortunately able to resuscitate him. He's survived the ordeal, though he doesn't appear to be convinced it was for the best.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| We were unable to stop Bearn from taking his own life with the rest of the members of the Partisans of the Lighted Path.\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30003\n| Someone critical to the completion of this quest has been killed.\n|}",
  "slug": "theLightedPath",
  "title": "The Lighted Path"
}
