{
  "markdown": "| image        = PE2 Giacolo.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Companion quest\n| quest_region = Unknown\n| quest_level  = -\n| faction      = \n| locations    = The Sacred Stair;Spire of the Soul-Seers;The Gullet;The Hole;Delver's Row;Lifter's Refuge;Dunnage House\n| main_npcs    = Pallegina;Giacolo;Flaune Elette;Fyrna;Imuani;Li'l Woody;Captain Tatzatl\n| companion    = Pallegina\n| quest_giver  = Pallegina\n| xp_amount    = \n| xp_type      = Normal\n| xp_level     = 9\n| xp_weights   = 1;1;1;1;1\n| rewardname1  = Save Giacolo\n| reward1      = [Heart-Chime Amulet](/heartChimeAmulet/)\n| rewardname2  = Let Giacolo die\n| reward2      = Quest fails;[Pallegina](/pallegina/) leaves party permanently\n| rewardname3  = \n| reward3      =  \n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         =\n| internalname = companion_qst_pallegina\n| guid         = 9514db69-daf0-4243-b814-8141f1ad10bb\n}}\n'''{{PAGENAME}}''' is a [quest](/pillarsOfEternityIiDeadfireQuests/) in {{poe2}}.\n\n## Synopsis\n\n[Pallegina](/palleginaMesRei/) wants the Watcher to help her find an animancer from her past named [Giacolo](/giacolo/). She believes that Giacolo is working with animancers at the Spire of the Soul-Seers in the Sacred Stair. \n\nThis is Pallegina's companion questline.\n\n## Walkthrough\n\n* Upon entering [The Sacred Stair](/theSacredStair/) with Pallegina in the party, head to the [Spire of the Soul-Seers](/spireOfTheSoulSeers/). When you are near its entrance, she asks for a moment of your time. She wishes to see a former acquaintance of hers, [Giacolo](/giacolo/) - an animancer, so that she may thank him. Pallegina believes that he is currently working with the other animancers at the Spire of the Soul-Seers.\n* [Eder](/eder/) (or [Aloth](/aloth/)) questions this new-found sentimental side of Pallegina. You learn that Giacolo visited her at the acadamy when she was a child, as part of his study of godlike. Giacolo explained to Pallegina that all godlike have a unique chime within their soul that defines who they are. After threatening suicide if he didn't remove the chime, Giacolo said he would try. Though he was unable to fully remove it, he did manage to sever it - which reverted much of the bird-like changes to Pallegina's body and allowed her to achieve some normalcy and identity among the brotherhood, after years of being some ''thing'' to be paraded around, who's legacy could only be defined by [Hylea](/hylea/).\n\n###### Following leads\n\n* In any case, head to the spire rooftop and speak with [Flaune Elette](/flauneElette/). She will indicate that Giacolo had been conducting research at [The Hole](/theHole/), an inn in [The Gullet](/theGullet/).\n* Next, head to the inn. Investigating the top floor will show that Giacolo's room has been ransacked. Talking with the innkeep [Fyrna](/fyrna/), she says that she saw a group of godlike pirates haul Giacolo towards the Narrows. She thinks they were taking him to [Delver's Row](/delversRow/).\n* In Delver's Row, the Watcher will find a soul towards the western part of the map. A broken bronze and adra device lies next to the body. Reading the soul will reveal that Giacolo was indeed captured by the pirates, and that one of them was killed during a scuffle by Giacolo's strange device. Pallegina questions why godlike would want to harm Giacolo - who's always done his best to help their kind.\n**If [Xoti](/xoti/) is in the party, she will harvest the soul for [The Lantern of Gaun](/theLanternOfGaun/).\n* Just to the south, the vendor [Imuani](/imuani/) says that she witnessed the scuffle between the animancer and the pirates. Though \"the old man\" put up a good fight, they eventually subdued him and took him off towards [The Undercroft](/theUndercroft/). She says that they must have spoken to the lift guard before going down. <small>Needs testing, there doesn't seem to be a lift guard to talk to</small>\n* From the lift guard, the soul, or Imuani you'll learn that they took Giacolo to [Dunnage](/dunnage/).\n\n###### Pursue the godlike pirates to Dunnage\n\n* Giacolo is being held captive in the [Lifter's Refuge](/liftersRefuge/) district in Dunnage, by a moon godlike who goes by [Captain Tatzatl](/captainTatzatl/). You must first convince [Li'l Woody](/lilWoody/) to let you in to the building where Giacolo is being held captive, either by having Pallegina in your company or using Good 2 reputation with the Principi.\n* Should you fail to persuade [Li'l Woody](/lilWoody/) or attack her at the door, you'll receive an angry [letter](/palleginasFarewell/) from Pallegina instantly stating that she's leaving the crew as you just doomed Giacolo to a quick death. \n* Once inside, you come face to face with Tatzatl and his crew; [Black Magretta](/blackMagretta/), [Naudr](/naudr/), [Himuati Five Stones](/himuatiFiveStones/), [Naudra](/naudra/) and [Li'l Woody](/lilWoody/) (assuming you didn't kill her outside). If you look to Pallegina, she opens with a rather passionate, yet intimidating speech demanding the release of Giacolo. Tatzatl will proceed to ask you a bunch of questions to determine the fate of Giacolo. As with most other quests, you can do it the safe way and play Tatzatl's game, or slaughter the lot of them.\n\n:;Oblige Tatzatl\n:* Tatzatl and his crew have been debating what to do with Giacolo, and will provide the Watcher with a handful of philosophical quandaries, the Branching Paths of Atleha. These questions will ultimately decide the fate of Giacolo and his research. Any option that ends in combat will queue Tatzatl to attack Giacolo (at first ignoring the Watcher and their party), which will almost certainly lead to his death. Below are the questions, and the correct and incorrect answers that will lead to Tatzatl releasing Giacolo and his research. Note that with a high enough [Perception](/perception/) (13-17), the Watcher can identify the correct options based on Giacolo's facial expressions after giving them. Your companions will also give comments that point towards the correct answer. Also note that the Watcher does not appear to need to answer every question correctly, only a subset.\n{| class=\"wikitable\" style=\"margin-left:40px\" max-width=\"40%\"\n! No.\n!Question\n!Response\n!Spare Giacolo\n!Spare Research\n|-\n! rowspan=\"2\" | 1.\n| rowspan=\"2\" |''A woman is with child and she learns that, if the child is born, it will suffer greatly and have a short life. If she ends the child's life before it truly begins is this good or bad?''\n|Good\n| +1\n| +1\n|-\n| It's Bad\n|\n|\n|-\n\n|-\n! rowspan=\"3\" | 2.\n| rowspan=\"3\" |''You discover a powerful new technology, but you are afraid some people may misuse it for ill purposes. Would you destroy the technology, regulate access to it, or make it available to everyone equally?''\n|Make it available to everyone\n|\n| +2\n|-\n| Regulate it\n|\n| +1\n|-\n| Destroy it\n|\n|\n|-\n! rowspan=\"2\" | 3.\n| rowspan=\"2\" |''An enemy of yours is being persecuted. The grounds of the persecution are, by the measure of your own compass, unfair. Would you allow the persecution to continue, or would you intervene to stop it?''\n|Allow the persecution to continue\n|<nowiki>+1</nowiki>\n|<nowiki>+1</nowiki>\n|-\n| Stop it\n|\n|\n|-\n! rowspan=\"2\" | 4.\n| rowspan=\"2\" |''You learn that someone who does great good for many people is unintentionally going to do great harm to many people. The harm ''may'' not be great or it may be so great that it dwarfs the good they have done. You have an opportunity to prevent this by killing them. Do you do so?''\n|Not kill them\n|<nowiki>+2</nowiki>\n|\n|-\n| Yes, kill them\n|\n|\n|}\n\n:* Once Giacolo's fate is determined, Tatzatl will reveal that he was using you to tip the balance in the discussion he had with his crew regarding Giacolo and his invention, allowing for detecting godlikes in utero. Since he and his crewmen arrived at a stalemate as to whether kill Giacolo or let him go, he needed someone to help them arrive at a conclusion, by asking questions related to Giacolo without giving away the context. Pallegina is sickened how Tatzatl would leave a life up to how the Watcher answered his stupid riddles.\n:*Depending on how you answered the questions, Tatzatl will either release Giacolo with his research, release him under condition that the research be destroyed, or decide that Giacolo needs to be killed (starting combat).\n:**If \"Spare Giacolo\" and \"Spare Research\" are both at least 3, he will release Giacolo with his research.\n:**If \"Spare Giacolo\" is at least 3 and \"Spare Research is less than 3, he will release him under the condition that the research is destroyed\n:**Otherwise, he will decide that Giacolo needs to be killed.\n:*If Tatzatl decides that he will release Giacolo under the condition that the research is destroyed, by arguing that someone else will eventually make the same discovery, a peaceful solution opens up if you pass a skill check of 8 [Diplomacy](/diplomacy/) + 14 [Intellect](/intellect/) and allows the research to continue without bloodshed. If the Watcher is a priest with Withdraw and at least 11 Dexterity, the Watcher can start combat with Withdraw already cast on Giacolo.\n\n:;Attack the pirates\n:* If you have no patience for Tatzatl and his silly philosophical games, you can straight up attack him and his crew, and save Giacolo in the process.\n:* While it isn't impossible to do this, it is indeed difficult as Tatzatl and Naudr make a beeline for Giacolo immediately upon entering combat - and will kill him a single hit. The captain also has the ability [Unstoppable](/unstoppable/), giving him a rather overpowered immunity to all [afflictions](/statusEffectsDeadfireAfflictions/), immunity to interrupts, and resistance to hobble for an infinite (?) amount of time. This means you can't insta-cast immobilizing spells.\n:**An effective solution is to send a party member in between Giacolo and his attackers in order engage both of them. This is only done by using a fast-acting ability like Leap, a Ranger's [Evasive Roll](/evasiveRoll/), Charge, or Flagellant's Path ([Xoti](/xoti/)) for a quick interception on Tatzatl in conjunction with [Stride](/stride/) bonuses. Positioning your party members properly before entering the room can be very beneficial as well. Follow up with bulk damage to burst down Tatzatl and teach him a lesson (though he won't be much of a problem after he's engaged, and the other pirates don't seem to go for Giacolo).\n:* Other than gaining some loot (and pissing off Pallegina in the process), there's no real benefit to this route, since it's much easier just to answer the questions correctly. Pallegina is annoyed, but relieved that Giacolo was unharmed, and you can trade some smirky dialogue here.\n\n###### Outcomes - Giacolo is rescued\n\n* Once freed, Pallegina and Giacolo will both talk to you. If the animancy research was saved, Giacolo will ask for your feedback on how to control his findings, which allows you to suggest either government regulation, self-regulation, or regulation by the public (which hopefully doesn't involve the Dyrwoodan Regulation). Either way, the choice you pick doesn't result in a different outcome, and will complete the quest. Giacolo will reward you with a [Heart-Chime Amulet](/heartChimeAmulet/), and Pallegina will be relieved and forever grateful.\n\n###### Outcomes - Giacolo is killed\n\n* If Giacolo is killed (as a result of either attacking Tatzatl instead of playing his game, or if you incorrectly answer the questions, causing them to attack, and told Pallegina to hold back), Pallegina is rightfully pissed off. She curses herself for ever having followed you in the Dyrwood (during {{poe1}}), and for asking your help with Giacolo. This causes the mission to fail, and Pallegina will permanently leave the party. Upon leaving she sends you a formal letter, [Pallegina's Farewell](/palleginasFarewell/).\n*Pallegina will not leave the party if you failed to answer Tatzatl's questions but didn't try to stop her from attacking, though she's still upset. You can then loot the Heart-Chime amulet from Giacolo's body.\n\n## Trivia\n\n* Tatzatl is voiced by Emmy-award winning actor, and national treasure, [https://www.imdb.com/name/nm0726184/ Sam Riegel].\n* If you bring Pallegina with you to persuade Lil Woody, and do not attack the pirates, then this quest can be completed without a single skill check or battle.\n\n## Gallery\n\n<gallery mode=\"nolines\" widths=\"200px\">\n PE2 The Man of Chimes.png | The dead moon godlike pirate\n</gallery>\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/Companions/companion_qst_pallegina.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Man of Chimes'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Pallegina</b> wants me to help her find an animancer from her past named <b>Giacolo</b>. \n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Ask the animancers in the <b>Spire of the Soul-Seers</b> about <b>Giacolo</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Pallegina</b> believes that <b>Giacolo</b> is working with animancers at the <b>Spire of the Soul-Seers</b> in the Sacred Stair. I should ask around to see what they know of Giacolo.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| I found a correspondence letter on <b>Flaune Elette</b>. Perhaps it contains information about <b>Giacolo</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Search for <b>Giacolo</b> at <b>The Hole</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| I learned that <b>Giacolo</b> has been conducting his research out of a room at <b>The Hole</b>, an inn in The Gullet. I should search for him there.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Ask The Hole's barkeep, <b>Fyrna</b>, about <b>Giacolo's room</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| I found <b>Giacolo's room</b> ransacked. <b>Fyrna</b>, the barkeep for The Hole might know what happened. I should ask her about Giacolo.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Search <b>Delver's Row</b> for signs of <b>Giacolo</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| Fyrna saw pirates haul <b>Giacolo</b> towards the <b>Narrows</b>. She thinks they were taking him to <b>Delver's Row</b>.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| <b>Imuani</b> told me that the pirates took <b>Giacolo</b> down the lift. She mentioned that the lift guard spoke with them before they could pass.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Pursue the godlike pirates to <b>Dunnage</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| The group of godlike pirates that abducted Giacolo were taking him to their captain, someone named \"<b>Tatzatl</b>,\" in <b>Dunnage</b>. I should look for them there.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30000\n| Quest Failed.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I talked Tatzatl into letting Giacolo go free and continue with his research.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I talked Tatzatl into letting Giacolo go free, but Tatzatl confiscated the animancer's research and warned him against continuing it.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| I killed Captain Tatzatl and his crew to save Giacolo.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30004\n| I was unable to talk Tatzatl down, and a fight ensued. Giacolo died during the scuffle.\n|}",
  "raw": "{{Infobox quest poe2\n| name         = {{PAGENAME}}\n| image        = PE2 Giacolo.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Companion quest\n| quest_region = Unknown\n| quest_level  = -\n| faction      = \n| locations    = The Sacred Stair;Spire of the Soul-Seers;The Gullet;The Hole;Delver's Row;Lifter's Refuge;Dunnage House\n| main_npcs    = Pallegina;Giacolo;Flaune Elette;Fyrna;Imuani;Li'l Woody;Captain Tatzatl\n| companion    = Pallegina\n| quest_giver  = Pallegina\n| xp_amount    = \n| xp_type      = Normal\n| xp_level     = 9\n| xp_weights   = 1;1;1;1;1\n| rewardname1  = Save Giacolo\n| reward1      = [[Heart-Chime Amulet]]\n| rewardname2  = Let Giacolo die\n| reward2      = Quest fails;[[Pallegina]] leaves party permanently\n| rewardname3  = \n| reward3      =  \n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         =\n| internalname = companion_qst_pallegina\n| guid         = 9514db69-daf0-4243-b814-8141f1ad10bb\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests|quest]] in {{poe2}}.\n\n==Synopsis==\n[[Pallegina mes Rèi|Pallegina]] wants the Watcher to help her find an animancer from her past named [[Giacolo]]. She believes that Giacolo is working with animancers at the Spire of the Soul-Seers in the Sacred Stair. \n\nThis is Pallegina's companion questline.\n\n==Walkthrough==\n* Upon entering [[The Sacred Stair]] with Pallegina in the party, head to the [[Spire of the Soul-Seers]]. When you are near its entrance, she asks for a moment of your time. She wishes to see a former acquaintance of hers, [[Giacolo]] - an animancer, so that she may thank him. Pallegina believes that he is currently working with the other animancers at the Spire of the Soul-Seers.\n* [[Eder]] (or [[Aloth]]) questions this new-found sentimental side of Pallegina. You learn that Giacolo visited her at the acadamy when she was a child, as part of his study of godlike. Giacolo explained to Pallegina that all godlike have a unique chime within their soul that defines who they are. After threatening suicide if he didn't remove the chime, Giacolo said he would try. Though he was unable to fully remove it, he did manage to sever it - which reverted much of the bird-like changes to Pallegina's body and allowed her to achieve some normalcy and identity among the brotherhood, after years of being some ''thing'' to be paraded around, who's legacy could only be defined by [[Hylea]].\n;Following leads\n* In any case, head to the spire rooftop and speak with [[Flaune Elette]]. She will indicate that Giacolo had been conducting research at [[The Hole]], an inn in [[The Gullet]].\n* Next, head to the inn. Investigating the top floor will show that Giacolo's room has been ransacked. Talking with the innkeep [[Fyrna]], she says that she saw a group of godlike pirates haul Giacolo towards the Narrows. She thinks they were taking him to [[Delver's Row]].\n* In Delver's Row, the Watcher will find a soul towards the western part of the map. A broken bronze and adra device lies next to the body. Reading the soul will reveal that Giacolo was indeed captured by the pirates, and that one of them was killed during a scuffle by Giacolo's strange device. Pallegina questions why godlike would want to harm Giacolo - who's always done his best to help their kind.\n**If [[Xoti]] is in the party, she will harvest the soul for [[The Lantern of Gaun]].\n* Just to the south, the vendor [[Imuani]] says that she witnessed the scuffle between the animancer and the pirates. Though \"the old man\" put up a good fight, they eventually subdued him and took him off towards [[The Undercroft]]. She says that they must have spoken to the lift guard before going down. <small>Needs testing, there doesn't seem to be a lift guard to talk to</small>\n* From the lift guard, the soul, or Imuani you'll learn that they took Giacolo to [[Dunnage]].\n\n;Pursue the godlike pirates to Dunnage\n* Giacolo is being held captive in the [[Lifter's Refuge]] district in Dunnage, by a moon godlike who goes by [[Captain Tatzatl]]. You must first convince [[Li'l Woody]] to let you in to the building where Giacolo is being held captive, either by having Pallegina in your company or using Good 2 reputation with the Principi.\n* Should you fail to persuade [[Li'l Woody]] or attack her at the door, you'll receive an angry [[Pallegina's Farewell|letter]] from Pallegina instantly stating that she's leaving the crew as you just doomed Giacolo to a quick death. \n* Once inside, you come face to face with Tatzatl and his crew; [[Black Magretta]], [[Naudr]], [[Himuati Five Stones]], [[Naudra]] and [[Li'l Woody]] (assuming you didn't kill her outside). If you look to Pallegina, she opens with a rather passionate, yet intimidating speech demanding the release of Giacolo. Tatzatl will proceed to ask you a bunch of questions to determine the fate of Giacolo. As with most other quests, you can do it the safe way and play Tatzatl's game, or slaughter the lot of them.\n\n:;Oblige Tatzatl\n:* Tatzatl and his crew have been debating what to do with Giacolo, and will provide the Watcher with a handful of philosophical quandaries, the Branching Paths of Atleha. These questions will ultimately decide the fate of Giacolo and his research. Any option that ends in combat will queue Tatzatl to attack Giacolo (at first ignoring the Watcher and their party), which will almost certainly lead to his death. Below are the questions, and the correct and incorrect answers that will lead to Tatzatl releasing Giacolo and his research. Note that with a high enough [[Perception]] (13-17), the Watcher can identify the correct options based on Giacolo's facial expressions after giving them. Your companions will also give comments that point towards the correct answer. Also note that the Watcher does not appear to need to answer every question correctly, only a subset.\n{| class=\"wikitable\" style=\"margin-left:40px\" max-width=\"40%\"\n! No.\n!Question\n!Response\n!Spare Giacolo\n!Spare Research\n|-\n! rowspan=\"2\" | 1.\n| rowspan=\"2\" |''A woman is with child and she learns that, if the child is born, it will suffer greatly and have a short life. If she ends the child's life before it truly begins is this good or bad?''\n|Good\n| +1\n| +1\n|-\n| It's Bad\n|\n|\n|-\n\n|-\n! rowspan=\"3\" | 2.\n| rowspan=\"3\" |''You discover a powerful new technology, but you are afraid some people may misuse it for ill purposes. Would you destroy the technology, regulate access to it, or make it available to everyone equally?''\n|Make it available to everyone\n|\n| +2\n|-\n| Regulate it\n|\n| +1\n|-\n| Destroy it\n|\n|\n|-\n! rowspan=\"2\" | 3.\n| rowspan=\"2\" |''An enemy of yours is being persecuted. The grounds of the persecution are, by the measure of your own compass, unfair. Would you allow the persecution to continue, or would you intervene to stop it?''\n|Allow the persecution to continue\n|<nowiki>+1</nowiki>\n|<nowiki>+1</nowiki>\n|-\n| Stop it\n|\n|\n|-\n! rowspan=\"2\" | 4.\n| rowspan=\"2\" |''You learn that someone who does great good for many people is unintentionally going to do great harm to many people. The harm ''may'' not be great or it may be so great that it dwarfs the good they have done. You have an opportunity to prevent this by killing them. Do you do so?''\n|Not kill them\n|<nowiki>+2</nowiki>\n|\n|-\n| Yes, kill them\n|\n|\n|}\n\n:* Once Giacolo's fate is determined, Tatzatl will reveal that he was using you to tip the balance in the discussion he had with his crew regarding Giacolo and his invention, allowing for detecting godlikes in utero. Since he and his crewmen arrived at a stalemate as to whether kill Giacolo or let him go, he needed someone to help them arrive at a conclusion, by asking questions related to Giacolo without giving away the context. Pallegina is sickened how Tatzatl would leave a life up to how the Watcher answered his stupid riddles.\n:*Depending on how you answered the questions, Tatzatl will either release Giacolo with his research, release him under condition that the research be destroyed, or decide that Giacolo needs to be killed (starting combat).\n:**If \"Spare Giacolo\" and \"Spare Research\" are both at least 3, he will release Giacolo with his research.\n:**If \"Spare Giacolo\" is at least 3 and \"Spare Research is less than 3, he will release him under the condition that the research is destroyed\n:**Otherwise, he will decide that Giacolo needs to be killed.\n:*If Tatzatl decides that he will release Giacolo under the condition that the research is destroyed, by arguing that someone else will eventually make the same discovery, a peaceful solution opens up if you pass a skill check of 8 [[Diplomacy]] + 14 [[Intellect]] and allows the research to continue without bloodshed. If the Watcher is a priest with Withdraw and at least 11 Dexterity, the Watcher can start combat with Withdraw already cast on Giacolo.\n\n:;Attack the pirates\n:* If you have no patience for Tatzatl and his silly philosophical games, you can straight up attack him and his crew, and save Giacolo in the process.\n:* While it isn't impossible to do this, it is indeed difficult as Tatzatl and Naudr make a beeline for Giacolo immediately upon entering combat - and will kill him a single hit. The captain also has the ability [[Unstoppable]], giving him a rather overpowered immunity to all [[Status effects (Deadfire)#Afflictions|afflictions]], immunity to interrupts, and resistance to hobble for an infinite (?) amount of time. This means you can't insta-cast immobilizing spells.\n:**An effective solution is to send a party member in between Giacolo and his attackers in order engage both of them. This is only done by using a fast-acting ability like Leap, a Ranger's [[Evasive Roll]], Charge, or Flagellant's Path ([[Xoti]]) for a quick interception on Tatzatl in conjunction with [[Stride]] bonuses. Positioning your party members properly before entering the room can be very beneficial as well. Follow up with bulk damage to burst down Tatzatl and teach him a lesson (though he won't be much of a problem after he's engaged, and the other pirates don't seem to go for Giacolo).\n:* Other than gaining some loot (and pissing off Pallegina in the process), there's no real benefit to this route, since it's much easier just to answer the questions correctly. Pallegina is annoyed, but relieved that Giacolo was unharmed, and you can trade some smirky dialogue here.\n\n;Outcomes - Giacolo is rescued\n* Once freed, Pallegina and Giacolo will both talk to you. If the animancy research was saved, Giacolo will ask for your feedback on how to control his findings, which allows you to suggest either government regulation, self-regulation, or regulation by the public (which hopefully doesn't involve the Dyrwoodan Regulation). Either way, the choice you pick doesn't result in a different outcome, and will complete the quest. Giacolo will reward you with a [[Heart-Chime Amulet]], and Pallegina will be relieved and forever grateful.\n\n;Outcomes - Giacolo is killed\n* If Giacolo is killed (as a result of either attacking Tatzatl instead of playing his game, or if you incorrectly answer the questions, causing them to attack, and told Pallegina to hold back), Pallegina is rightfully pissed off. She curses herself for ever having followed you in the Dyrwood (during {{poe1}}), and for asking your help with Giacolo. This causes the mission to fail, and Pallegina will permanently leave the party. Upon leaving she sends you a formal letter, [[Pallegina's Farewell]].\n*Pallegina will not leave the party if you failed to answer Tatzatl's questions but didn't try to stop her from attacking, though she's still upset. You can then loot the Heart-Chime amulet from Giacolo's body.\n\n==Trivia==\n* Tatzatl is voiced by Emmy-award winning actor, and national treasure, [https://www.imdb.com/name/nm0726184/ Sam Riegel].\n* If you bring Pallegina with you to persuade Lil Woody, and do not attack the pirates, then this quest can be completed without a single skill check or battle.\n\n==Gallery==\n<gallery mode=\"nolines\" widths=\"200px\">\n PE2 The Man of Chimes.png | The dead moon godlike pirate\n</gallery>\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/Companions/companion_qst_pallegina.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Man of Chimes'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Pallegina</b> wants me to help her find an animancer from her past named <b>Giacolo</b>. \n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Ask the animancers in the <b>Spire of the Soul-Seers</b> about <b>Giacolo</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Pallegina</b> believes that <b>Giacolo</b> is working with animancers at the <b>Spire of the Soul-Seers</b> in the Sacred Stair. I should ask around to see what they know of Giacolo.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| I found a correspondence letter on <b>Flaune Elette</b>. Perhaps it contains information about <b>Giacolo</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Search for <b>Giacolo</b> at <b>The Hole</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| I learned that <b>Giacolo</b> has been conducting his research out of a room at <b>The Hole</b>, an inn in The Gullet. I should search for him there.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Ask The Hole's barkeep, <b>Fyrna</b>, about <b>Giacolo's room</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| I found <b>Giacolo's room</b> ransacked. <b>Fyrna</b>, the barkeep for The Hole might know what happened. I should ask her about Giacolo.\n|-\n| rowspan=\"3\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Search <b>Delver's Row</b> for signs of <b>Giacolo</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| Fyrna saw pirates haul <b>Giacolo</b> towards the <b>Narrows</b>. She thinks they were taking him to <b>Delver's Row</b>.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| <b>Imuani</b> told me that the pirates took <b>Giacolo</b> down the lift. She mentioned that the lift guard spoke with them before they could pass.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Pursue the godlike pirates to <b>Dunnage</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| The group of godlike pirates that abducted Giacolo were taking him to their captain, someone named \"<b>Tatzatl</b>,\" in <b>Dunnage</b>. I should look for them there.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{cross}}\n| style=\"vertical-align: text-top\" | 30000\n| Quest Failed.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I talked Tatzatl into letting Giacolo go free and continue with his research.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I talked Tatzatl into letting Giacolo go free, but Tatzatl confiscated the animancer's research and warned him against continuing it.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30003\n| I killed Captain Tatzatl and his crew to save Giacolo.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30004\n| I was unable to talk Tatzatl down, and a fight ensued. Giacolo died during the scuffle.\n|}",
  "slug": "theManOfChimes",
  "title": "The Man of Chimes"
}
