{
  "markdown": "'''{{PAGENAME}}''' is a [quest](/pillarsOfEternityIiDeadfireQuests/) in {{poe2}}.\n\n## Synopsis\n\n \n[Aloth](/aloth/) has spent the last five years trying to deal with the Leaden Key, but the task has proven difficult.\nHe wants the Watcher's help to find a Leaden Key cabal in Deadfire that may provide him with much-needed insight. He said no one in the region seems to know that name, so our best hope is to keep an eye out for signs of the Leaden Key.\n\n## Walkthrough\n\nAfter Act 2 and once your reputation with Aloth reaches 1, he will talk to you and ask for help with finding the cabal. \n* Head northwest, into [Rikuhu's Maw](/rikuhusMaw/), and sail around waiting for an encounter with a deserted ship. Its sails will bear a variant of the Key's insignia.\n* Board the ship. Investigate the soul to learn that a Huana tribe has attacked the ship, abandoning it dead in the water.\n* Talk to Aloth. He will reveal that he has also found stains, which you can identify as koiki pulp with Survival 4. With History 7 you can determine their relation to Wahaki hunters.\n* Continue to [Ori o Koīki](/oriOKoiki/). Aloth will notice a mural displaying Thaos in the Wahaki shrine.\n* Talk to the ranga, [Ruāsare](/ruasare/), and mention Thaos and the Leaden Key. This will allow you to read her soul (read the full memory below).\n* The memory shows Ruāsare's past life as a long-ago chieftain of the Wahaki. Thaos came to scare her people into abandoning the Engwithan ruins. She executed Thaos instead, yet their interaction cemented the Wahaki's suspicion of outsiders. Thus, the tribe has unintentionally served the Leaden Key's interests for almost two thousand years by protecting the ruins.\n* Speak with Aloth about the memory. How you answer his question, \"Might I be to blame?\", determines his [end-game slides](/pillarsOfEternityIiDeadfireEndingsAloth/). Aloth will either feel responsible for the consequences of his actions and decides to drop his pursuit, or feels absolved and continues his Leaden Key work.\n{| class=\"wikitable\"\n! Dialogue\n! style=\"width:70px\" | <small>Feels absolved</small>\n! style=\"width:70px\" | <small>Feels responsible</small>\n|-\n| colspan=\"3\" | <b>\"Might... I be to blame? Have I made a grievous mistake in getting involved?\"</b>\n|-\n| → \"You're responsible for the consequences of your actions, intended or otherwise.\" || || Y\n|-\n| → \"No. If you didn't try at all, you'd be responsible for the harm the Leaden Key continues doing.\" || Y ||\n|-\n| → \"Consider how poorly Thaos understood the Wahaki. How much less do you understand the Leaden Key?\" || || Y\n|-\n| → \"No one can know everything, so we've all got to do the best we can with the resources we have.\" || Y ||\n|-\n| → \"Thaos accomplished his goals, just not the way he originally planned. Your problem is looking for specific, immediate results.\" || Y ||\n|-\n| → \"You don't have to reform the Leaden Key - without Thaos, it will change in time.\"\nOR\n<br />→ \"You don't have to destroy the Leaden Key - everything falls apart eventually.\"\n|| || Y\n|-\n| → \"You've got to answer that on your own.\"**  || ||\n|}\n<sup>**Aloth will choose whichever trait is higher. See the dialogue table below.\n\nHe can either be heartened by knowing that even Thaos' imperfect efforts have progressed his grand schemes (which grants him [Adaptive](/adaptive/)), or think that his approach truly doesn't matter (which grants him [Persistent](/persistent/)).\n\n## Absolved/Responsible dialogue\n\nThese conversations will influence his feelings of absolution or responsibility. If you let Aloth decide at the end of the quest (or don't finish the quest), whichever of these traits is higher will dictate his end-game slides.\n<!-- variables are n_aloth_p2_absolve and n_aloth_p2_responsible -->\n{| class=\"wikitable\"\n|-\n| colspan=\"3\" style=\"text-align:left;border-left:none;border-top:none;border-right:none;background-color:transparent\" | '''Pre-quest after leaving Port Maje''' \n|-\n| <b>\"Instead of a handful dying each year, a few perished every week.\"</b> || <small>Absolved</small> || <small>Responsible</small>\n|-\n| → \"And now you feel responsible, is that it?\" || || \n|-\n| → \"Maybe you should have left them alone.\" ||  || 1\n|-\n| → \"You couldn't have known that would happen. This isn't your fault.\" || 1 || \n|-\n| → \"If you barely understood this ritual, how did you expect to stop it?\" || || 1\n|-\n| → \"You tried to do the right thing, and that's what matters.\" || 1 ||\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"border-left:none;border-right:none;background:none;\" | &nbsp;\n|-\n| colspan=\"3\" | <b>\"I keep wondering what I might have done differently. Or how I could have known better.\"</b>\n|-\n| → \"I don't have an answer for that.\" || || \n|-\n| → \"Learning from mistakes like this is a good start.\" ||  || 1\n|-\n| → \"Stop dwelling on this. You'll paralyze yourself.\" || 1 || \n|-\n| → \"The villagers had found a way to live with the ritual. In time, perhaps they would have changed it on their own.\" || || 1\n|-\n| → \"The villagers chose this. They're to blame here, not you.\" || 1 ||\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"border-left:none;border-right:none;border-bottom:none;\" | &nbsp;\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"text-align:left;border-left:none;border-top:none;border-right:none;background:none\" | '''After Act 2'''\n|-\n| <b>\"Don't you worry what will come next? What events you might move forward?\"</b> || <small>Absolved</small> || <small>Responsible</small>\n|-\n| → \"What is this really about, Aloth?\" || || \n|-\n| → \"If I thought about it that much, I'd never do anything.\" || 1 ||\n|-\n| → \"What someone else does with my words is on them, not me.\" || 1 || \n|-\n| → \"Of course. That's why I choose my words carefully.\" || || 1\n|-\n| → \"I doubt my response will mean anything irrevocable.\" || 1 ||\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"border-left:none;border-right:none;background-color:transparent;border-bottom:none;\" | &nbsp;\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"text-align:left;border-left:none;border-top:none;border-right:none;background-color:transparent\" | '''After reading the ranga's soul'''\n|-\n| <b>\"Though, not as it seems, in the way Thaos intended.\"</b> || <small>Absolved</small> || <small>Responsible</small>\n|-\n| → \"What are you thinking, Aloth?\" || || \n|-\n| → \"He just got lucky it worked out.\" || || 1\n|-\n| → \"Thaos had schemes within schemes. He knew what he was doing.\" || 1 || \n|-\n| → \"Few plans work out perfectly. Thaos got the Wahaki to help him guard the ruins - that's what matters.\" || 1 ||\n|-\n| → \"They're living in Engwithan ruins. Thaos certainly didn't intend that.\" || || 1\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"border-left:none;border-right:none;background-color:transparent;\" | &nbsp;\n|-\n| colspan=\"3\" |<b>\"Yet over time, they became hostile towards all outsiders.\"</b>\n|-\n| → \"What of it?\" || || \n|-\n| → \"It's a logical extension of what they learned from Thaos.\" || || 1\n|-\n| → \"With all that's changing in Deadfire, who knows what they'd believe in another few hundred years?\" || || 1 \n|-\n| → \"Stories and messages change. Thaos only had clarity about his because Woedica reincarnated him whole every time.\" || 1 ||\n|-\n| → \"Look around. Their environment surely pushed them in that direction.\" || 1 ||\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"border-left:none;border-right:none;background-color:transparent;\" | &nbsp;\n|-\n| colspan=\"3\" |<b>\"They went from being a large and well-connected tribe to a much smaller one defined by isolationism.\"</b>\n|-\n| → [Insight 3] \"And this has got you thinking again about the consequences of your intervention.\" || || \n|-\n| → \"But what does this have to do with you?\" || ||\n|-\n| → \"You can't attribute two thousand years' worth of change to one incident.\" || 1 ||\n|-\n| → \"Even small events can have great consequences.\" || || 1\n|}\n\n## Ruāsare's memory\n\nYou will move hundreds of generations back, to the memory of a strange, foreign man:\n<div class=\"mw-collapsible mw-collapsed\" style=\"min-height:20px\">{{description|When at last you seize it, you find yourself in the very same throne room. But the condition of the place - and the memory of your host - suggests that it is many, many hundreds of years ago.\nIf not more.\n\nYou are seated on the dais. A man is brought before you, dressed in stifling black robes. \nHe reminds you of a corpse dressed for a funeral.\nHe reminds you of something else, too, but one of your attendants leans in and interrupts the thought before you can follow it. She tells you that this is the man you asked to see, and that his people have been harassing yours.\n\nHe calls himself 'Thaos ix Arkannon.'\n\n\"Explain yourself, stranger.\"\n\nHe gives you a smile that sets your teeth on edge.\n\n\"Your Excellency, I come to warn your people. Your presence among these ruins is an affront to the gods. \"You must remove yourself lest you face the gods' wrath.\"\n\nIndeed, the man is an even greater fool than you had been told.\n\n\"The gods surely take their time. We have lived here two hundred years, and they have yet to raise an objection.\"\n\nHe bows. \"The timeline of the gods is not for mortals to understand. But even their patience shall wear thin, especially after this warning.\"\n\nYou certainly feel your patience wearing thin.\nWho is he, this foreigner, to send your people from their halls and homes?\nAnd who is he to tell your people, the survivors, about the wrath of the gods?\n\n\"What ungrateful guest evicts his hosts? Our ancestors built these places centuries ago. We will not leave.\"\n\nFor a moment his unctuous facade melts away, and he blinks at you and your attendants.\nYou get the impression that your response has surprised him.\n\n\"Your people cling tightly to their history.\" His jaw is tight as he speaks. He swallows hard, as if gulping something unpleasant. \"But where are these designs among your arts? Where is the carved adra in your wooden huts?\"\n\nYou knew he was a fool, but now you suspect he is a dangerous one.\n\nHis words are a lie, but like the very best lies, they contain the shadow of truth. \n\nEveryone knows foreigners once lived among your people as guests. But they have not been seen in two hundred years.\n\n\"These places were not built by the Huana, but by an ancient people from a distant land.\"\n\n\"The murals in these places and the stories of our ancestors tell it differently. How would you, foreigner, know our history better than our own grandfathers?\"\n \nWhat prickles the back of your neck is the question of how he might know this.\nAnd why he brings it to you. He smiles. \"I have seen your murals. And I know that you will recognize this.\"\n\nHe produces a helm with two horn-like protrusions and a mask attached.\nHe is correct. You do recognize it.\nYour guards and attendants gasp. The man, Thaos, smiles more broadly.\n\n\"It was my people who built these places. And now I come before you bearing their warning.\"\n\nAt least that much is true.\n\nYou turn to your guards.\n\n\"Seize him.\"\n\nJust as a look of surprise appears on Thaos' face, the ancient ranga's memory skips ahead.\n\nYou are looking at Thaos once more. This time, however, he and a score of robed men and women are bound amidst a heap of peat and wood.\n\nThis time, he is staring at you in disbelieving fury.\n\nYou have gathered your people and told them that the foreigners before them are the same ones who came to the islands centuries ago. \n\nAnd now your people are angry and frightened, too, because every Wahaki remembers the story of how these foreigners abused the hospitality of their Huana hosts. So great was their iniquity that the gods destroyed the great city of Ukaizo and many others besides.\n\n\"Watch now as I wipe their stain from among us.\"\n\nYour people cheer. Thaos struggles and yells, but his words are drowned out.\n\n\"Let us never forget that this foreigner is a trickster and his people a plague.\"\n\nHundreds of Wahaki stamp their feet and beat the ground with the butts of their spears. \n\nStill Thaos scowls and thrashes in protest.\n\n\"From this day forward, we must be vigilant. Let us root out such foreigners and keep our lands pure of their wickedness.\"\n\nThe tribe cheers louder than ever. Young and old, Mataru and Roparu, all are united in purpose.\n\nA change seems to come over Thaos. The struggle leaves his body and the rage departs his face.\n\nGood. Let him accept his end.\n\nOne of your attendants offers you a torch.\n\nYou hurl the torch. The flames spread quickly.\n\nThe foreigners scream as the fire advances. All except Thaos, who looks back at you with a strange smile of satisfaction.}}</div>\n\n## Trivia\n\n* Note that killing the ranga for the quest [Tip of the Spear](/tipOfTheSpear/) will cause her soul to exit her body and linger above her corpse so that you may interact with it, thus preventing the quest from being stuck.\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/Companions/companion_qst_aloth.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Painted Masks'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Aloth</b> has spent the last five years trying to reform the Leaden Key into a force for good, but the task has proven difficult.\n\nHe wants my help to find a Leaden Key cabal in Deadfire that may provide him with much-needed insight.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Wait for <b>Aloth</b> to explain further.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Aloth</b> mentioned that he's been tracking the Leaden Key. He promised to tell me more once he's had the chance to review his notes.\n|-\n| rowspan=\"7\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Watch for signs of the \"<b>Painted Masks</b>.\"'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| <b>Aloth</b> told me about an ancient Leaden Key cabal in the area known as the \"<b>Painted Masks</b>.\"\n\nHe said no one in the region seems to know that name, so our best hope is to keep an eye out for signs of the Leaden Key.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| We came across a drifting ship. The crew was dead, but <b>Aloth</b> thought they might be connected to the Leaden Key.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I read the soul of one of the dead crew. They were simple merchants.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I decided not to investigate the ship. <b>Aloth</b> was disappointed.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| We couldn't determine who killed the crew, though it's likely they're somewhere in the vicinity.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| We met a group of <b>Wahaki</b> at <b>Motare o Kōzi</b>. They wore face paint, but we were unable to learn more from them. We'll have to look for answers elsewhere.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Sail to <b>Ori o Koīki</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| I found evidence that the <b>Wahaki</b> attacked the merchant ship. <b>Aloth</b> still thinks the symbol painted on the sails is evidence of a Leaden Key connection.\n\nPerhaps we can learn more on <b>Ori o Koīki</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Search <b>Ori o Koīki</b> for signs of the Leaden Key.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| I've reached <b>Ori o Koīki</b>, and there are strange signs of a Leaden Key presence, from the mask-like face paintings of the Wahaki to the artwork. \n\nI may be able to learn more by looking around.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Tell <b>Aloth</b> about what you saw in <b>Ruāsare's</b> soul.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I found a memory of <b>Ruāsare's</b> past life as a long-ago chieftain of the Wahaki. It seems <b>Thaos</b> came to scare her people into abandoning the Engwithan ruins. \n\nShe executed Thaos instead, yet their interaction cemented the Wahaki's suspicion of outsiders. Thus, the tribe has unintentionally served the Leaden Key's interests for almost two thousand years.\n\n<b>Aloth</b> will want to know about this. \n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Sail to <b>Ori o Koīki</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| <b>Aloth's</b> description of the \"Painted Masks\" reminded me of the <b>Wahaki</b>, a Huana tribe.\n\nWe may be able to learn more at <b>Ori o Koīki</b>, their home island.\n\n|-\n! colspan=\"3\" | Unused strings\n|-\n| rowspan=\"1\" style=\"vertical-align:text-top; text-align:center\" | '''-'''\n| style=\"vertical-align:text-top\" | 40001\n| <b>Aloth</b> has spent the last five years trying to dismantle the Leaden Key, but the task has been more complicated than he expected.\n\nHe wants my help to find a Leaden Key cabal in <b>Deadfire</b> that may provide him with much-needed insight.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| Aloth was humbled by the story of Thaos' mistake. He considered whether he's been misguided in his efforts with the Leaden Key.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| Aloth was encouraged by the story of Thaos' unlikely victory. He seemed heartened to know that even his imperfect efforts regarding the Leaden Key may mean progress.\n|}",
  "raw": "{{Infobox quest poe2\n| name         = The Painted Masks\n| image        = PE2 Ruāsare.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Companion quest\n| quest_region = Unknown\n| quest_level  = 10\n| faction      = \n| locations    = Ori o Koīki\n| main_npcs    = Ruāsare\n| companion    = Aloth\n| quest_giver  = Aloth\n| xp_amount    = 1000\n| xp_type      = Normal\n| xp_level     = 11\n| xp_weights   = 1;1;1;1;1;1\n| rewardname1  = Complete the quest\n| reward1      = Experience;Aloth granted either [[Adaptive]] or [[Persistent]]\n| rewardname2  = \n| reward2      =  \n| rewardname3  = \n| reward3      =  \n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         =\n| internalname = companion_qst_aloth\n| guid         = ee657718-31ec-4140-945f-2f2488af7503\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests|quest]] in {{poe2}}.\n\n==Synopsis== \n[[Aloth]] has spent the last five years trying to deal with the Leaden Key, but the task has proven difficult.\nHe wants the Watcher's help to find a Leaden Key cabal in Deadfire that may provide him with much-needed insight. He said no one in the region seems to know that name, so our best hope is to keep an eye out for signs of the Leaden Key.\n\n==Walkthrough==\nAfter Act 2 and once your reputation with Aloth reaches 1, he will talk to you and ask for help with finding the cabal. \n* Head northwest, into [[Rikuhu's Maw]], and sail around waiting for an encounter with a deserted ship. Its sails will bear a variant of the Key's insignia.\n* Board the ship. Investigate the soul to learn that a Huana tribe has attacked the ship, abandoning it dead in the water.\n* Talk to Aloth. He will reveal that he has also found stains, which you can identify as koiki pulp with Survival 4. With History 7 you can determine their relation to Wahaki hunters.\n* Continue to [[Ori o Koīki]]. Aloth will notice a mural displaying Thaos in the Wahaki shrine.\n* Talk to the ranga, [[Ruāsare]], and mention Thaos and the Leaden Key. This will allow you to read her soul (read the full memory below).\n* The memory shows Ruāsare's past life as a long-ago chieftain of the Wahaki. Thaos came to scare her people into abandoning the Engwithan ruins. She executed Thaos instead, yet their interaction cemented the Wahaki's suspicion of outsiders. Thus, the tribe has unintentionally served the Leaden Key's interests for almost two thousand years by protecting the ruins.\n* Speak with Aloth about the memory. How you answer his question, \"Might I be to blame?\", determines his [[Pillars_of_Eternity_II:_Deadfire_endings#Aloth|end-game slides]]. Aloth will either feel responsible for the consequences of his actions and decides to drop his pursuit, or feels absolved and continues his Leaden Key work.\n{| class=\"wikitable\"\n! Dialogue\n! style=\"width:70px\" | <small>Feels absolved</small>\n! style=\"width:70px\" | <small>Feels responsible</small>\n|-\n| colspan=\"3\" | <b>\"Might... I be to blame? Have I made a grievous mistake in getting involved?\"</b>\n|-\n| → \"You're responsible for the consequences of your actions, intended or otherwise.\" || || Y\n|-\n| → \"No. If you didn't try at all, you'd be responsible for the harm the Leaden Key continues doing.\" || Y ||\n|-\n| → \"Consider how poorly Thaos understood the Wahaki. How much less do you understand the Leaden Key?\" || || Y\n|-\n| → \"No one can know everything, so we've all got to do the best we can with the resources we have.\" || Y ||\n|-\n| → \"Thaos accomplished his goals, just not the way he originally planned. Your problem is looking for specific, immediate results.\" || Y ||\n|-\n| → \"You don't have to reform the Leaden Key - without Thaos, it will change in time.\"\nOR\n<br />→ \"You don't have to destroy the Leaden Key - everything falls apart eventually.\"\n|| || Y\n|-\n| → \"You've got to answer that on your own.\"**  || ||\n|}\n<sup>**Aloth will choose whichever trait is higher. See the dialogue table below.\n\nHe can either be heartened by knowing that even Thaos' imperfect efforts have progressed his grand schemes (which grants him [[Adaptive]]), or think that his approach truly doesn't matter (which grants him [[Persistent]]).\n\n==Absolved/Responsible dialogue==\nThese conversations will influence his feelings of absolution or responsibility. If you let Aloth decide at the end of the quest (or don't finish the quest), whichever of these traits is higher will dictate his end-game slides.\n<!-- variables are n_aloth_p2_absolve and n_aloth_p2_responsible -->\n{| class=\"wikitable\"\n|-\n| colspan=\"3\" style=\"text-align:left;border-left:none;border-top:none;border-right:none;background-color:transparent\" | '''Pre-quest after leaving Port Maje''' \n|-\n| <b>\"Instead of a handful dying each year, a few perished every week.\"</b> || <small>Absolved</small> || <small>Responsible</small>\n|-\n| → \"And now you feel responsible, is that it?\" || || \n|-\n| → \"Maybe you should have left them alone.\" ||  || 1\n|-\n| → \"You couldn't have known that would happen. This isn't your fault.\" || 1 || \n|-\n| → \"If you barely understood this ritual, how did you expect to stop it?\" || || 1\n|-\n| → \"You tried to do the right thing, and that's what matters.\" || 1 ||\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"border-left:none;border-right:none;background:none;\" | &nbsp;\n|-\n| colspan=\"3\" | <b>\"I keep wondering what I might have done differently. Or how I could have known better.\"</b>\n|-\n| → \"I don't have an answer for that.\" || || \n|-\n| → \"Learning from mistakes like this is a good start.\" ||  || 1\n|-\n| → \"Stop dwelling on this. You'll paralyze yourself.\" || 1 || \n|-\n| → \"The villagers had found a way to live with the ritual. In time, perhaps they would have changed it on their own.\" || || 1\n|-\n| → \"The villagers chose this. They're to blame here, not you.\" || 1 ||\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"border-left:none;border-right:none;border-bottom:none;\" | &nbsp;\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"text-align:left;border-left:none;border-top:none;border-right:none;background:none\" | '''After Act 2'''\n|-\n| <b>\"Don't you worry what will come next? What events you might move forward?\"</b> || <small>Absolved</small> || <small>Responsible</small>\n|-\n| → \"What is this really about, Aloth?\" || || \n|-\n| → \"If I thought about it that much, I'd never do anything.\" || 1 ||\n|-\n| → \"What someone else does with my words is on them, not me.\" || 1 || \n|-\n| → \"Of course. That's why I choose my words carefully.\" || || 1\n|-\n| → \"I doubt my response will mean anything irrevocable.\" || 1 ||\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"border-left:none;border-right:none;background-color:transparent;border-bottom:none;\" | &nbsp;\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"text-align:left;border-left:none;border-top:none;border-right:none;background-color:transparent\" | '''After reading the ranga's soul'''\n|-\n| <b>\"Though, not as it seems, in the way Thaos intended.\"</b> || <small>Absolved</small> || <small>Responsible</small>\n|-\n| → \"What are you thinking, Aloth?\" || || \n|-\n| → \"He just got lucky it worked out.\" || || 1\n|-\n| → \"Thaos had schemes within schemes. He knew what he was doing.\" || 1 || \n|-\n| → \"Few plans work out perfectly. Thaos got the Wahaki to help him guard the ruins - that's what matters.\" || 1 ||\n|-\n| → \"They're living in Engwithan ruins. Thaos certainly didn't intend that.\" || || 1\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"border-left:none;border-right:none;background-color:transparent;\" | &nbsp;\n|-\n| colspan=\"3\" |<b>\"Yet over time, they became hostile towards all outsiders.\"</b>\n|-\n| → \"What of it?\" || || \n|-\n| → \"It's a logical extension of what they learned from Thaos.\" || || 1\n|-\n| → \"With all that's changing in Deadfire, who knows what they'd believe in another few hundred years?\" || || 1 \n|-\n| → \"Stories and messages change. Thaos only had clarity about his because Woedica reincarnated him whole every time.\" || 1 ||\n|-\n| → \"Look around. Their environment surely pushed them in that direction.\" || 1 ||\n|- style=\"background-color:transparent\"\n| colspan=\"3\" style=\"border-left:none;border-right:none;background-color:transparent;\" | &nbsp;\n|-\n| colspan=\"3\" |<b>\"They went from being a large and well-connected tribe to a much smaller one defined by isolationism.\"</b>\n|-\n| → [Insight 3] \"And this has got you thinking again about the consequences of your intervention.\" || || \n|-\n| → \"But what does this have to do with you?\" || ||\n|-\n| → \"You can't attribute two thousand years' worth of change to one incident.\" || 1 ||\n|-\n| → \"Even small events can have great consequences.\" || || 1\n|}\n\n==Ruāsare's memory==\nYou will move hundreds of generations back, to the memory of a strange, foreign man:\n<div class=\"mw-collapsible mw-collapsed\" style=\"min-height:20px\">{{description|When at last you seize it, you find yourself in the very same throne room. But the condition of the place - and the memory of your host - suggests that it is many, many hundreds of years ago.\nIf not more.\n\nYou are seated on the dais. A man is brought before you, dressed in stifling black robes. \nHe reminds you of a corpse dressed for a funeral.\nHe reminds you of something else, too, but one of your attendants leans in and interrupts the thought before you can follow it. She tells you that this is the man you asked to see, and that his people have been harassing yours.\n\nHe calls himself 'Thaos ix Arkannon.'\n\n\"Explain yourself, stranger.\"\n\nHe gives you a smile that sets your teeth on edge.\n\n\"Your Excellency, I come to warn your people. Your presence among these ruins is an affront to the gods. \"You must remove yourself lest you face the gods' wrath.\"\n\nIndeed, the man is an even greater fool than you had been told.\n\n\"The gods surely take their time. We have lived here two hundred years, and they have yet to raise an objection.\"\n\nHe bows. \"The timeline of the gods is not for mortals to understand. But even their patience shall wear thin, especially after this warning.\"\n\nYou certainly feel your patience wearing thin.\nWho is he, this foreigner, to send your people from their halls and homes?\nAnd who is he to tell your people, the survivors, about the wrath of the gods?\n\n\"What ungrateful guest evicts his hosts? Our ancestors built these places centuries ago. We will not leave.\"\n\nFor a moment his unctuous facade melts away, and he blinks at you and your attendants.\nYou get the impression that your response has surprised him.\n\n\"Your people cling tightly to their history.\" His jaw is tight as he speaks. He swallows hard, as if gulping something unpleasant. \"But where are these designs among your arts? Where is the carved adra in your wooden huts?\"\n\nYou knew he was a fool, but now you suspect he is a dangerous one.\n\nHis words are a lie, but like the very best lies, they contain the shadow of truth. \n\nEveryone knows foreigners once lived among your people as guests. But they have not been seen in two hundred years.\n\n\"These places were not built by the Huana, but by an ancient people from a distant land.\"\n\n\"The murals in these places and the stories of our ancestors tell it differently. How would you, foreigner, know our history better than our own grandfathers?\"\n \nWhat prickles the back of your neck is the question of how he might know this.\nAnd why he brings it to you. He smiles. \"I have seen your murals. And I know that you will recognize this.\"\n\nHe produces a helm with two horn-like protrusions and a mask attached.\nHe is correct. You do recognize it.\nYour guards and attendants gasp. The man, Thaos, smiles more broadly.\n\n\"It was my people who built these places. And now I come before you bearing their warning.\"\n\nAt least that much is true.\n\nYou turn to your guards.\n\n\"Seize him.\"\n\nJust as a look of surprise appears on Thaos' face, the ancient ranga's memory skips ahead.\n\nYou are looking at Thaos once more. This time, however, he and a score of robed men and women are bound amidst a heap of peat and wood.\n\nThis time, he is staring at you in disbelieving fury.\n\nYou have gathered your people and told them that the foreigners before them are the same ones who came to the islands centuries ago. \n\nAnd now your people are angry and frightened, too, because every Wahaki remembers the story of how these foreigners abused the hospitality of their Huana hosts. So great was their iniquity that the gods destroyed the great city of Ukaizo and many others besides.\n\n\"Watch now as I wipe their stain from among us.\"\n\nYour people cheer. Thaos struggles and yells, but his words are drowned out.\n\n\"Let us never forget that this foreigner is a trickster and his people a plague.\"\n\nHundreds of Wahaki stamp their feet and beat the ground with the butts of their spears. \n\nStill Thaos scowls and thrashes in protest.\n\n\"From this day forward, we must be vigilant. Let us root out such foreigners and keep our lands pure of their wickedness.\"\n\nThe tribe cheers louder than ever. Young and old, Mataru and Roparu, all are united in purpose.\n\nA change seems to come over Thaos. The struggle leaves his body and the rage departs his face.\n\nGood. Let him accept his end.\n\nOne of your attendants offers you a torch.\n\nYou hurl the torch. The flames spread quickly.\n\nThe foreigners scream as the fire advances. All except Thaos, who looks back at you with a strange smile of satisfaction.}}</div>\n\n==Trivia==\n* Note that killing the ranga for the quest [[Tip of the Spear]] will cause her soul to exit her body and linger above her corpse so that you may interact with it, thus preventing the quest from being stuck.\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/Companions/companion_qst_aloth.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Painted Masks'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| <b>Aloth</b> has spent the last five years trying to reform the Leaden Key into a force for good, but the task has proven difficult.\n\nHe wants my help to find a Leaden Key cabal in Deadfire that may provide him with much-needed insight.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Wait for <b>Aloth</b> to explain further.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| <b>Aloth</b> mentioned that he's been tracking the Leaden Key. He promised to tell me more once he's had the chance to review his notes.\n|-\n| rowspan=\"7\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Watch for signs of the \"<b>Painted Masks</b>.\"'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| <b>Aloth</b> told me about an ancient Leaden Key cabal in the area known as the \"<b>Painted Masks</b>.\"\n\nHe said no one in the region seems to know that name, so our best hope is to keep an eye out for signs of the Leaden Key.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| We came across a drifting ship. The crew was dead, but <b>Aloth</b> thought they might be connected to the Leaden Key.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| I read the soul of one of the dead crew. They were simple merchants.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I decided not to investigate the ship. <b>Aloth</b> was disappointed.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| We couldn't determine who killed the crew, though it's likely they're somewhere in the vicinity.\n|-\n| style=\"vertical-align:text-top\" | 20004\n| We met a group of <b>Wahaki</b> at <b>Motare o Kōzi</b>. They wore face paint, but we were unable to learn more from them. We'll have to look for answers elsewhere.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Sail to <b>Ori o Koīki</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| I found evidence that the <b>Wahaki</b> attacked the merchant ship. <b>Aloth</b> still thinks the symbol painted on the sails is evidence of a Leaden Key connection.\n\nPerhaps we can learn more on <b>Ori o Koīki</b>.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Search <b>Ori o Koīki</b> for signs of the Leaden Key.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| I've reached <b>Ori o Koīki</b>, and there are strange signs of a Leaden Key presence, from the mask-like face paintings of the Wahaki to the artwork. \n\nI may be able to learn more by looking around.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Tell <b>Aloth</b> about what you saw in <b>Ruāsare's</b> soul.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| I found a memory of <b>Ruāsare's</b> past life as a long-ago chieftain of the Wahaki. It seems <b>Thaos</b> came to scare her people into abandoning the Engwithan ruins. \n\nShe executed Thaos instead, yet their interaction cemented the Wahaki's suspicion of outsiders. Thus, the tribe has unintentionally served the Leaden Key's interests for almost two thousand years.\n\n<b>Aloth</b> will want to know about this. \n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''6'''\n| colspan=\"2\" | '''Sail to <b>Ori o Koīki</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10006\n| <b>Aloth's</b> description of the \"Painted Masks\" reminded me of the <b>Wahaki</b>, a Huana tribe.\n\nWe may be able to learn more at <b>Ori o Koīki</b>, their home island.\n\n|-\n! colspan=\"3\" | Unused strings\n|-\n| rowspan=\"1\" style=\"vertical-align:text-top; text-align:center\" | '''-'''\n| style=\"vertical-align:text-top\" | 40001\n| <b>Aloth</b> has spent the last five years trying to dismantle the Leaden Key, but the task has been more complicated than he expected.\n\nHe wants my help to find a Leaden Key cabal in <b>Deadfire</b> that may provide him with much-needed insight.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30000\n| Aloth was humbled by the story of Thaos' mistake. He considered whether he's been misguided in his efforts with the Leaden Key.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| Aloth was encouraged by the story of Thaos' unlikely victory. He seemed heartened to know that even his imperfect efforts regarding the Leaden Key may mean progress.\n|}",
  "slug": "thePaintedMasks",
  "title": "The Painted Masks"
}
