{
  "raw": "{{Infobox location poe2\n| game          = bow\n| map           = BOW The Rimebound Temple.png\n| image         = BOW Rimebound Cavern West.png\n| image2        = BOW Rimebound Cavern East.png\n| caption_map   = Exterior\n| caption       = West Cave\n| caption2      = Eastern Cavern\n| name          = The Rimebound Temple\n| type          =\n| description   = \n| exits         = Outcrop on High;#Caverns{{!}}Caverns;Temple of Decline\n| main_location = The Dead Floe\n| sub_locations = Temple of Decline\n| merchant      = \n| expected_level= 14\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = ZN_LAX02_01_Iceberg_Dungeon\n| internalname  = AR_LAX02_0103_Iceberg_03<br/>AR_LAX02_0104_Iceberg_04<br/>AR_LAX02_0105_Iceberg_05<br/>AR_LAX02_0106_Iceberg_06 \n| guid          = 688a7afe-14db-4d07-8203-4571fc77a01c<br/>dbb81e1a-16ab-4ff4-8724-2e8de30ff1a2<br/>f7b52caa-acef-4137-96d0-3d160b4b7d80<br/>26608fa9-7846-4574-b43e-b803e61277c9\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{bow}}.\n\n==Background==\nThis massive temple to [[Rymrgand]] houses a breach that leads into his domain, [[The White Void]], much like [[Noonfrost]] over at [[Twin Elms]]. It was once a mighty center of worship and technology, with armies of rime constructs protecting the faithful from harm. However, something went wrong. \n\nBy 2828 AI, the Temple is the heart of a massive body of ice, rapidly growing throughout the ocean. Known as [[The Dead Floe]], the iceberg currently floats through the south-eastern Deadfire.\n\n==Points of interest==\n* Welcome to the central dungeon of the DLC. This is going to be a long trek, so hope you packed furred underwear. Head east along the ledge to face your first two rime constructs, dormant for now (junking them allows you to complete [[Toasting the Dead]] early). Move down the road to see an episode of WatcherVision<sup>tm</sup>, showing three ghostly people running away deeper into the Temple, mentioning the rime constructs shutting down and asking to be led to the Breach. Spooky.\n* You have two ways down, either through the western or the eastern cave.\n\n===Western cave===\n* This is the straightforward approach, leading to the lower landing. You will be treated to another episode, showing the faithful of Rymrgand trying to rush to the aid of a fellow devotee, as the temple falls under a dragon attack.\n*Mind the snow bears by the exit. They bite. You can find [[Fjord]] here, a pet snow bear you can take after murdering his family, and interact with a bubbling pool of green ooze. You can use Sleight of Hand 9 to collect it, Perception 11 to smell it, or Alchemy 16 to identify it. It's a toxic mix of a particularly nasty, pungent kind. Of course, it's also the [[rime construct fluid]] required for the [[Toasting the Dead]] quest, leading Vatnir to conclude that maybe adding it to the lager is a ''bad idea''.\n*Note that the other half of the level is used to represent the dracolich's lair. \n\n===Eastern cave===\n* There's a large shrine to Rymrgand in the northwest corner, with [[Ehrys]] watching over it. Turning her into a construct will open a shortcut through the locked door, otherwise you will need to take the long way around.\n* The central part contains an improvised altar to Rymrgand, with an ice imp next to it. You can inspect it with Perception 15 to notice that it's not frozen, but hibernating. It's also holding a piece vital to surviving the White Void (see [[To Rise and Decline]] for details). The stairs behind lead to the outcropping and a dead Harbinger with the [[Brooch of Inevitable Winter]].\n* The eastern branch loops towards the entrance and passes through a throng of snow bears and pilgrims, a heavily trapped corridor, and a tomb with the soulbound [[Wintertide Bulwark]] in the tomb.\n* Finally, back at the locked door (or open, if you turned Ehrys into a construct), you can find a hidden switch to open it and an iced-over chest. You can open it with [[Glacierbane]], a fire ability, Might 12, and of course, take a closer look first with Perception 14, which allows you to open it with a prybar or Might 17. The contents are some minor craftable items and [[Frosty]].\n\n==Characters==\n* [[Ehrys]], in the eastern cave.\n\n==Loot==\n* [[Fjord]]: among the snow bears, western cave.\n* [[Brooch of Inevitable Winter]] and [[fortune seeker's journal]]: On a dead fortune hunter, ledge accessible from the eastern cave.\n* [[Eye of Rymrgand]]: carried by the ice imp, eastern cave.\n* [[Wintertide Bulwark]]: In the tomb, eastern cave.\n* [[Frosty]]: In the iced-over chest, eastern cave.\n\n==Gallery==\n<gallery>\nFile:BOW Rimebound Cavern Northeast.png| Northeast Cave\n</gallery>",
  "slug": "theRimeboundTemple",
  "title": "The Rimebound Temple"
}
