{
  "markdown": "from [Nairi](/nairi/);Ability to rest at the [Tikawara shrine](/tikawaraShrine/);\n| rewardname2  = Restore the pillar\n| reward2      = Major Positive reputation with [Tikawara](/tikawara/) (x2);Major Positive reputation with [VTC](/vtc/);[Exceptional Spear](/exceptionalSpearDeadfire/) from [Ranga Ruānu](/rangaRuanu/)\n| rewardname3  = Any outcome\n| reward3      = Storms ravaging Poko Kohara are cleared;[Vektor](/vektor/) available for hire;If you return [Beza's Pages](/bezasPages/) to [Nairi](/nairi/), and ask for a reward: 2x [Potion of Moderate Healing](/potionOfModerateHealing/) and 2x [Potion of the Resilient Body](/potionOfTheResilientBody/)\n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         = Terms of Trade;Dim Prospects\n| internalname = 00_CP_Storms_of_Poko_Kohara\n| guid         = 9ac3a288-fcca-48b8-9fbd-6008136a4659\n}}\n'''{{PAGENAME}}''' is a [quest](/pillarsOfEternityIiDeadfireQuests/) in {{poe2}}.\n\n## Synopsis\n\n \nA vein of luminous adra is rumored to lie among the uncharted ruins of [Poko Kohara](/pokoKohara/). Governor [Lueva Alvari](/luevaAlvari/) of the [Vailian Trading Company](/vailianTradingCompany/) has already sent one expedition to uncover this vein, but has received no report on their status.\n\nShe would like you to find proof of the vein's existence and determine what happened to the first expedition, if possible.\n\nThe first expedition planned to stop at the island of [Tikawara](/tikawara/), southeast of [Neketaka](/neketaka/), where they hoped the locals might direct them on to Poko Kohara. If you speak with the villagers there, perhaps they can provide me with the same information.\n\n## Walkthrough\n\n* This is a quest centering on [Tikawara](/tikawara/) and [Poko Kohara](/pokoKohara/), determining the fate of luminous adra excavation efforts at the ruin as well as that of Tikawara. The quest can be received from the VTC Director or alternatively from [Atsura](/atsura/), who's interested in undercutting his competition.\n* [Tikawara](/tikawara/) is located southeast of Neketaka and is a small, remote [Huana](/huana/) village blighted by storms originating from Poko Kohara. You can learn of the location of the ruins as well as receive the key to the ruins by talking to [Ranga Ruānu](/rangaRuanu/) and promising to help.\n** [Vektor](/vektor/), the cook from the failed Vailian expedition, will explain that he believes the ranga is to blame and the Huana are working against him under suggestion from the conservative priests there.\n* At any rate, make your way to the [Poko Kohara ruins](/pokoKoharaRuins/) and from there down to the [Engwithan waystation](/engwithanWaystation/).  The ruin can be entered with the following methods:{{#lst:Poko Kohara ruins|ruin_entry}}\n* You need to reach the deepest level and the base of the adra pillar in order to resolve the quest. Once there, interact with it and open the portal to [The Adra Realm](/theAdraRealm/). Enter it to start the final phase of the quest.\n* Approach the center area and watch as the sane souls come to the fore, divided between [Anahāru](/anaharu/) and [Beza](/beza/). Anaharu will engage you in dialogue and explain - well, ''proclaim'' - that he is the cause of the storms that wreak havoc across the region. The adra pillar is cut off from the normal flow of souls. His plan is to dissuade the VTC from exploiting the adra on Poko Kohara and thus ensure the safety of [Tikawara](/tikawara/). Once he explains the plan, you can ask him if destroying the region saves Tikawara, use [Beza's Pages](/bezasPages/) to point out the VTC's ruthlessness, or [History](/history/) 4 to point out that Vailia will only be replaced by [Rauatai](/rauatai/). He will not relent - even when you point out that he's the one destroying Tikawara. Finally, your words will decide whom you'll be fighting against.\n**'''Convince Anahāru.''' You can promise to destroy the adra pillar to deny the Vailians a source of luminous adra. Anahāru will be convinced with either ''\"You have my word. I'll destroy the adra.\"'' or ''\"I'll consider it.\"''. He will then disappear, leaving behind Beza and her team, who will attack you in anger.\n** '''Convince Beza.''' If you fail to convince Anahāru, Beza will cut in, asking you to let her team tag along and see if they can reunite with... what's left of their bodies. Dissuade her from it with ''\"It doesn't work that way. You're already gone.\"'' or [Metaphysics](/metaphysics/) 4. Beza will give up and disappear, leaving behind Anahāru who's been dying to kill you.\n** Alternatively, you can just attack and kill them all. Failing to convince both of them will force you to this path.\n* After the battle, you arrive at the decision point, either destroying or restoring the pillar. \n**Restoring the pillar involves restoring the natural flow of the souls to the pillar, allowing it to be filled with souls and later be mined.\n** Destroying the pillar involves manipulating the corrupted essences within the soul-devoid adra and detonating it. The remaining essences will dissipate afterwards. \n* Regardless of your choice, flee through the portal and return to Tikawara. Once you return to the village, you will be met by the ranga and the priestess.\n** If you destroyed the pillar, the ranga will be angry at losing the possibility of making Tikawara a prosperous trading center, but the priestess will be glad that the VTC will no longer threaten their lands. See [Nairi](/nairi/) in the shrine for a {{cp2|1000}} reward, and the ability to rest at the shrine. If you return to [Ranga Ruānu](/rangaRuanu/) in his hut, you'll get a Major Negative reputation lost with Tikawara, and he refuses to talk to you any further.\n** If you restored the pillar, the ranga will be thrilled for the future of Tikawara as an economic center of luminous adra exports, but the priestess will be displeased that you opened up Tikawara to the threat of outsiders. See [Ranga Ruānu](/rangaRuanu/) for a further Major Positive reputation with Tikawara.\n* See [Terms of Trade](/termsOfTrade/) and [Dim Prospects](/dimProspects/) for further outcomes.\n\n## =Post-quest outcomes\n\n=\n* You can later give [Beza's Pages](/bezasPages/) either to:\n** [Ranga Ruānu](/rangaRuanu/) to prove that the VTC were up to no good. Note that you can only do this if you did not destroy the pillar. With Good reputation with Huana, the VTC or with [Honest](/honest/) 3, he will trust you, though he doesn't understand why they would do such a thing - he promises to be cautious about the Vailians intents. Otherwise he refuses to believe you. If you ask for the papers back, he will be confrontational, but you can lie and say that you must return them to the company director.\n** The priestess, [Nairi](/nairi/), who will give you 2x [Potion of Moderate Healing](/potionOfModerateHealing/) and 2x [Potion of the Resilient Body](/potionOfTheResilientBody/), if asked for a reward.\n** [Vektor](/vektor/) who will take it back to the VTC - for no reward.\n** Note that you can pickpocket [Beza's Pages](/bezasPages/) back from the ranga and the priestess.\n* Likewise you can also return the [Ngati Idol](/ngatiIdol/) to either of these characters. However, even if you identified the idol as cursed upon picking it up from Beza's body, the logic for this is slightly bugged - you will need to talk to Nairi (see below) to \"re-learn\" the connection between the idol and the curse.\n** [Ranga Ruānu](/rangaRuanu/) to prove that Nairi was the one responsible for the Vailian expedition's misfortune. Note that you can only do this if you destroyed the pillar. He grabs the idol from you and examines it, and tells you that he will deal with Nairi. This results in Nairi being banished from the tribe.\n** [Vektor](/vektor/) who will have some reactivity to the idol (after you tell him that you found the remains of his expedition). He tells you to return it to Ruānu (assuming he is alive), and that its probably best you keep out of it.\n** [Nairi](/nairi/), after asking her if she's the priestess of the tribe you will notice that the statue of the shrine is identical to the form of the idol you picked up. Then you can accuse her of killing the Vailian explorers with the confusion idol (or back out and go to Ruānu or Vektor). She asks you to give it to her. Complying does not yield any reward, but not doing so causes her to become hostile.\n\n## =Cut \"item\" outcomes\n\n=\n{{Cut content}}\nAn alternate continuation of the ending for this quest was possible, but the logic for it is seemingly broken, or has changed to reduce the amount of \"main\" outcomes that the quest provides. In order to re-enable these endings, you must use {{cmd|SetGlobalValue|n_expedition_log_state 1}} and {{cmd|SetGlobalValue|n_cursed_totem_state 2}} prior to returning to Tikawara and approaching the crowd on the docks.\n\nThese would have been set upon picking up the associated items while in the Poko Kohara ruins. The actual result of these outcomes is not varied depending on whether you destroyed/restored the adra pillar, or even your dialogue options that follow, perhaps further cementing this as cut content.\n* You can then present the crowd with either [Beza's Pages](/bezasPages/), to prove that the VTC wanted to conduct a dangerous experiment on the souls of the tribe and the [Ngati Idol](/ngatiIdol/) to prove that Nairi cursed the last expedition and is responsible for their deaths.\n\n'''Ngati Idol'''\n* Ruanu rushes forward in rage and takes the idol from you, terrified at the possibility of the Vailians seeking revenge. If you restored the adra, Nairi suggests the tribe leave immediately. If you destroyed it, she says that it is good they won't come. You can say:\n** Nothing\n** To have mercy on Nairi ([Benevolent](/benevolent/))\n** Agree with Nairi, and that its better to stay out of the Vailians' crosshairs ([Rational](/rational/))\n** Condemn Nairi for murdering the Vailians and demand punishment ([Passionate](/passionate/))\n** Suggest they instead go to the Vailians for forgiveness, and explain the truth ([Honest](/honest/))\n* Vektor, turned impromptu representative of the VTC, is forced to make a decision on how he should report back to his superiors. You can:\n** Again, say nothing.\n** Ask that he takes pity on the tribe ([Benevolent](/benevolent/))\n** Say that his comrades' families deserve closure, and he should return to the Vailians with the truth ([Honest](/honest/))\n** Tell him to make an example of the tribe as punishment for harboring a murderer ([Cruel](/cruel/))\n* Regardless of what you pick, Vektor says he's only the cook, and that he won't tell the VTC anything. In addition, Nairi is cast from the tribe. These outcomes are identical should you destroy or restore the adra, perhaps further cementing the inconclusive\n\n'''Beza's Pages'''\n* The ranga takes the pages from you and begins to \"read\" them.\n** Let them handle it - take a hands off approach and let the tribe decide what to make of the papers.\n** ''\"Your people should know the truth.\"'' ([Honest](/honest/))\n** ''\"This is about to get interesting.\"'' ([Shady](/shady/))\n** ''\"I couldn't leave you without a warning.\"'' ([Passionate](/passionate/))\n:Again, none of these dialogue options change anything. Ruaru concludes that the papers are nothing more than talk, and that he'll bring it up with the Vailians should they return.\n\n## Companion reactivity\n\n{{See|Nairi|Ranga Ruānu}}\nYour companions have extended reactivity with some of the characters involved in this quest. See the associated NPC pages for more information.\n\n## Trivia\n\n* Once the quest is finished, there will no longer be dust storms outside in [Poko Kohara ruins](/pokoKoharaRuins/).\n\n## Behind the scenes\n\n* This quest was the core of the beta of {{poe2}}. Instead of starting at Neketaka, though, the beta assumed you accepted the VTC assignment and deposited you straight at Tikawara.\n\n## Gallery\n\n<tabber>\nSI graphics=\n<gallery mode=nolines>\n 02 SI Poko Kohara adra pillar restoration.png | Restoration\n 02 SI Poko Kohara adra pillar destruction.png | Destruction\n</gallery>\n|-|\nExpedition visions=\n<gallery mode=nolines widths=200px>\nPE2_VTC_Poko_Kohara_Expedition_0.png | [Dueno](/dueno/) and [Beza](/beza/)\nPE2_VTC_Poko_Kohara_Expedition_0_Spirits.png | As spirits\nPE2_VTC_Poko_Kohara_Expedition_1.png | [Olara](/olara/), [Gian](/gian/), Beza, [Falero](/falero/)\nPE2_VTC_Poko_Kohara_Expedition_1_Spirits.png | As spirits\nPE2_VTC_Poko_Kohara_Expedition_2.png | Falero, Dueno, Beza\nPE2_VTC_Poko_Kohara_Expedition_2_Spirits.png | As spirits\nPE2_VTC_Poko_Kohara_Expedition_3.png | Falero accuses Beza\nPE2_VTC_Poko_Kohara_Expedition_3_Spirits.png | As spirits\nPE2_VTC_Poko_Kohara_Expedition_4.png | In the Adra Realm\n</gallery>\n|-|\nAdra pillar=\n<gallery mode=nolines widths=200px>\n PE2 Storms of Poko Kohara Corrupted.png | Corrupted\n PE2 Storms of Poko Kohara Restoration.png | Restored\n PE2 Storms of Poko Kohara Destruction.png | Destroyed\n</gallery>\n|-|\n</tabber>\n\n## Journal\n\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/00_Prototype/00_CP_Storms_of_Poko_Kohara.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"8\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Storms of Poko Kohara'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| A vein of luminous adra is rumored to lie among the uncharted ruins of <b>Poko Kohara</b>. <b>Governor Lueva Alvari</b> of the Vailian Trading Company has already sent one expedition to uncover this vein, but has received no report on their status. \n\nShe would like me to find proof of the vein's existence and determine what happened to the first expedition, if possible.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| I came upon a desert island which appears to be at the center of curiously violent and unrelenting storms. Something unnatural may be at the heart of the disturbance.\n|-\n| style=\"vertical-align:text-top\" | 40002\n| A Vailian expedition for luminous adra has gone missing in the uncharted island of <b>Poko Kohara</b>. <b>Vektor</b>, who was left behind, wishes to know the fate of his shipmates.\n\nHe is certain the Company would pay handsomely for any information or assistance in recovering the missing crew.\n|-\n| style=\"vertical-align:text-top\" | 40004\n| <b>Director Castol</b> of the Vailian Trading Company made mention of some business interests on an island called <b>Poko Kohara</b>. Governor Alvari had previously sent an expedition to the area, but they have not reported back.\n|-\n| style=\"vertical-align:text-top\" | 40005\n| <b>Atsura</b> of the Royal Deadfire Company believes the Vailian Trading Company is setting up an operation to mine luminous adra on the island of <b>Poko Kohara</b>. He wants me to sabotage this operation, preferably without bloodshed.\n|-\n| style=\"vertical-align:text-top\" | 40006\n| Strange and violent storms around the ruins of <b>Poko Kohara</b> have blighted <b>Tikawara's</b> food supply. <b>Chieftain Ruānu</b> is concerned that the influx of bad weather will threaten the survival of his tribe and their accessibility to wealthy travelers. \n|-\n| rowspan=\"9\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Learn about <b>Poko Kohara</b> in <b>Tikawara</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| The first expedition planned to stop at the island of <b>Tikawara</b>, <b>southeast of Neketaka</b>, where they hoped the locals might direct them on to Poko Kohara. If I speak with the <b>villagers</b> there, perhaps they can provide me with the same information.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I met <b>Vektor</b>, a cook with the Vailian Trading Company expedition. He stayed on Tikawara while his companions continued on to <b>Poko Kohara</b>. He's still waiting for their return. Or news of their deaths.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| <b>Chieftain Ruānu</b> can direct me to Poko Kohara. His hut is in the <b>northeast area of town</b>, on a hill above the trading post.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| I heard mention of the village priestess, <b>Nairi</b>, who is not happy about the recent influx of foreigners. If I want to hear her side of things, I can find her at the <b> shrine</b>.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| <b>Nairi</b>, the priestess, asked me to destroy the luminous adra at <b>Poko Kohara</b>. She fears the Vailians will kill or enslave her tribe.\n|-\n| style=\"vertical-align:text-top\" | 20022\n| I killed <b>Nairi</b>, the village priestess.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| <b>Chieftain Ruānu</b> is dead. I'll have to find <b>Poko Kohara</b> on my own.\n|-\n| style=\"vertical-align:text-top\" | 20018\n| <b>Atsura</b>, an advisor to the Royal Deadfire Company, has asked me to sabotage the luminous adra at <b>Poko Kohara</b> to foil the Vailians’ mining efforts.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Travel to <b>Poko Kohara</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| <b>Poko Kohara</b> lies <b>due east of Tikawara</b> and the ruins are open to explore.\n|-\n| rowspan=\"11\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Search the ruins of <b>Poko Kohara</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| Having docked safely at Poko Kohara, I can explore <b>ruins</b> and see what there is to find.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| An expedition from the Vailian Trading Company abandoned their camp here. Everything appears to be intact.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| I found a map at the camp with directions to <b>Tikawara</b>.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I found a corpse outside <b>the ruins</b>. It seems the rest of the Vailian expedition fled into the ruins to escape the stone titan. \n|-\n| style=\"vertical-align:text-top\" | 20004\n| A pillar of adra descends through the ruins. I found the top, but I'll have to journey below to see the rest.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| Something has corrupted the adra, and it grows worse the deeper I descend.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| I found the corpse of another member of the Vailian Trading Company expedition. It seems they turned on one another.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| <b>Beza</b>, the leader of the Vailian Trading Company expedition, lies slain in the depths of the ruins.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| I found the heart of the corruption. There's a machine here - perhaps that will help me clear it.\n|-\n| style=\"vertical-align:text-top\" | 20021\n| A heavy door bars entrance to the <b>desert ruin</b>. Exploring further will mean finding a way through first.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Enter the corrupted adra.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| Whatever is corrupting the adra is embedded deep within it. I feel a presence coming from within the pillar - I may be able to reach the source of the corruption by projecting my soul into it.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Report my progress to <b>Governor Alvari</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| Now that I know what happened at Poko Kohara, <b>Governor Alvari</b> will be interested in my report.\n\nI can find her at the <b>Vailian Trading Company Headquarters</b> in Neketaka.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I have cleared the corruption from the adra and ended the storms in the area.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I have destroyed the adra, ending the storms as well as any ambition to mine luminous adra.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Escape the adra plane.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| Within the adra, I encountered souls that have been trapped and warped over generations.\n\nI must defeat them and escape or join them forever.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''9'''\n| colspan=\"2\" | '''Report my progress to <b>Director Castol</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10009\n| Now that I know what happened at Poko Kohara, <b>Director Castol</b> will be interested in my report.\n\nI can find him at the <b>Vailian Trading Company Headquarters</b> in Neketaka.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I have cleared the corruption from the adra and ended the storms in the area.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I have destroyed the adra, ending the storms as well as any ambition to mine luminous adra.\n|-\n| rowspan=\"10\" style=\"vertical-align:text-top; text-align:center\" | '''17'''\n| colspan=\"2\" | '''Learn about <b>Poko Kohara</b> in <b>Tikawara</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10017\n| Atsura didn't know the exact location of Poko Kohara, but the inhabitants of <b>Tikawara</b>, an island <b>southeast of Neketaka</b>, might know the way.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I met <b>Vektor</b>, a cook with the Vailian Trading Company expedition. He stayed on Tikawara while his companions continued on to <b>Poko Kohara</b>. He's still waiting for their return. Or news of their deaths.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| <b>Chieftain Ruānu</b> can direct me to Poko Kohara. His hut is in the <b>northeast area of town</b>, on a hill above the trading post.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| I heard mention of the village priestess, <b>Nairi</b>, who is not happy about the recent influx of foreigners. If I want to hear her side of things, I can find her at the <b> shrine</b>.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| <b>Nairi</b>, the priestess, asked me to destroy the luminous adra at <b>Poko Kohara</b>. She fears the Vailians will kill or enslave her tribe.\n|-\n| style=\"vertical-align:text-top\" | 20022\n| I killed <b>Nairi</b>, the village priestess.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| <b>Chieftain Ruānu</b> is dead. I'll have to find <b>Poko Kohara</b> on my own.\n|-\n| style=\"vertical-align:text-top\" | 20016\n| <b>Director Castol</b> of the Vailian Trading Company also asked me to journey to <b>Poko Kohara</b>, in this case to scout a vein of luminous adra and find a missing expedition team.\n|-\n| style=\"vertical-align:text-top\" | 20017\n| <b>Governor Alvari</b> of the Vailian Trading Company also asked me to journey to <b>Poko Kohara</b>, in this case to scout a vein of luminous adra and find a missing expedition team.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''18'''\n| colspan=\"2\" | '''Report my progress to <b>Atsura</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10018\n| Now that I know what happened at Poko Kohara, <b>Atsura</b> will be interested in my report.\n\nI can find him in the <b>Brass Citadel</b> in Neketaka.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I have cleared the corruption from the adra and ended the storms in the area.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I have destroyed the adra, ending the storms as well as any ambition to mine luminous adra.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''20'''\n| colspan=\"2\" | '''Report my progress to either <b>Atsura</b> or <b>Director Castol</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10020\n| Now that I know what happened at Poko Kohara, both <b>Atsura</b> and <b>Director Castol</b> will be interested in my report.\n\nI can find Atsura in the <b>Brass Citadel</b> or Director Castol at the <b>Vailian Trading Company Headquarters</b> in Neketaka.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I have cleared the corruption from the adra and ended the storms in the area.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I have destroyed the adra, ending the storms as well as any ambition to mine luminous adra.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''21'''\n| colspan=\"2\" | '''Report my progress to either <b>Atsura</b> or <b>Governor Alvari</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10021\n| Now that I know what happened at Poko Kohara, both <b>Atsura</b> and <b>Governor Alvari</b> will be interested in my report.\n\nI can find Atsura in the <b>Brass Citadel</b> or Governor Alvari at the <b>Vailian Trading Company Headquarters</b> in Neketaka.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I have cleared the corruption from the adra and ended the storms in the area.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I have destroyed the adra, ending the storms as well as any ambition to mine luminous adra.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30000\n| This quest was somehow failed\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I have cleansed the corruption from the adra, which appears to have stopped the storms in the region.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I have destroyed the adra pillar at the heart of Poko Kohara, which appears to have stopped the storms in the region.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30003\n| I have cleared the storms and corruption from Poko Kohara, which allows the Vailians to begin mining luminous adra there.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30004\n| I have destroyed the adra pillar in Poko Kohara, which will prevent the Vailians from mining luminous adra there.\n|}",
  "raw": "{{Infobox quest poe2\n| name         = The Storms of Poko Kohara\n| image        = PE2 Storms of Poko Kohara.png\n| caption      = \n| added_in     = poe2\n| quest_type   = Side quest\n| quest_region = Poko Kohara\n| quest_level  = 6\n| faction      = Vailian Trading Company;Royal Deadfire Company\n| locations    = Neketaka;Tikawara;Poko Kohara;Poko Kohara ruins;Engwithan waystation;The Adra Realm\n| main_npcs    = Ranga Ruānu;Vektor;Nairi;Gian;Olara;Falero;Dueno;Beza;Anahāru\n| quest_giver  = Atsura;Lueva Alvari\n| xp_amount    = 1000\n| xp_type      = Normal\n| xp_level     = 6\n| xp_weights   = 1;1;1;1;1;1;1;1;1;1;1\n| rewardname1  = Destroy the pillar\n| reward1      = Major Negative reputation with [[Tikawara]];Major Negative reputation with [[VTC]];{{cp2|1000}} from [[Nairi]];Ability to rest at the [[Tikawara shrine]];\n| rewardname2  = Restore the pillar\n| reward2      = Major Positive reputation with [[Tikawara]] (x2);Major Positive reputation with [[VTC]];[[Exceptional Spear (Deadfire)|Exceptional Spear]] from [[Ranga Ruānu]]\n| rewardname3  = Any outcome\n| reward3      = Storms ravaging Poko Kohara are cleared;[[Vektor]] available for hire;If you return [[Beza's Pages]] to [[Nairi]], and ask for a reward: 2x [[Potion of Moderate Healing]] and 2x [[Potion of the Resilient Body]]\n| rewardname4  = \n| reward4      = \n| rewardname5  = \n| reward5      = \n| rewardname6  = \n| reward6      = \n| prev         = \n| conc         = Terms of Trade;Dim Prospects\n| internalname = 00_CP_Storms_of_Poko_Kohara\n| guid         = 9ac3a288-fcca-48b8-9fbd-6008136a4659\n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire quests|quest]] in {{poe2}}.\n\n==Synopsis== \nA vein of luminous adra is rumored to lie among the uncharted ruins of [[Poko Kohara]]. Governor [[Lueva Alvari]] of the [[Vailian Trading Company]] has already sent one expedition to uncover this vein, but has received no report on their status.\n\nShe would like you to find proof of the vein's existence and determine what happened to the first expedition, if possible.\n\nThe first expedition planned to stop at the island of [[Tikawara]], southeast of [[Neketaka]], where they hoped the locals might direct them on to Poko Kohara. If you speak with the villagers there, perhaps they can provide me with the same information.\n\n==Walkthrough==\n* This is a quest centering on [[Tikawara]] and [[Poko Kohara]], determining the fate of luminous adra excavation efforts at the ruin as well as that of Tikawara. The quest can be received from the VTC Director or alternatively from [[Atsura]], who's interested in undercutting his competition.\n* [[Tikawara]] is located southeast of Neketaka and is a small, remote [[Huana]] village blighted by storms originating from Poko Kohara. You can learn of the location of the ruins as well as receive the key to the ruins by talking to [[Ranga Ruānu]] and promising to help.\n** [[Vektor]], the cook from the failed Vailian expedition, will explain that he believes the ranga is to blame and the Huana are working against him under suggestion from the conservative priests there.\n* At any rate, make your way to the [[Poko Kohara ruins]] and from there down to the [[Engwithan waystation]].  The ruin can be entered with the following methods:{{#lst:Poko Kohara ruins|ruin_entry}}\n* You need to reach the deepest level and the base of the adra pillar in order to resolve the quest. Once there, interact with it and open the portal to [[The Adra Realm]]. Enter it to start the final phase of the quest.\n* Approach the center area and watch as the sane souls come to the fore, divided between [[Anahāru]] and [[Beza]]. Anaharu will engage you in dialogue and explain - well, ''proclaim'' - that he is the cause of the storms that wreak havoc across the region. The adra pillar is cut off from the normal flow of souls. His plan is to dissuade the VTC from exploiting the adra on Poko Kohara and thus ensure the safety of [[Tikawara]]. Once he explains the plan, you can ask him if destroying the region saves Tikawara, use [[Beza's Pages]] to point out the VTC's ruthlessness, or [[History]] 4 to point out that Vailia will only be replaced by [[Rauatai]]. He will not relent - even when you point out that he's the one destroying Tikawara. Finally, your words will decide whom you'll be fighting against.\n**'''Convince Anahāru.''' You can promise to destroy the adra pillar to deny the Vailians a source of luminous adra. Anahāru will be convinced with either ''\"You have my word. I'll destroy the adra.\"'' or ''\"I'll consider it.\"''. He will then disappear, leaving behind Beza and her team, who will attack you in anger.\n** '''Convince Beza.''' If you fail to convince Anahāru, Beza will cut in, asking you to let her team tag along and see if they can reunite with... what's left of their bodies. Dissuade her from it with ''\"It doesn't work that way. You're already gone.\"'' or [[Metaphysics]] 4. Beza will give up and disappear, leaving behind Anahāru who's been dying to kill you.\n** Alternatively, you can just attack and kill them all. Failing to convince both of them will force you to this path.\n* After the battle, you arrive at the decision point, either destroying or restoring the pillar. \n**Restoring the pillar involves restoring the natural flow of the souls to the pillar, allowing it to be filled with souls and later be mined.\n** Destroying the pillar involves manipulating the corrupted essences within the soul-devoid adra and detonating it. The remaining essences will dissipate afterwards. \n* Regardless of your choice, flee through the portal and return to Tikawara. Once you return to the village, you will be met by the ranga and the priestess.\n** If you destroyed the pillar, the ranga will be angry at losing the possibility of making Tikawara a prosperous trading center, but the priestess will be glad that the VTC will no longer threaten their lands. See [[Nairi]] in the shrine for a {{cp2|1000}} reward, and the ability to rest at the shrine. If you return to [[Ranga Ruānu]] in his hut, you'll get a Major Negative reputation lost with Tikawara, and he refuses to talk to you any further.\n** If you restored the pillar, the ranga will be thrilled for the future of Tikawara as an economic center of luminous adra exports, but the priestess will be displeased that you opened up Tikawara to the threat of outsiders. See [[Ranga Ruānu]] for a further Major Positive reputation with Tikawara.\n* See [[Terms of Trade]] and [[Dim Prospects]] for further outcomes.\n\n===Post-quest outcomes===\n* You can later give [[Beza's Pages]] either to:\n** [[Ranga Ruānu]] to prove that the VTC were up to no good. Note that you can only do this if you did not destroy the pillar. With Good reputation with Huana, the VTC or with [[Honest]] 3, he will trust you, though he doesn't understand why they would do such a thing - he promises to be cautious about the Vailians intents. Otherwise he refuses to believe you. If you ask for the papers back, he will be confrontational, but you can lie and say that you must return them to the company director.\n** The priestess, [[Nairi]], who will give you 2x [[Potion of Moderate Healing]] and 2x [[Potion of the Resilient Body]], if asked for a reward.\n** [[Vektor]] who will take it back to the VTC - for no reward.\n** Note that you can pickpocket [[Beza's Pages]] back from the ranga and the priestess.\n* Likewise you can also return the [[Ngati Idol]] to either of these characters. However, even if you identified the idol as cursed upon picking it up from Beza's body, the logic for this is slightly bugged - you will need to talk to Nairi (see below) to \"re-learn\" the connection between the idol and the curse.\n** [[Ranga Ruānu]] to prove that Nairi was the one responsible for the Vailian expedition's misfortune. Note that you can only do this if you destroyed the pillar. He grabs the idol from you and examines it, and tells you that he will deal with Nairi. This results in Nairi being banished from the tribe.\n** [[Vektor]] who will have some reactivity to the idol (after you tell him that you found the remains of his expedition). He tells you to return it to Ruānu (assuming he is alive), and that its probably best you keep out of it.\n** [[Nairi]], after asking her if she's the priestess of the tribe you will notice that the statue of the shrine is identical to the form of the idol you picked up. Then you can accuse her of killing the Vailian explorers with the confusion idol (or back out and go to Ruānu or Vektor). She asks you to give it to her. Complying does not yield any reward, but not doing so causes her to become hostile.\n\n===Cut \"item\" outcomes===\n{{Cut content}}\nAn alternate continuation of the ending for this quest was possible, but the logic for it is seemingly broken, or has changed to reduce the amount of \"main\" outcomes that the quest provides. In order to re-enable these endings, you must use {{cmd|SetGlobalValue|n_expedition_log_state 1}} and {{cmd|SetGlobalValue|n_cursed_totem_state 2}} prior to returning to Tikawara and approaching the crowd on the docks.\n\nThese would have been set upon picking up the associated items while in the Poko Kohara ruins. The actual result of these outcomes is not varied depending on whether you destroyed/restored the adra pillar, or even your dialogue options that follow, perhaps further cementing this as cut content.\n* You can then present the crowd with either [[Beza's Pages]], to prove that the VTC wanted to conduct a dangerous experiment on the souls of the tribe and the [[Ngati Idol]] to prove that Nairi cursed the last expedition and is responsible for their deaths.\n\n'''Ngati Idol'''\n* Ruanu rushes forward in rage and takes the idol from you, terrified at the possibility of the Vailians seeking revenge. If you restored the adra, Nairi suggests the tribe leave immediately. If you destroyed it, she says that it is good they won't come. You can say:\n** Nothing\n** To have mercy on Nairi ([[Benevolent]])\n** Agree with Nairi, and that its better to stay out of the Vailians' crosshairs ([[Rational]])\n** Condemn Nairi for murdering the Vailians and demand punishment ([[Passionate]])\n** Suggest they instead go to the Vailians for forgiveness, and explain the truth ([[Honest]])\n* Vektor, turned impromptu representative of the VTC, is forced to make a decision on how he should report back to his superiors. You can:\n** Again, say nothing.\n** Ask that he takes pity on the tribe ([[Benevolent]])\n** Say that his comrades' families deserve closure, and he should return to the Vailians with the truth ([[Honest]])\n** Tell him to make an example of the tribe as punishment for harboring a murderer ([[Cruel]])\n* Regardless of what you pick, Vektor says he's only the cook, and that he won't tell the VTC anything. In addition, Nairi is cast from the tribe. These outcomes are identical should you destroy or restore the adra, perhaps further cementing the inconclusive\n\n'''Beza's Pages'''\n* The ranga takes the pages from you and begins to \"read\" them.\n** Let them handle it - take a hands off approach and let the tribe decide what to make of the papers.\n** ''\"Your people should know the truth.\"'' ([[Honest]])\n** ''\"This is about to get interesting.\"'' ([[Shady]])\n** ''\"I couldn't leave you without a warning.\"'' ([[Passionate]])\n:Again, none of these dialogue options change anything. Ruaru concludes that the papers are nothing more than talk, and that he'll bring it up with the Vailians should they return.\n\n==Companion reactivity==\n{{See|Nairi|Ranga Ruānu}}\nYour companions have extended reactivity with some of the characters involved in this quest. See the associated NPC pages for more information.\n\n==Trivia==\n* Once the quest is finished, there will no longer be dust storms outside in [[Poko Kohara ruins]].\n\n==Behind the scenes==\n* This quest was the core of the beta of {{poe2}}. Instead of starting at Neketaka, though, the beta assumed you accepted the VTC assignment and deposited you straight at Tikawara.\n\n==Gallery==\n<tabber>\nSI graphics=\n<gallery mode=nolines>\n 02 SI Poko Kohara adra pillar restoration.png | Restoration\n 02 SI Poko Kohara adra pillar destruction.png | Destruction\n</gallery>\n|-|\nExpedition visions=\n<gallery mode=nolines widths=200px>\nPE2_VTC_Poko_Kohara_Expedition_0.png | [[Dueno]] and [[Beza]]\nPE2_VTC_Poko_Kohara_Expedition_0_Spirits.png | As spirits\nPE2_VTC_Poko_Kohara_Expedition_1.png | [[Olara]], [[Gian]], Beza, [[Falero]]\nPE2_VTC_Poko_Kohara_Expedition_1_Spirits.png | As spirits\nPE2_VTC_Poko_Kohara_Expedition_2.png | Falero, Dueno, Beza\nPE2_VTC_Poko_Kohara_Expedition_2_Spirits.png | As spirits\nPE2_VTC_Poko_Kohara_Expedition_3.png | Falero accuses Beza\nPE2_VTC_Poko_Kohara_Expedition_3_Spirits.png | As spirits\nPE2_VTC_Poko_Kohara_Expedition_4.png | In the Adra Realm\n</gallery>\n|-|\nAdra pillar=\n<gallery mode=nolines widths=200px>\n PE2 Storms of Poko Kohara Corrupted.png | Corrupted\n PE2 Storms of Poko Kohara Restoration.png | Restored\n PE2 Storms of Poko Kohara Destruction.png | Destroyed\n</gallery>\n|-|\n</tabber>\n\n==Journal==\n{| class=\"wikitable\"\n! colspan=\"3\" style=\"word-break:break-all\" | <small>Quests/00_Prototype/00_CP_Storms_of_Poko_Kohara.quest</small>\n|-\n! width=\"40px\" | {{tooltip|ID|Objectives: 0, Descriptions: 10000, Addenda: 20000, End states: 30000, Alternate descriptions: 40000}}\n! colspan=\"2\" | Objectives\n|-\n| rowspan=\"8\" style=\"vertical-align:text-top; text-align:center\" | '''0'''\n| colspan=\"2\" | '''The Storms of Poko Kohara'''\n|-\n| style=\"vertical-align:text-top\" | 10000\n| A vein of luminous adra is rumored to lie among the uncharted ruins of <b>Poko Kohara</b>. <b>Governor Lueva Alvari</b> of the Vailian Trading Company has already sent one expedition to uncover this vein, but has received no report on their status. \n\nShe would like me to find proof of the vein's existence and determine what happened to the first expedition, if possible.\n\n|-\n| colspan=\"2\" style=\"text-align:center\" | '''Alternate descriptions'''\n|-\n| style=\"vertical-align:text-top\" | 40001\n| I came upon a desert island which appears to be at the center of curiously violent and unrelenting storms. Something unnatural may be at the heart of the disturbance.\n|-\n| style=\"vertical-align:text-top\" | 40002\n| A Vailian expedition for luminous adra has gone missing in the uncharted island of <b>Poko Kohara</b>. <b>Vektor</b>, who was left behind, wishes to know the fate of his shipmates.\n\nHe is certain the Company would pay handsomely for any information or assistance in recovering the missing crew.\n|-\n| style=\"vertical-align:text-top\" | 40004\n| <b>Director Castol</b> of the Vailian Trading Company made mention of some business interests on an island called <b>Poko Kohara</b>. Governor Alvari had previously sent an expedition to the area, but they have not reported back.\n|-\n| style=\"vertical-align:text-top\" | 40005\n| <b>Atsura</b> of the Royal Deadfire Company believes the Vailian Trading Company is setting up an operation to mine luminous adra on the island of <b>Poko Kohara</b>. He wants me to sabotage this operation, preferably without bloodshed.\n|-\n| style=\"vertical-align:text-top\" | 40006\n| Strange and violent storms around the ruins of <b>Poko Kohara</b> have blighted <b>Tikawara's</b> food supply. <b>Chieftain Ruānu</b> is concerned that the influx of bad weather will threaten the survival of his tribe and their accessibility to wealthy travelers. \n|-\n| rowspan=\"9\" style=\"vertical-align:text-top; text-align:center\" | '''1'''\n| colspan=\"2\" | '''Learn about <b>Poko Kohara</b> in <b>Tikawara</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10001\n| The first expedition planned to stop at the island of <b>Tikawara</b>, <b>southeast of Neketaka</b>, where they hoped the locals might direct them on to Poko Kohara. If I speak with the <b>villagers</b> there, perhaps they can provide me with the same information.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I met <b>Vektor</b>, a cook with the Vailian Trading Company expedition. He stayed on Tikawara while his companions continued on to <b>Poko Kohara</b>. He's still waiting for their return. Or news of their deaths.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| <b>Chieftain Ruānu</b> can direct me to Poko Kohara. His hut is in the <b>northeast area of town</b>, on a hill above the trading post.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| I heard mention of the village priestess, <b>Nairi</b>, who is not happy about the recent influx of foreigners. If I want to hear her side of things, I can find her at the <b> shrine</b>.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| <b>Nairi</b>, the priestess, asked me to destroy the luminous adra at <b>Poko Kohara</b>. She fears the Vailians will kill or enslave her tribe.\n|-\n| style=\"vertical-align:text-top\" | 20022\n| I killed <b>Nairi</b>, the village priestess.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| <b>Chieftain Ruānu</b> is dead. I'll have to find <b>Poko Kohara</b> on my own.\n|-\n| style=\"vertical-align:text-top\" | 20018\n| <b>Atsura</b>, an advisor to the Royal Deadfire Company, has asked me to sabotage the luminous adra at <b>Poko Kohara</b> to foil the Vailians’ mining efforts.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''2'''\n| colspan=\"2\" | '''Travel to <b>Poko Kohara</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10002\n| <b>Poko Kohara</b> lies <b>due east of Tikawara</b> and the ruins are open to explore.\n|-\n| rowspan=\"11\" style=\"vertical-align:text-top; text-align:center\" | '''3'''\n| colspan=\"2\" | '''Search the ruins of <b>Poko Kohara</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10003\n| Having docked safely at Poko Kohara, I can explore <b>ruins</b> and see what there is to find.\n|-\n| style=\"vertical-align:text-top\" | 20000\n| An expedition from the Vailian Trading Company abandoned their camp here. Everything appears to be intact.\n|-\n| style=\"vertical-align:text-top\" | 20008\n| I found a map at the camp with directions to <b>Tikawara</b>.\n|-\n| style=\"vertical-align:text-top\" | 20003\n| I found a corpse outside <b>the ruins</b>. It seems the rest of the Vailian expedition fled into the ruins to escape the stone titan. \n|-\n| style=\"vertical-align:text-top\" | 20004\n| A pillar of adra descends through the ruins. I found the top, but I'll have to journey below to see the rest.\n|-\n| style=\"vertical-align:text-top\" | 20005\n| Something has corrupted the adra, and it grows worse the deeper I descend.\n|-\n| style=\"vertical-align:text-top\" | 20007\n| I found the corpse of another member of the Vailian Trading Company expedition. It seems they turned on one another.\n|-\n| style=\"vertical-align:text-top\" | 20006\n| <b>Beza</b>, the leader of the Vailian Trading Company expedition, lies slain in the depths of the ruins.\n|-\n| style=\"vertical-align:text-top\" | 20009\n| I found the heart of the corruption. There's a machine here - perhaps that will help me clear it.\n|-\n| style=\"vertical-align:text-top\" | 20021\n| A heavy door bars entrance to the <b>desert ruin</b>. Exploring further will mean finding a way through first.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''4'''\n| colspan=\"2\" | '''Enter the corrupted adra.'''\n|-\n| style=\"vertical-align:text-top\" | 10004\n| Whatever is corrupting the adra is embedded deep within it. I feel a presence coming from within the pillar - I may be able to reach the source of the corruption by projecting my soul into it.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''5'''\n| colspan=\"2\" | '''Report my progress to <b>Governor Alvari</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10005\n| Now that I know what happened at Poko Kohara, <b>Governor Alvari</b> will be interested in my report.\n\nI can find her at the <b>Vailian Trading Company Headquarters</b> in Neketaka.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I have cleared the corruption from the adra and ended the storms in the area.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I have destroyed the adra, ending the storms as well as any ambition to mine luminous adra.\n|-\n| rowspan=\"2\" style=\"vertical-align:text-top; text-align:center\" | '''7'''\n| colspan=\"2\" | '''Escape the adra plane.'''\n|-\n| style=\"vertical-align:text-top\" | 10007\n| Within the adra, I encountered souls that have been trapped and warped over generations.\n\nI must defeat them and escape or join them forever.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''9'''\n| colspan=\"2\" | '''Report my progress to <b>Director Castol</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10009\n| Now that I know what happened at Poko Kohara, <b>Director Castol</b> will be interested in my report.\n\nI can find him at the <b>Vailian Trading Company Headquarters</b> in Neketaka.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I have cleared the corruption from the adra and ended the storms in the area.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I have destroyed the adra, ending the storms as well as any ambition to mine luminous adra.\n|-\n| rowspan=\"10\" style=\"vertical-align:text-top; text-align:center\" | '''17'''\n| colspan=\"2\" | '''Learn about <b>Poko Kohara</b> in <b>Tikawara</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10017\n| Atsura didn't know the exact location of Poko Kohara, but the inhabitants of <b>Tikawara</b>, an island <b>southeast of Neketaka</b>, might know the way.\n|-\n| style=\"vertical-align:text-top\" | 20001\n| I met <b>Vektor</b>, a cook with the Vailian Trading Company expedition. He stayed on Tikawara while his companions continued on to <b>Poko Kohara</b>. He's still waiting for their return. Or news of their deaths.\n|-\n| style=\"vertical-align:text-top\" | 20010\n| <b>Chieftain Ruānu</b> can direct me to Poko Kohara. His hut is in the <b>northeast area of town</b>, on a hill above the trading post.\n|-\n| style=\"vertical-align:text-top\" | 20012\n| I heard mention of the village priestess, <b>Nairi</b>, who is not happy about the recent influx of foreigners. If I want to hear her side of things, I can find her at the <b> shrine</b>.\n|-\n| style=\"vertical-align:text-top\" | 20011\n| <b>Nairi</b>, the priestess, asked me to destroy the luminous adra at <b>Poko Kohara</b>. She fears the Vailians will kill or enslave her tribe.\n|-\n| style=\"vertical-align:text-top\" | 20022\n| I killed <b>Nairi</b>, the village priestess.\n|-\n| style=\"vertical-align:text-top\" | 20002\n| <b>Chieftain Ruānu</b> is dead. I'll have to find <b>Poko Kohara</b> on my own.\n|-\n| style=\"vertical-align:text-top\" | 20016\n| <b>Director Castol</b> of the Vailian Trading Company also asked me to journey to <b>Poko Kohara</b>, in this case to scout a vein of luminous adra and find a missing expedition team.\n|-\n| style=\"vertical-align:text-top\" | 20017\n| <b>Governor Alvari</b> of the Vailian Trading Company also asked me to journey to <b>Poko Kohara</b>, in this case to scout a vein of luminous adra and find a missing expedition team.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''18'''\n| colspan=\"2\" | '''Report my progress to <b>Atsura</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10018\n| Now that I know what happened at Poko Kohara, <b>Atsura</b> will be interested in my report.\n\nI can find him in the <b>Brass Citadel</b> in Neketaka.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I have cleared the corruption from the adra and ended the storms in the area.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I have destroyed the adra, ending the storms as well as any ambition to mine luminous adra.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''20'''\n| colspan=\"2\" | '''Report my progress to either <b>Atsura</b> or <b>Director Castol</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10020\n| Now that I know what happened at Poko Kohara, both <b>Atsura</b> and <b>Director Castol</b> will be interested in my report.\n\nI can find Atsura in the <b>Brass Citadel</b> or Director Castol at the <b>Vailian Trading Company Headquarters</b> in Neketaka.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I have cleared the corruption from the adra and ended the storms in the area.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I have destroyed the adra, ending the storms as well as any ambition to mine luminous adra.\n|-\n| rowspan=\"4\" style=\"vertical-align:text-top; text-align:center\" | '''21'''\n| colspan=\"2\" | '''Report my progress to either <b>Atsura</b> or <b>Governor Alvari</b>.'''\n|-\n| style=\"vertical-align:text-top\" | 10021\n| Now that I know what happened at Poko Kohara, both <b>Atsura</b> and <b>Governor Alvari</b> will be interested in my report.\n\nI can find Atsura in the <b>Brass Citadel</b> or Governor Alvari at the <b>Vailian Trading Company Headquarters</b> in Neketaka.\n|-\n| style=\"vertical-align:text-top\" | 20019\n| I have cleared the corruption from the adra and ended the storms in the area.\n|-\n| style=\"vertical-align:text-top\" | 20020\n| I have destroyed the adra, ending the storms as well as any ambition to mine luminous adra.\n\n|-\n! colspan=\"3\" | End states\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30000\n| This quest was somehow failed\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30001\n| I have cleansed the corruption from the adra, which appears to have stopped the storms in the region.\n|-\n| style=\"text-align:center\" | {{check}}\n| style=\"vertical-align: text-top\" | 30002\n| I have destroyed the adra pillar at the heart of Poko Kohara, which appears to have stopped the storms in the region.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30003\n| I have cleared the storms and corruption from Poko Kohara, which allows the Vailians to begin mining luminous adra there.\n|-\n| style=\"text-align:center\" | -\n| style=\"vertical-align: text-top\" | 30004\n| I have destroyed the adra pillar in Poko Kohara, which will prevent the Vailians from mining luminous adra there.\n|}",
  "slug": "theStormsOfPokoKohara",
  "title": "The Storms of Poko Kohara"
}
