{
  "raw": "{{Infobox location poe2\n| game          = bow\n| map           = BOW Shattered Passage.png\n| caption_map   = \n| name          = The Shattered Passage\n| type          =\n| description   = \n| exits         = Temple of Decline\n| main_location = The White Void\n| sub_locations = The Drowned Kingdom;The Endless Queries;The Bridge Ablaze\n| merchant      = \n| expected_level= 15\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = yes\n| zone_id       = zn_lax02_02_rymrgand_beyond\n| internalname  = AR_LAX02_0201_Hub\n| guid          = 9d3c699b-7e93-4ebf-90a0-bcc4cf9a532c\n| lsc           = \n| icon          = \n}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{bow}}.\n\n==Background==\nThis is the hub area for the White Void, which you visit as you try to find the dracolich. Hanging above the endless waste of Rymrgand's domain, this area connects to three echo realms, spaces adrift in the void and buoyed by the tenacity of the souls within: A drowned kingdom of salt and coral, a copper realm chained in questions, and one young and as hot as a festival flame.\n\n==Progression==\n* If you complete [[The Endless Queries]] before [[The Bridge Ablaze]], you can use [[Betrayal]] to assume [[Durance]]'s form and force the magranite priest to reveal the construction of the bomb. Then you can imitate Durance (or refuse to do so out of disgust at Durance) and gain the schematics. Disarming the bomb grants you the [[Detonator Shard]], a little piece of a time paradox.\n*Using [[Betrayal]], the Watcher can have the [[Glamfellen Soul]] and the [[Kuaru Spirit]] returned to the Wheel (joining the Watcher's retinue of souls). Alternatively, they can be consigned to oblivion.\n\n==Points of interest==\n* This is a simple, hub area. The central arena is where you meet [[Rynhaedr]] and [[Neriscyrlas]], while pathways to accessing the realms lie to the west, north, and east.\n* Approaching the entrance to the Drowned Kingdom will trigger a cutscene with an aumaua spirit, which quickly degenerates into a shambling soul. Killing it will grant the [[Kaihōa]], a magical trinket.\n* The reversal of the flow by the aumaua spirit does give access to the [[Kuaru Spirit]], who is busy repairing a bridge - or so it thinks - and will prevent crossing, as it's only meant for Mataru warriors. If you have [[Betrayal]], you can pose as her ranga and gain access to a chest containing a [[void shard]], and a portal.\n* The portal will teleport you to the opposite side of the map and another ray of light. Activate the ray of light, and talk to the [[Glamfellen Soul]] to get the mace [[Frostfall]]. If you have [[Betrayal]], you can pose as her husband, Hymir, during the conversation, giving access to a happy conclusion.\n*By activating the ray of Light outside The Endless Queries, you repair the conch stood there. Activate it to drain the pool of water on the platform just south of where the conch is, in order to gain access to a chest.\n\n==Characters==\n* [[Rynhaedr]]\n* [[Neriscyrlas]]\n\n==Loot==\n* [[Kaihōa]]: Dropped by the aumaua spirit (Shambling Soul) encountered near the entrance to the Drowned Kingdom. Enables the Watcher to activate the conches and control flow of water.\n* [[Frostfall]]: Given by, or taken from, the [[Glamfellen Soul]], on the east-southeastern floating isle.\n{{DEFAULTSORT:Shattered Passage, The}}",
  "slug": "theShatteredPassage",
  "title": "The Shattered Passage"
}
