{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Toaku Biwha Trail.png\n| image         = PE2 Toaku Biwha Trail Jungle.png\n| caption_map   = \n| name          = Toaku Biwha Trail\n| type          = Scripted interaction\n| description   = \n| exits         = \n| sub_locations = Jungle\n| merchant      = \n| innkeeper     = \n| inhabitants   = Delemgan (Deadfire){{!}}Delemgan;Dank Spore (Deadfire){{!}}Dank Spore;Sporeling (Deadfire){{!}}Sporeling;Earth Blight;Lesser Earth Blight\n| main_location = Tehiwai Islands\n| plants        = \n| internalname  = \n| lsc           = \n| icon          = Icon Forest Dark.png\n}}\n'''{{Pagename nd}}''' is a scripted interaction on [[Tehiwai Islands]].\n\n== Background ==\nToaku Biwha Trail is a path running along the eastern side of Tehiwai Island, joining [[Tikawara]] to the south with the stretch of land to the northeast. It consists of mostly dense woods.\n\n== Interaction ==\n* Nostalgic scents of honey, cinnamon and fresh bread gradually waft over the trail, drawing you closer to investigate the source. Off the path you catch a glimmer of movement. Something large and bulbous stirs beyond the trees. You can choose to:\n** Approach openly (see below).\n** Sneak closer to observe, with Stealth 5. You can choose to ambush the creatures, which will put you in sneak by the southwestern corner of the area.\n* Coming to a nearby clearing, you spot a [[Delemgan (Deadfire)|delemgan]], a nature spirit in the shape of a female elf. The creature is tending to a large spore. Spotting you, she places a protective hand on the spore - yet her attention is focused on you. She asks you why you're here.\n** Examine the spore with Survival 6. It stands tall, and a thin cloud of yellow dust surrounds it. You identify it as a [[Dank Spore (Deadfire)|Dank Spore]], and know that it will attack you on sight. Underneath the spore, you can make out the form of a kith - an unfortunate victim. The spore is slowly absorbing the nutrients from the corpse.\n** Ask why she's demanding. If you have [[Aloth]] in your party, he will chime in here.\n** Ask if she's in trouble, or needs help, she will decline and will comment on the state of the dank spore. Spores use scents to entice potential victims, drawing them closer until they succumb. Even though the dank spore already has a host, it is still emanating the sweet scent. You can spot a dusty tome poking from beneath its roots. Unless you have Aggressive 2 disposition she will offer you a mushroom cap as a peace offering; eating it will end the interaction and will grant you [[Status effects (Deadfire)#Nature's Resolve|Nature's Resolve]] (+10 Accuracy, +2 Resolve).\n** Threaten to turn them into firewood. With Intimidate 7 you scare off the Delemgan and fight the rest of the creatures.\n** Leave. If you have offered help, she bids you farewell, and asks that you tread carefully in the woods. If you have not, she will panic out of fear of you bringing others to the forest and will attack.\n* If you provoke the creatures, they will attack - placing you in the [[Jungle]] staging area. Nothing particularly harmful here; a [[Delemgan (Deadfire)|Delemgan]], a [[Dank Spore (Deadfire)|Dank Spore]], x3 [[Sporeling (Deadfire)|Sporeling]]s, an [[Earth Blight (Deadfire)|Earth Blight]] and a [[Lesser Earth Blight]].\n* You can loot a [[Spore-Coated Grimoire]] from the Dank Spore, all that remains of its host.\n\n== Gallery ==\n<gallery mode=\"nolines\">\nFile:RE si jungle.png\nFile:Bestiary delemgan.png\n</gallery>",
  "slug": "toakuBiwhaTrail",
  "title": "Toaku Biwha Trail"
}
