{
  "raw": "{{Infobox location poe2\n| game          = poe2\n| map           = PE2 Watershapers Guild.png\n| caption_map   = Guild\n| image         = PE2 Guild Ruins.png\n| caption       = Guild ruins\n| name          = Watershapers Guild\n| type          = Building\n| description   = \n| exits         = \n| sub_locations =\n| merchant      = \n| innkeeper     = \n| inhabitants   = Guildmaster Mairu;Tekēhu;Warūa;Ekenu;Zihaa;Scyorielaphas\n| main_location = Periki's Overlook\n| plants        = Ink Harp\n| expected_level= 10\n| grants_xp     = yes\n| override_xp   = \n| is_crit_path  = no\n| can_camp      = no\n| zone_id       = zn_05_artisans_district\n| internalname  = AR_0511_Guild<br/>AR_0512_Dragon_Prison\n| guid          = 2593a4bd-edc7-45c4-ab6b-35f5e5b74f87<br/>0d6bcee4-9993-4956-a577-c321bf19a51d\n| lsc           = \n| icon          = \n}}\n{{DisambigMsg|the location|the faction|Watershapers Guild (faction)}}\n'''{{PAGENAME}}''' is a [[Pillars of Eternity II: Deadfire world map|location]] in {{poe2}}.\n\n==Background==\n{{Main|Watershapers Guild (faction)}}\nWatershaping is an ancient tradition, taught only to select members of the Mataru caste. It is believed to have been taught to the Huana by Ondra herself, as a gift for their devotion. The Watershapers provide the [[Huana]] with much needed magical support, especially in confrontation with [[Rauatai]] and the [[RDC]]. For example, during the Battle of Nakaro Atoll in 2758 AI, when Rauatai encroached on Huana lands and made a enemy of the Wahaki tribe, the bloody conflict came to a head at the Atoll and Watershapers carved a swath through enemy ships with their magic. It took ''The Tenets of Iron'' and depth charges meant for use against sea monsters to turn the tide against the Huana. In the aftermath, the Huana crown dispatched watershapers to sink Rauatai's flagship as a reprisal and a demonstration of power. \n\nWhile not credited for the origins of the watershapers guild historically (it had existed long before, in various forms), the modern iteration of the guild, and the guild building itself was founded by [[Periki|Guildmaster Periki]] in 2801 AI, in the wake of Ondra's cataclysmic destruction of the remnants of [[Engwith]]. Salvaging what she could, Periki organized the lore of Ngati's talent into a series of postures and meditations called the \"Four Forms of Watershaping\": \n\n# '''The Form of Grief''': The easiest form, focusing on the realization that try as they might to embody Ngati's element, Huana bodies are not water.\n# '''The Form of Hope''': Dictates that the body's internal water is a force that conquers all. Even the mountain will bow to the stream.\n# '''The Form of Metamorphosis''': Water commands its vessel, and the vessel can be shaped as surely as the mountain.\n# '''The Form of Transcendence''': An ancient, legendary form that Periki could not - or did not - commit to her scrolls, covering the true power of Huana's ancestors: Reshaping the very Deadfire.\n\n==Points of interest==\n* This is a large guild building dominated by the central great hall, with adjacent meditation and meeting rooms. The first time you enter, [[Guildmaster Mairu]] will be busy chewing [[Tekēhu]] out for his shirking of duties. You can recruit him afterwards.\n* In the training room to the side sits [[Warūa]]. The adjacent common room contains a chest with a Watershaper's robe.\n* The Guildmaster holds court in the center, near the waterfall.\n* The library contains minor loot to steal, as well as [[The Four Forms of Watershaping]] and [[Daraku's Reply]].\n* Past that is the meditation chamber and a staircase leading to the guild ruins below.\n;Guild ruins\n* The ruins are heavily overgrown with vegetation. The door leading to Periki's sanctum cannot be unlocked at first visit. Moving down the stairs you can reach a chamber with Periki's tomb, with an adjacent overgrown library and a grotto to the southeast. [[Ekenu]] is responsible for watching over the tomb. You can interact with the statue for a memory of Periki and inspect the plaque. With Perception 12, you realize that the inscription on it was ''purposefully'' marred.\n;Scyorielaphas' prison\n* A large circular area, with a series of magical wards around its perimeter. Also of note is the big scary sea dragon in the center, named [[Scyorielaphas]], the Deep Hunter. See [[The Shadow Under Neketaka]] for more info.\n\n==Characters==\n* [[Guildmaster Mairu]]\n* [[Tekēhu]], a recruitable companion.\n* [[Warūa]], a novice watershaper.\n\n'''Guild Ruins'''\n* [[Ekenu]], caretaker of the tomb.\n* [[Zihaa]], leader of the naga.\n* [[Scyorielaphas]], dragon, accessed via the door in the first section.\n\n==Loot==\n* [[Watershaper's Robe]]: In the chest in the common room.\n* [[Exceptional Scale Armor (Deadfire)|Exceptional Scale Armor]]: In the sarcophagus in Periki's Tomb.\n\n==Gallery==\n<gallery mode=nolines widths=200px heights=200px>\nPE2_Watershapers_Guild_Exterior.png | Building exterior\n</gallery>",
  "slug": "watershapersGuild",
  "title": "Watershapers Guild"
}
